var jsonZbData = [
  {
    美国: [-73.97622, 40.757498],

    加拿大: [-109.404347, 60.638178],

    澳大利亚: [137.708144, -25.328065],

    中国: [116.512885, 39.847469],

    新加坡: [103.413384, 1.910925],

    阿富汗: [69.132386, 34.739287],

    安哥拉: [13.285773, -8.748538],

    阿尔巴尼亚: [19.809499, 41.389924],

    阿根廷: [-64.388276, -31.379492],

    阿拉伯联合酋长国: [54.662609, 24.390891],

    奥地利: [16.373532, 48.209137],

    阿塞拜疆共和国: [49.867851, 40.409897],

    阿塞拜疆: [49.867851, 40.409897],

    比利时: [4.342799, 50.85052],

    贝宁: [2.626232, 6.499347],

    布基纳法索: [-1.521672, 12.375667],

    孟加拉人民共和国: [90.410568, 23.813179],

    孟加拉国: [90.410568, 23.813179],

    保加利亚: [23.318705, 42.69792],

    巴哈马: [-73.562575, 40.655271],

    南斯拉夫社会主义联邦共和国: [18.423339, 43.796617],

    南斯拉夫: [18.423339, 43.796617],

    白俄罗斯: [27.564451, 53.975825],

    伯利兹: [12.849472, -4.571506],

    百慕大群岛: [-86.054972, 40.038827],

    玻利维亚: [-65.25441, -19.04074],

    巴西: [-47.888777, -15.791724],

    文莱: [114.951828, 4.948475],

    不丹王国: [89.647324, 27.476933],

    博茨瓦纳: [25.967078, -24.62583],

    中非共和国: [18.557903, 4.396116],

    中非: [18.557903, 4.396116],

    瑞士: [7.44716, 46.950139],

    智利: [-70.693344, -33.27],

    科特迪瓦: [-5.255454, 6.826119],

    喀麦隆: [11.502655, 3.852758],

    刚果民主共和国: [15.2495, -4.422756],

    刚果共和国: [15.240923, -4.063634],

    哥伦比亚共和国: [-74.074104, 4.715315],

    哥伦比亚: [-74.074104, 4.715315],

    哥斯达黎加共和国: [-90.871819, 14.023867],

    哥斯达黎加: [-90.871819, 14.023867],

    古巴共和国: [-82.366883, 23.119708],

    古巴: [-82.366883, 23.119708],

    北塞浦路斯: [33.380839, 35.184858],

    塞浦路斯: [33.380264, 35.183442],

    捷克共和国: [14.437258, 50.078142],

    捷克: [14.437258, 50.078142],

    德国: [13.40498, 52.521199],

    吉布提共和国: [43.146919, 11.573827],

    吉布提: [43.146919, 11.573827],

    丹麦: [12.431735, 55.665973],

    多米尼加共和国: [-69.98385, 18.50228],

    多米尼加: [-69.98385, 18.50228],

    阿尔及利亚: [3.058874, 36.755571],

    厄瓜多尔: [-78.467263, -0.179206],

    埃及: [31.236287, 30.045171],

    厄立特里亚: [38.925716, 15.324804],

    西班牙: [-3.703414, 40.419467],

    爱沙尼亚: [24.75379, 59.439569],

    埃塞俄比亚: [38.753839, 8.986474],

    芬兰: [24.935506, 60.173495],

    斐济: [178.450079, -18.122335],

    马尔维纳斯群岛: [-57.940098, -51.615196],

    法国: [2.333696, 48.865244],

    加蓬: [9.495768, 0.436579],

    英国: [-0.130058, 51.508604],

    格鲁吉亚: [44.827351, 41.71589],

    加纳: [-0.188114, 5.604581],

    几内亚: [-13.577316, 9.644511],

    冈比亚: [-16.582383, 13.457299],

    几内亚比绍: [-15.619766, 11.885767],

    赤道几内亚: [8.736346, 3.749414],

    希腊: [23.72821, 37.9846],

    格陵兰: [-51.573608, 64.213084],

    危地马拉: [-90.543513, 14.649067],

    圭亚那: [-58.140752, 6.803865],

    圭亚那合作共和国: [-58.149951, 6.81306],

    洪都拉斯共和国: [-87.253756, 14.044503],

    洪都拉斯: [-87.253756, 14.044503],

    克罗地亚: [15.974196, 45.812166],

    海地: [-72.307002, 18.595629],

    匈牙利: [19.04196, 47.498109],

    印度尼西亚: [106.870937, -6.240893],

    印尼: [106.870937, -6.240893],

    印度: [77.206503, 28.62928],

    爱尔兰: [-6.259735, 53.350324],

    伊朗: [51.388399, 35.6899],

    伊拉克: [44.363655, 33.314606],

    冰岛: [-21.859781, 64.099918],

    以色列: [35.21141, 31.77102],

    意大利: [12.491267, 41.904612],

    牙买加: [-76.8099041, 18.0178743],

    约旦: [35.927003, 31.946341],

    日本: [139.713657, 35.707004],

    哈萨克斯坦: [71.470572, 51.160655],

    肯尼亚: [36.820997, -1.291346],

    吉尔吉斯: [74.569345, 42.874887],

    吉尔吉斯斯坦: [74.569345, 42.874887],

    柬埔寨: [104.891769, 11.545102],

    韩国: [126.986407, 37.536804],

    科索沃共和国: [21.163778, 42.663444],

    科索沃: [21.163778, 42.663444],

    科威特: [47.977439, 29.376031],

    老挝: [102.632451, 17.975794],

    黎巴嫩: [35.500052, 33.89439],

    利比里亚: [-10.761016, 6.291152],

    利比亚: [13.19135, 32.887237],

    斯里兰卡: [79.865104, 6.909415],

    莱索托: [29.085487, -29.04088],

    立陶宛: [25.279069, 54.687457],

    卢森堡: [6.131308, 49.613029],

    拉脱维亚: [24.105101, 56.949378],

    摩洛哥: [-6.862605, 33.977609],

    摩尔多瓦: [28.858505, 47.012344],

    马达加斯加: [47.508608, -18.867016],

    墨西哥: [-99.134543, 19.433793],

    马其顿共和国: [21.427289, 41.997997],

    马其顿: [21.427289, 41.997997],

    马里共和国: [-8.003581, 12.640388],

    马里: [-8.003581, 12.640388],

    缅甸: [96.077119, 19.763943],

    黑山共和国: [19.261583, 42.435497],

    黑山: [19.261583, 42.435497],

    蒙古: [106.908677, 47.915632],

    莫桑比克: [32.602247, -25.890353],

    毛里塔尼亚: [-15.964452, 18.0745],

    马拉维: [33.774057, -13.961542],

    马来西亚: [101.681865, 3.136134],

    纳米比亚: [17.034567, -22.555179],

    新喀里多尼亚: [166.449312, -22.251664],

    尼日尔: [2.118056, 13.516354],

    尼日利亚: [7.459498, 9.126437],

    尼加拉瓜共和国: [-86.236749, 12.115559],

    尼加拉瓜: [-86.236749, 12.115559],

    荷兰: [4.89354, 52.370649],

    挪威: [10.7522454, 59.9138688],

    尼泊尔: [85.320511, 27.711],

    新西兰: [174.761827, -41.291661],

    阿曼: [58.405562, 23.587133],

    巴基斯坦伊斯兰: [73.076186, 33.714975],

    巴基斯坦: [73.076186, 33.714975],

    巴拿马: [-79.401974, 9.102657],

    秘鲁: [-77.042548, -12.044223],

    菲律宾: [120.985715, 14.603576],

    巴布亚新几内亚: [147.27892, -9.465948],

    波兰: [21.021333, 52.232842],

    波多黎各: [120.809359, 17.750942],

    北朝鲜: [125.760512, 39.041685],

    朝鲜: [125.760512, 39.041685],

    葡萄牙: [-9.161365, 38.768409],

    巴拉圭: [-57.576213, -25.260342],

    卡塔尔: [51.531551, 25.286355],

    罗马尼亚: [26.08734, 44.42869],

    俄罗斯: [37.621612, 55.758257],

    卢旺达: [30.102346, -1.969667],

    西撒哈拉: [-13.233061, 27.246935],

    沙特阿拉伯: [46.672152, 24.714184],

    南苏丹: [31.586576, 4.891962],

    苏丹: [32.560519, 15.501806],

    塞内加尔: [-17.367747, 14.764454],

    所罗门群岛: [159.981803, -9.43537],

    塞拉利昂: [-13.233425, 8.466744],

    萨尔瓦多: [-89.22758, 13.692121],

    索马里兰: [44.088511, 9.562318],

    索马里: [45.317204, 2.047013],

    塞尔维亚: [20.446144, 44.786894],

    苏里南共和国: [-55.206128, 5.853474],

    苏里南: [-55.206128, 5.853474],

    斯洛伐克共和国: [17.099623, 48.141697],

    斯洛伐克: [17.099623, 48.141697],

    瑞典: [18.058376, 59.327783],

    斯威士兰: [31.134648, -26.292261],

    叙利亚: [36.274228, 33.521994],

    乍得: [15.058995, 12.144253],

    多哥: [1.244889, 6.219695],

    泰国: [100.451117, 13.724061],

    塔吉克斯坦: [68.788383, 38.572383],

    土库曼斯坦: [58.338576, 38.057635],

    东帝汶: [125.564669, -8.549475],

    特立尼达和多巴哥: [-61.528354, 10.674498],

    突尼斯: [10.208651, 36.866028],

    土耳其: [32.853705, 39.941552],

    坦桑尼亚: [35.698823, -6.211186],

    乌干达: [32.581738, 0.352894],

    乌克兰: [30.512697, 50.452995],

    乌拉圭: [-56.163094, -34.893771],

    乌兹别克斯: [69.247259, 41.313586],

    乌兹别克斯坦: [69.247259, 41.313586],

    委内瑞拉: [-66.90346, 10.492688],

    越南: [105.699615, 20.973967],

    瓦努阿图: [168.327477, -17.730243],

    也门: [44.188624, 15.375985],

    南非共和国: [18.480216, -33.873348],

    南非: [18.480216, -33.873348],

    赞比亚: [28.321954, -15.376648],

    津巴布韦: [31.033189, -17.824573],

    布隆迪: [29.3598782, -3.361378],

    汤加: [-175.04, -21.08],

    "波斯尼亚-黑塞哥维那": [18.37875, 43.85002],

    波黑: [18.37875, 43.85002],

    亚美尼亚: [45.5875, 40.846923828125],

    新疆: [84.9023, 41.748],

    西藏: [88.7695, 31.6846],

    内蒙古: [117.5977, 44.3408],

    青海: [96.2402, 35.4199],

    四川: [102.9199, 30.1904],

    黑龙江: [128.1445, 48.5156],

    甘肃: [95.7129, 40.166],

    云南: [101.8652, 25.1807],

    广西: [108.2813, 23.6426],

    湖南: [111.5332, 27.3779],

    陕西: [109.5996, 35.6396],

    广东: [113.4668, 22.8076],

    吉林: [126.4746, 43.5938],

    河北: [115.4004, 37.9688],

    湖北: [112.2363, 31.1572],

    贵州: [106.6113, 26.9385],

    山东: [118.7402, 36.4307],

    江西: [116.0156, 27.29],

    河南: [113.4668, 33.8818],

    辽宁: [122.3438, 41.0889],

    山西: [112.4121, 37.6611],

    安徽: [117.2461, 32.0361],

    福建: [118.3008, 25.9277],

    浙江: [120.498, 29.0918],

    江苏: [120.0586, 32.915],

    重庆: [107.7539, 30.1904],

    宁夏: [105.9961, 37.3096],

    海南: [109.9512, 19.2041],

    台湾: [121.0254, 23.5986],

    北京: [116.4551, 40.2539],

    天津: [117.4219, 39.4189],

    上海: [121.4648, 31.2891],

    香港: [114.2578, 22.3242],

    澳门: [113.5547, 22.1484],

    法罗群岛: [-6.56, 62.05],

    亚速尔群岛: [-28, 38.3],

    马德拉群岛: [-16.3, 32.8],

    加那利群岛: [-15.67456, 28.58715],

    留尼旺: [55.536384, -20.904470443726],

    圣赫勒拿: [-5.7151749, -15.9286343],

    库克群岛: [-159.46, -21.12],

    关岛: [144.43, 13.26],

    法属波利尼西亚: [-141.95, -21.47],

    皮特凯恩群岛: [-130.06, -25.04],

    瓦利斯和富图纳: [-176.1, -13.18],

    纽埃: [-169.55, -19.03],

    托克劳群岛: [-171.51, -8.58],

    美属萨摩亚: [-170.568115234375, -14.266796875000011],

    萨摩亚: [-172.33349609375, -13.46523437499999],

    北马里亚纳群岛: [145.45, 15.12],

    英属维尔京群岛: [-64.37, 18.27],

    美属维尔京群岛: [-64.56, 18.21],

    安圭拉: [-63.168, 18.16],

    蒙特塞拉特: [-62.43, 16.42],

    瓜德罗普岛: [-61.44, 16.0],

    马提尼克岛: [-61.02, 14.36],

    荷属安的列斯: [-69.0, 12.05],

    阿鲁巴: [-70.02, 12.32],

    特克斯和凯科斯群岛: [-71.45, 21.3],

    开曼群岛: [-81.24, 19.2],
  },
];
var jsonGjZYData = [
  {
    Afghanistan: "阿富汗",
    "Aland Islands": "奥兰群岛",
    Albania: "阿尔巴尼亚",
    Algeria: "阿尔及利亚",
    "American Samoa": "美属萨摩亚",
    Andorra: "安道尔",
    Angola: "安哥拉",
    Anguilla: "安圭拉",
    "Antigua and Barbuda": "安提瓜和巴布达",
    Argentina: "阿根廷",
    Armenia: "亚美尼亚",
    Aruba: "阿鲁巴",
    Australia: "澳大利亚",
    Austria: "奥地利",
    Azerbaijan: "阿塞拜疆",
    Bangladesh: "孟加拉",
    Bahrain: "巴林",
    Bahamas: "巴哈马",
    Barbados: "巴巴多斯",
    Belarus: "白俄罗斯",
    Belgium: "比利时",
    Belize: "伯利兹",
    Benin: "贝宁",
    Bermuda: "百慕大",
    Bhutan: "不丹",
    Bolivia: "玻利维亚",
    "Bosnia and Herzegovina": "波斯尼亚和黑塞哥维那",
    Botswana: "博茨瓦纳",
    "Bouvet Island": "布维岛",
    Brazil: "巴西",
    Brunei: "文莱",
    Bulgaria: "保加利亚",
    "Burkina Faso": "布基纳法索",
    Burundi: "布隆迪",
    Cambodia: "柬埔寨",
    Cameroon: "喀麦隆",
    Canada: "加拿大",
    "Cape Verde": "佛得角",
    "Central African Republic": "中非",
    Chad: "乍得",
    Chile: "智利",
    "Christmas Islands": "圣诞岛",
    "Cocos (keeling) Islands": "科科斯（基林）群岛",
    Colombia: "哥伦比亚",
    Comoros: "科摩罗",
    "Congo (Congo-Kinshasa)": "刚果（金）",
    Congo: "刚果",
    "Cook Islands": "库克群岛",
    "Costa Rica": "哥斯达黎加",
    "Cote D’Ivoire": "科特迪瓦",
    China: "中国",
    Croatia: "克罗地亚",
    Cuba: "古巴",
    Czech: "捷克",
    Cyprus: "塞浦路斯",
    Denmark: "丹麦",
    Djibouti: "吉布提",
    Dominica: "多米尼加",
    "East Timor": "东帝汶",
    Ecuador: "厄瓜多尔",
    Egypt: "埃及",
    "Equatorial Guinea": "赤道几内亚",
    Eritrea: "厄立特里亚",
    Estonia: "爱沙尼亚",
    Ethiopia: "埃塞俄比亚",
    "Faroe Islands": "法罗群岛",
    Fiji: "斐济",
    Finland: "Finland",
    France: "法国",
    "Franch Metropolitan": "法国大都会",
    "Franch Guiana": "法属圭亚那",
    "French Polynesia": "法属波利尼西亚",
    Gabon: "加蓬",
    Gambia: "冈比亚",
    Georgia: "格鲁吉亚",
    Germany: "德国",
    Ghana: "加纳",
    Gibraltar: "直布罗陀",
    Greece: "希腊",
    Grenada: "格林纳达",
    Guadeloupe: "瓜德罗普岛",
    Guam: "关岛",
    Guatemala: "危地马拉",
    Guernsey: "根西岛",
    "Guinea-Bissau": "几内亚比绍",
    Guinea: "几内亚",
    Guyana: "圭亚那",
    "Hong Kong": "香港 （中国）",
    Haiti: "海地",
    Honduras: "洪都拉斯",
    Hungary: "匈牙利",
    Iceland: "冰岛",
    India: "印度",
    Indonesia: "印度尼西亚",
    Iran: "伊朗",
    Iraq: "伊拉克",
    Ireland: "爱尔兰",
    "Isle of Man": "马恩岛",
    Israel: "以色列",
    Italy: "意大利",
    Jamaica: "牙买加",
    Japan: "日本",
    Jersey: "泽西岛",
    Jordan: "约旦",
    Kazakhstan: "哈萨克斯坦",
    Kenya: "肯尼亚",
    Kiribati: "基里巴斯",
    "Korea (South)": "韩国",
    "Korea (North)": "朝鲜",
    Kuwait: "科威特",
    Kyrgyzstan: "吉尔吉斯斯坦",
    Laos: "老挝",
    Latvia: "拉脱维亚",
    Lebanon: "黎巴嫩",
    Lesotho: "莱索托",
    Liberia: "利比里亚",
    Libya: "利比亚",
    Liechtenstein: "列支敦士登",
    Lithuania: "立陶宛",
    Luxembourg: "卢森堡",
    Macau: "澳门（中国）",
    Macedonia: "马其顿",
    Malawi: "马拉维",
    Malaysia: "马来西亚",
    Madagascar: "马达加斯加",
    Maldives: "马尔代夫",
    Mali: "马里",
    Malta: "马耳他",
    "Marshall Islands": "马绍尔群岛",
    Martinique: "马提尼克岛",
    Mauritania: "毛里塔尼亚",
    Mauritius: "毛里求斯",
    Mayotte: "马约特",
    Mexico: "墨西哥",
    Micronesia: "密克罗尼西亚",
    Moldova: "摩尔多瓦",
    Monaco: "摩纳哥",
    Mongolia: "蒙古",
    Montenegro: "黑山",
    Montserrat: "蒙特塞拉特",
    Morocco: "摩洛哥",
    Mozambique: "莫桑比克",
    Myanmar: "缅甸",
    Namibia: "纳米比亚",
    Nauru: "瑙鲁",
    Nepal: "尼泊尔",
    Netherlands: "荷兰",
    "New Caledonia": "新喀里多尼亚",
    "New Zealand": "新西兰",
    Nicaragua: "尼加拉瓜",
    Niger: "尼日尔",
    Nigeria: "尼日利亚",
    Niue: "纽埃",
    "Norfolk Island": "诺福克岛",
    Norway: "挪威",
    Oman: "阿曼",
    Pakistan: "巴基斯坦",
    Palau: "帕劳",
    Palestine: "巴勒斯坦",
    Panama: "巴拿马",
    "Papua New Guinea": "巴布亚新几内亚",
    Paraguay: "巴拉圭",
    Peru: "秘鲁",
    Philippines: "菲律宾",
    "Pitcairn Islands": "皮特凯恩群岛",
    Poland: "波兰",
    Portugal: "葡萄牙",
    "Puerto Rico": "波多黎各",
    Qatar: "卡塔尔",
    Reunion: "留尼汪岛",
    Romania: "罗马尼亚",
    Rwanda: "卢旺达",
    "Russian Federation": "俄罗斯联邦",
    "Saint Helena": "圣赫勒拿",
    "Saint Kitts-Nevis": "圣基茨和尼维斯",
    "Saint Lucia": "圣卢西亚",
    "Saint Vincent and the Grenadines": "圣文森特和格林纳丁斯",
    "El Salvador": "萨尔瓦多",
    Samoa: "萨摩亚",
    "San Marino": "圣马力诺",
    "Sao Tome and Principe": "圣多美和普林西比",
    "Saudi Arabia": "沙特阿拉伯",
    Senegal: "塞内加尔",
    Seychelles: "塞舌尔",
    "Sierra Leone": "塞拉利昂",
    Singapore: "新加坡",
    Serbia: "塞尔维亚",
    Slovakia: "斯洛伐克",
    Slovenia: "斯洛文尼亚",
    "Solomon Islands": "所罗门群岛",
    Somalia: "索马里",
    "South Africa": "南非",
    Spain: "西班牙",
    "Sri Lanka": "斯里兰卡",
    Sudan: "苏丹",
    Suriname: "苏里南",
    Swaziland: "斯威士兰",
    Sweden: "瑞典",
    Switzerland: "瑞士",
    Syria: "叙利亚",
    Tajikistan: "塔吉克斯坦",
    Tanzania: "坦桑尼亚",
    Taiwan: "台湾 （中国）",
    Thailand: "泰国",
    "Trinidad and Tobago": "特立尼达和多巴哥",
    "Timor-Leste": "东帝汶",
    Togo: "多哥",
    Tokelau: "托克劳",
    Tonga: "汤加",
    Tunisia: "突尼斯",
    Turkey: "土耳其",
    Turkmenistan: "土库曼斯坦",
    Tuvalu: "图瓦卢",
    Uganda: "乌干达",
    Ukraine: "乌克兰",
    "United Arab Emirates": "阿拉伯联合酋长国",
    "United Kingdom": "英国",
    "United States": "美国",
    Uruguay: "乌拉圭",
    Uzbekistan: "乌兹别克斯坦",
    Vanuatu: "瓦努阿图",
    "Vatican City": "梵蒂冈",
    Venezuela: "委内瑞拉",
    Vietnam: "越南",
    "Wallis and Futuna": "瓦利斯群岛和富图纳群岛",
    "Western Sahara": "西撒哈拉",
    Yemen: "也门",
    Yugoslavia: "南斯拉夫",
    Zambia: "赞比亚",
    Zimbabwe: "津巴布韦",
  },
];
var jsonGjzyData2 = [
  {
    阿富汗: "Afghanistan",
    奥兰群岛: "Aland Islands",
    阿尔巴尼亚: "Albania",
    阿尔及利亚: "Algeria",
    美属萨摩亚: "American Samoa",
    安道尔: "Andorra",
    安哥拉: "Angola",
    安圭拉: "Anguilla",
    安提瓜和巴布达: "Antigua and Barbuda",
    阿根廷: "Argentina",
    亚美尼亚: "Armenia",
    阿鲁巴: "Aruba",
    澳大利亚: "Australia",
    奥地利: "Austria",
    阿塞拜疆: "Azerbaijan",
    孟加拉: "Bangladesh",
    巴林: "Bahrain",
    巴哈马: "Bahamas",
    巴巴多斯: "Barbados",
    白俄罗斯: "Belarus",
    比利时: "Belgium",
    伯利兹: "Belize",
    贝宁: "Benin",
    百慕大: "Bermuda",
    不丹: "Bhutan",
    玻利维亚: "Bolivia",
    波斯尼亚和黑塞哥维那: "Bosnia and Herzegovina",
    博茨瓦纳: "Botswana",
    布维岛: "Bouvet Island",
    巴西: "Brazil",
    文莱: "Brunei",
    保加利亚: "Bulgaria",
    布基纳法索: "Burkina Faso",
    布隆迪: "Burundi",
    柬埔寨: "Cambodia",
    喀麦隆: "Cameroon",
    加拿大: "Canada",
    佛得角: "Cape Verde",
    中非: "Central African Republic",
    乍得: "Chad",
    智利: "Chile",
    圣诞岛: "Christmas Islands",
    "科科斯（基林）群岛": "Cocos (keeling) Islands",
    哥伦比亚: "Colombia",
    科摩罗: "Comoros",
    "刚果（金）": "Congo (Congo-Kinshasa)",
    刚果: "Congo",
    库克群岛: "Cook Islands",
    哥斯达黎加: "Costa Rica",
    科特迪瓦: "Cote D’Ivoire",
    中国: "China",
    克罗地亚: "Croatia",
    古巴: "Cuba",
    捷克: "Czech",
    塞浦路斯: "Cyprus",
    丹麦: "Denmark",
    吉布提: "Djibouti",
    多米尼加: "Dominica",
    东帝汶: "Timor-Leste",
    厄瓜多尔: "Ecuador",
    埃及: "Egypt",
    赤道几内亚: "Equatorial Guinea",
    厄立特里亚: "Eritrea",
    爱沙尼亚: "Estonia",
    埃塞俄比亚: "Ethiopia",
    法罗群岛: "Faroe Islands",
    斐济: "Fiji",
    Finland: "Finland",
    法国: "France",
    法国大都会: "Franch Metropolitan",
    法属圭亚那: "Franch Guiana",
    法属波利尼西亚: "French Polynesia",
    加蓬: "Gabon",
    冈比亚: "Gambia",
    格鲁吉亚: "Georgia",
    德国: "Germany",
    加纳: "Ghana",
    直布罗陀: "Gibraltar",
    希腊: "Greece",
    格林纳达: "Grenada",
    瓜德罗普岛: "Guadeloupe",
    关岛: "Guam",
    危地马拉: "Guatemala",
    根西岛: "Guernsey",
    几内亚比绍: "Guinea-Bissau",
    几内亚: "Guinea",
    圭亚那: "Guyana",
    "香港 （中国）": "Hong Kong",
    海地: "Haiti",
    洪都拉斯: "Honduras",
    匈牙利: "Hungary",
    冰岛: "Iceland",
    印度: "India",
    印度尼西亚: "Indonesia",
    伊朗: "Iran",
    伊拉克: "Iraq",
    爱尔兰: "Ireland",
    马恩岛: "Isle of Man",
    以色列: "Israel",
    意大利: "Italy",
    牙买加: "Jamaica",
    日本: "Japan",
    泽西岛: "Jersey",
    约旦: "Jordan",
    哈萨克斯坦: "Kazakhstan",
    肯尼亚: "Kenya",
    基里巴斯: "Kiribati",
    韩国: "Korea (South)",
    朝鲜: "Korea (North)",
    科威特: "Kuwait",
    吉尔吉斯斯坦: "Kyrgyzstan",
    老挝: "Laos",
    拉脱维亚: "Latvia",
    黎巴嫩: "Lebanon",
    莱索托: "Lesotho",
    利比里亚: "Liberia",
    利比亚: "Libya",
    列支敦士登: "Liechtenstein",
    立陶宛: "Lithuania",
    卢森堡: "Luxembourg",
    "澳门（中国）": "Macau",
    马其顿: "Macedonia",
    马拉维: "Malawi",
    马来西亚: "Malaysia",
    马达加斯加: "Madagascar",
    马尔代夫: "Maldives",
    马里: "Mali",
    马耳他: "Malta",
    马绍尔群岛: "Marshall Islands",
    马提尼克岛: "Martinique",
    毛里塔尼亚: "Mauritania",
    毛里求斯: "Mauritius",
    马约特: "Mayotte",
    墨西哥: "Mexico",
    密克罗尼西亚: "Micronesia",
    摩尔多瓦: "Moldova",
    摩纳哥: "Monaco",
    蒙古: "Mongolia",
    黑山: "Montenegro",
    蒙特塞拉特: "Montserrat",
    摩洛哥: "Morocco",
    莫桑比克: "Mozambique",
    缅甸: "Myanmar",
    纳米比亚: "Namibia",
    瑙鲁: "Nauru",
    尼泊尔: "Nepal",
    荷兰: "Netherlands",
    新喀里多尼亚: "New Caledonia",
    新西兰: "New Zealand",
    尼加拉瓜: "Nicaragua",
    尼日尔: "Niger",
    尼日利亚: "Nigeria",
    纽埃: "Niue",
    诺福克岛: "Norfolk Island",
    挪威: "Norway",
    阿曼: "Oman",
    巴基斯坦: "Pakistan",
    帕劳: "Palau",
    巴勒斯坦: "Palestine",
    巴拿马: "Panama",
    巴布亚新几内亚: "Papua New Guinea",
    巴拉圭: "Paraguay",
    秘鲁: "Peru",
    菲律宾: "Philippines",
    皮特凯恩群岛: "Pitcairn Islands",
    波兰: "Poland",
    葡萄牙: "Portugal",
    波多黎各: "Puerto Rico",
    卡塔尔: "Qatar",
    留尼汪岛: "Reunion",
    罗马尼亚: "Romania",
    卢旺达: "Rwanda",
    俄罗斯联邦: "Russian Federation",
    圣赫勒拿: "Saint Helena",
    圣基茨和尼维斯: "Saint Kitts-Nevis",
    圣卢西亚: "Saint Lucia",
    圣文森特和格林纳丁斯: "Saint Vincent and the Grenadines",
    萨尔瓦多: "El Salvador",
    萨摩亚: "Samoa",
    圣马力诺: "San Marino",
    圣多美和普林西比: "Sao Tome and Principe",
    沙特阿拉伯: "Saudi Arabia",
    塞内加尔: "Senegal",
    塞舌尔: "Seychelles",
    塞拉利昂: "Sierra Leone",
    新加坡: "Singapore",
    塞尔维亚: "Serbia",
    斯洛伐克: "Slovakia",
    斯洛文尼亚: "Slovenia",
    所罗门群岛: "Solomon Islands",
    索马里: "Somalia",
    南非: "South Africa",
    西班牙: "Spain",
    斯里兰卡: "Sri Lanka",
    苏丹: "Sudan",
    苏里南: "Suriname",
    斯威士兰: "Swaziland",
    瑞典: "Sweden",
    瑞士: "Switzerland",
    叙利亚: "Syria",
    塔吉克斯坦: "Tajikistan",
    坦桑尼亚: "Tanzania",
    "台湾 （中国）": "Taiwan",
    泰国: "Thailand",
    特立尼达和多巴哥: "Trinidad and Tobago",
    多哥: "Togo",
    托克劳: "Tokelau",
    汤加: "Tonga",
    突尼斯: "Tunisia",
    土耳其: "Turkey",
    土库曼斯坦: "Turkmenistan",
    图瓦卢: "Tuvalu",
    乌干达: "Uganda",
    乌克兰: "Ukraine",
    阿拉伯联合酋长国: "United Arab Emirates",
    英国: "United Kingdom",
    美国: "United States",
    乌拉圭: "Uruguay",
    乌兹别克斯坦: "Uzbekistan",
    瓦努阿图: "Vanuatu",
    梵蒂冈: "Vatican City",
    委内瑞拉: "Venezuela",
    越南: "Vietnam",
    瓦利斯群岛和富图纳群岛: "Wallis and Futuna",
    西撒哈拉: "Western Sahara",
    也门: "Yemen",
    南斯拉夫: "Yugoslavia",
    赞比亚: "Zambia",
    津巴布韦: "Zimbabwe",
  },
];
var jsonData = [
  {
    阿富汗: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 453.4,
          },
          {
            year: "2017",
            value: 342.8,
          },
          {
            year: "2018",
            value: 2407.9,
          },
          {
            year: "2019",
            value: 2927.9265,
          },
          {
            year: "2020",
            value: 5451.23,
          },
          {
            year: "2021",
            value: 4953.0,
          },
          {
            year: "2022",
            value: 4202.0,
          },
          {
            year: "2023",
            value: 6391.0,
          },
          {
            year: "2024",
            value: 4217.239,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 43129.3,
          },
          {
            year: "2017",
            value: 54120.6,
          },
          {
            year: "2018",
            value: 66759.0,
          },
          {
            year: "2019",
            value: 59979.9484,
          },
          {
            year: "2020",
            value: 50068.0466,
          },
          {
            year: "2021",
            value: 47445.0,
          },
          {
            year: "2022",
            value: 55027.0,
          },
          {
            year: "2023",
            value: 126879.0,
          },
          {
            year: "2024",
            value: 154378.983,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 43582.7,
          },
          {
            year: "2017",
            value: 54463.4,
          },
          {
            year: "2018",
            value: 69166.9,
          },
          {
            year: "2019",
            value: 62907.8749,
          },
          {
            year: "2020",
            value: 55519.2766,
          },
          {
            year: "2021",
            value: 52398.0,
          },
          {
            year: "2022",
            value: 59229.0,
          },
          {
            year: "2023",
            value: 133270.0,
          },
          {
            year: "2024",
            value: 158596.222,
          },
        ],
      },
    },
    阿联酋: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 999436.3,
          },
          {
            year: "2017",
            value: 1231115.8,
          },
          {
            year: "2018",
            value: 1623776.7,
          },
          {
            year: "2019",
            value: 1533673.8558,
          },
          {
            year: "2020",
            value: 1705481.9809,
          },
          {
            year: "2021",
            value: 2857327.0,
          },
          {
            year: "2022",
            value: 4541667.0,
          },
          {
            year: "2023",
            value: 3931267.0,
          },
          {
            year: "2024",
            value: 3624491.1927,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3007252.6,
          },
          {
            year: "2017",
            value: 2872396.5,
          },
          {
            year: "2018",
            value: 2965124.8,
          },
          {
            year: "2019",
            value: 3341289.4763,
          },
          {
            year: "2020",
            value: 3231034.727,
          },
          {
            year: "2021",
            value: 4375166.0,
          },
          {
            year: "2022",
            value: 5341911.0,
          },
          {
            year: "2023",
            value: 5568201.0,
          },
          {
            year: "2024",
            value: 6559282.347,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4006688.9,
          },
          {
            year: "2017",
            value: 4103512.3,
          },
          {
            year: "2018",
            value: 4588901.5,
          },
          {
            year: "2019",
            value: 4874963.3321,
          },
          {
            year: "2020",
            value: 4936516.7079,
          },
          {
            year: "2021",
            value: 7232493.0,
          },
          {
            year: "2022",
            value: 9883578.0,
          },
          {
            year: "2023",
            value: 9499468.0,
          },
          {
            year: "2024",
            value: 10183773.5397,
          },
        ],
      },
    },
    阿曼: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1204102.4,
          },
          {
            year: "2017",
            value: 1338327.8,
          },
          {
            year: "2018",
            value: 1889851.1,
          },
          {
            year: "2019",
            value: 1965015.5145,
          },
          {
            year: "2020",
            value: 1565946.4292,
          },
          {
            year: "2021",
            value: 2859170.0,
          },
          {
            year: "2022",
            value: 3624179.0,
          },
          {
            year: "2023",
            value: 3128266.0,
          },
          {
            year: "2024",
            value: 3093488.8679,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 214809.0,
          },
          {
            year: "2017",
            value: 231645.3,
          },
          {
            year: "2018",
            value: 286461.1,
          },
          {
            year: "2019",
            value: 302094.4207,
          },
          {
            year: "2020",
            value: 307646.7706,
          },
          {
            year: "2021",
            value: 356515.0,
          },
          {
            year: "2022",
            value: 413999.0,
          },
          {
            year: "2023",
            value: 379802.0,
          },
          {
            year: "2024",
            value: 579706.8334,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1418911.4,
          },
          {
            year: "2017",
            value: 1569973.1,
          },
          {
            year: "2018",
            value: 2176312.2,
          },
          {
            year: "2019",
            value: 2267109.9352,
          },
          {
            year: "2020",
            value: 1873593.1998,
          },
          {
            year: "2021",
            value: 3215685.0,
          },
          {
            year: "2022",
            value: 4038178.0,
          },
          {
            year: "2023",
            value: 3508068.0,
          },
          {
            year: "2024",
            value: 3673195.7013,
          },
        ],
      },
    },
    阿塞拜疆: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 41208.2,
          },
          {
            year: "2017",
            value: 57745.4,
          },
          {
            year: "2018",
            value: 38201.8,
          },
          {
            year: "2019",
            value: 86923.2294,
          },
          {
            year: "2020",
            value: 69877.9881,
          },
          {
            year: "2021",
            value: 20503.0,
          },
          {
            year: "2022",
            value: 24587.0,
          },
          {
            year: "2023",
            value: 17107.3332,
          },
          {
            year: "2024",
            value: 6121.8173,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 34600.2,
          },
          {
            year: "2017",
            value: 38697.1,
          },
          {
            year: "2018",
            value: 51592.8,
          },
          {
            year: "2019",
            value: 61639.1737,
          },
          {
            year: "2020",
            value: 61787.0102,
          },
          {
            year: "2021",
            value: 99488.0,
          },
          {
            year: "2022",
            value: 113092.0,
          },
          {
            year: "2023",
            value: 155065.0,
          },
          {
            year: "2024",
            value: 240409.3198,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 75808.4,
          },
          {
            year: "2017",
            value: 96442.5,
          },
          {
            year: "2018",
            value: 89794.6,
          },
          {
            year: "2019",
            value: 148562.4031,
          },
          {
            year: "2020",
            value: 131664.9983,
          },
          {
            year: "2021",
            value: 119991.0,
          },
          {
            year: "2022",
            value: 137679.0,
          },
          {
            year: "2023",
            value: 172172.0,
          },
          {
            year: "2024",
            value: 246531.1371,
          },
        ],
      },
    },
    巴基斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 191259.3,
          },
          {
            year: "2017",
            value: 183321.9,
          },
          {
            year: "2018",
            value: 217208.6,
          },
          {
            year: "2019",
            value: 180612.5989,
          },
          {
            year: "2020",
            value: 212487.3682,
          },
          {
            year: "2021",
            value: 358448.0,
          },
          {
            year: "2022",
            value: 341602.0,
          },
          {
            year: "2023",
            value: 345099.0,
          },
          {
            year: "2024",
            value: 282232.2248,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1723446.4,
          },
          {
            year: "2017",
            value: 1825078.9,
          },
          {
            year: "2018",
            value: 1693331.7,
          },
          {
            year: "2019",
            value: 1616692.1086,
          },
          {
            year: "2020",
            value: 1535767.0905,
          },
          {
            year: "2021",
            value: 2424040.0,
          },
          {
            year: "2022",
            value: 2285078.0,
          },
          {
            year: "2023",
            value: 1729693.0,
          },
          {
            year: "2024",
            value: 2023365.562,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1914705.7,
          },
          {
            year: "2017",
            value: 2008400.8,
          },
          {
            year: "2018",
            value: 1910540.3,
          },
          {
            year: "2019",
            value: 1797304.7075,
          },
          {
            year: "2020",
            value: 1748254.4587,
          },
          {
            year: "2021",
            value: 2782488.0,
          },
          {
            year: "2022",
            value: 2626680.0,
          },
          {
            year: "2023",
            value: 2074792.0,
          },
          {
            year: "2024",
            value: 2305597.7868,
          },
        ],
      },
    },
    巴勒斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 30.9,
          },
          {
            year: "2017",
            value: 11.8,
          },
          {
            year: "2018",
            value: 44.4,
          },
          {
            year: "2019",
            value: 13.9926,
          },
          {
            year: "2020",
            value: 0.8637,
          },
          {
            year: "2021",
            value: 34.0,
          },
          {
            year: "2022",
            value: 2.0,
          },
          {
            year: "2023",
            value: 5.0903,
          },
          {
            year: "2024",
            value: 5.0753,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 5930.9,
          },
          {
            year: "2017",
            value: 6905.8,
          },
          {
            year: "2018",
            value: 7336.1,
          },
          {
            year: "2019",
            value: 8214.4356,
          },
          {
            year: "2020",
            value: 10045.5872,
          },
          {
            year: "2021",
            value: 12801.0,
          },
          {
            year: "2022",
            value: 15585.0,
          },
          {
            year: "2023",
            value: 16492.176,
          },
          {
            year: "2024",
            value: 15456.4851,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 5961.8,
          },
          {
            year: "2017",
            value: 6917.6,
          },
          {
            year: "2018",
            value: 7380.5,
          },
          {
            year: "2019",
            value: 8228.4282,
          },
          {
            year: "2020",
            value: 10046.4509,
          },
          {
            year: "2021",
            value: 12835.0,
          },
          {
            year: "2022",
            value: 15587.0,
          },
          {
            year: "2023",
            value: 16497.2663,
          },
          {
            year: "2024",
            value: 15461.5604,
          },
        ],
      },
    },
    巴林: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 6372.3,
          },
          {
            year: "2017",
            value: 12394.6,
          },
          {
            year: "2018",
            value: 15012.5,
          },
          {
            year: "2019",
            value: 19533.0151,
          },
          {
            year: "2020",
            value: 14630.902,
          },
          {
            year: "2021",
            value: 39969.0,
          },
          {
            year: "2022",
            value: 25125.0,
          },
          {
            year: "2023",
            value: 19149.0,
          },
          {
            year: "2024",
            value: 12687.9812,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 79079.8,
          },
          {
            year: "2017",
            value: 90251.9,
          },
          {
            year: "2018",
            value: 113552.2,
          },
          {
            year: "2019",
            value: 148414.6634,
          },
          {
            year: "2020",
            value: 112025.6313,
          },
          {
            year: "2021",
            value: 138083.0,
          },
          {
            year: "2022",
            value: 175220.0,
          },
          {
            year: "2023",
            value: 154630.0,
          },
          {
            year: "2024",
            value: 134855.1667,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 85452.1,
          },
          {
            year: "2017",
            value: 102646.5,
          },
          {
            year: "2018",
            value: 128564.7,
          },
          {
            year: "2019",
            value: 167947.6785,
          },
          {
            year: "2020",
            value: 126656.5333,
          },
          {
            year: "2021",
            value: 178052.0,
          },
          {
            year: "2022",
            value: 200345.0,
          },
          {
            year: "2023",
            value: 173780.0,
          },
          {
            year: "2024",
            value: 147543.1479,
          },
        ],
      },
    },
    东帝汶: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 16431.6,
          },
          {
            year: "2017",
            value: 13259.7,
          },
          {
            year: "2018",
            value: 13239.0,
          },
          {
            year: "2019",
            value: 14294.8758,
          },
          {
            year: "2020",
            value: 19127.526,
          },
          {
            year: "2021",
            value: 26043.0,
          },
          {
            year: "2022",
            value: 27998.0,
          },
          {
            year: "2023",
            value: 26177.0,
          },
          {
            year: "2024",
            value: 26555.4492,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 16460.8,
          },
          {
            year: "2017",
            value: 13417.0,
          },
          {
            year: "2018",
            value: 13540.4,
          },
          {
            year: "2019",
            value: 16751.3087,
          },
          {
            year: "2020",
            value: 19248.5875,
          },
          {
            year: "2021",
            value: 37358.0,
          },
          {
            year: "2022",
            value: 42534.0,
          },
          {
            year: "2023",
            value: 33646.0,
          },
          {
            year: "2024",
            value: 26643.5747,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 29.2,
          },
          {
            year: "2017",
            value: 157.3,
          },
          {
            year: "2018",
            value: 301.4,
          },
          {
            year: "2019",
            value: 2456.4329,
          },
          {
            year: "2020",
            value: 121.0615,
          },
          {
            year: "2021",
            value: 11315.0,
          },
          {
            year: "2022",
            value: 14536.0,
          },
          {
            year: "2023",
            value: 7469.0,
          },
          {
            year: "2024",
            value: 88.1255,
          },
        ],
      },
    },
    菲律宾: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1739589.1,
          },
          {
            year: "2017",
            value: 1923917.7,
          },
          {
            year: "2018",
            value: 2061160.0,
          },
          {
            year: "2019",
            value: 2019939.3176,
          },
          {
            year: "2020",
            value: 1933547.0519,
          },
          {
            year: "2021",
            value: 2476131.0,
          },
          {
            year: "2022",
            value: 2301822.0,
          },
          {
            year: "2023",
            value: 1947728.0,
          },
          {
            year: "2024",
            value: 1932380.8086,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 2984266.6,
          },
          {
            year: "2017",
            value: 3206593.2,
          },
          {
            year: "2018",
            value: 3503664.2,
          },
          {
            year: "2019",
            value: 4076385.1931,
          },
          {
            year: "2020",
            value: 4188170.9679,
          },
          {
            year: "2021",
            value: 5728534.0,
          },
          {
            year: "2022",
            value: 6347102.0,
          },
          {
            year: "2023",
            value: 5239638.0,
          },
          {
            year: "2024",
            value: 5227701.6294,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4723855.7,
          },
          {
            year: "2017",
            value: 5130510.9,
          },
          {
            year: "2018",
            value: 5564824.2,
          },
          {
            year: "2019",
            value: 6096324.5107,
          },
          {
            year: "2020",
            value: 6121718.0198,
          },
          {
            year: "2021",
            value: 8204665.0,
          },
          {
            year: "2022",
            value: 8648924.0,
          },
          {
            year: "2023",
            value: 7187366.0,
          },
          {
            year: "2024",
            value: 7160082.438,
          },
        ],
      },
    },
    格鲁吉亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 5356.4,
          },
          {
            year: "2017",
            value: 6759.1,
          },
          {
            year: "2018",
            value: 5388.7,
          },
          {
            year: "2019",
            value: 8104.5263,
          },
          {
            year: "2020",
            value: 10086.5861,
          },
          {
            year: "2021",
            value: 17977.0,
          },
          {
            year: "2022",
            value: 14890.0,
          },
          {
            year: "2023",
            value: 11412.0,
          },
          {
            year: "2024",
            value: 27594.9337,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 74543.7,
          },
          {
            year: "2017",
            value: 91261.9,
          },
          {
            year: "2018",
            value: 109554.0,
          },
          {
            year: "2019",
            value: 140174.8362,
          },
          {
            year: "2020",
            value: 127568.9684,
          },
          {
            year: "2021",
            value: 102887.0,
          },
          {
            year: "2022",
            value: 123904.0,
          },
          {
            year: "2023",
            value: 193373.0,
          },
          {
            year: "2024",
            value: 198030.4465,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 79900.1,
          },
          {
            year: "2017",
            value: 98021.0,
          },
          {
            year: "2018",
            value: 114942.7,
          },
          {
            year: "2019",
            value: 148279.3625,
          },
          {
            year: "2020",
            value: 137655.5545,
          },
          {
            year: "2021",
            value: 120864.0,
          },
          {
            year: "2022",
            value: 138793.0,
          },
          {
            year: "2023",
            value: 204785.0,
          },
          {
            year: "2024",
            value: 225625.3802,
          },
        ],
      },
    },
    萨摩亚: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 6958.8,
          },
          {
            year: "2017",
            value: 6388.1,
          },
          {
            year: "2018",
            value: 7060.9,
          },
          {
            year: "2019",
            value: 8784.676,
          },
          {
            year: "2020",
            value: 8730.6465,
          },
          {
            year: "2021",
            value: 10229.0,
          },
          {
            year: "2022",
            value: 12122.0,
          },
          {
            year: "2023",
            value: 11949.0,
          },
          {
            year: "2024",
            value: 11153.8902,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 7038.7,
          },
          {
            year: "2017",
            value: 6440.8,
          },
          {
            year: "2018",
            value: 7111.9,
          },
          {
            year: "2019",
            value: 8828.9756,
          },
          {
            year: "2020",
            value: 8788.1849,
          },
          {
            year: "2021",
            value: 10293.0,
          },
          {
            year: "2022",
            value: 12216.0,
          },
          {
            year: "2023",
            value: 12090.0,
          },
          {
            year: "2024",
            value: 11256.916,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 79.9,
          },
          {
            year: "2017",
            value: 52.7,
          },
          {
            year: "2018",
            value: 51.0,
          },
          {
            year: "2019",
            value: 44.2996,
          },
          {
            year: "2020",
            value: 57.5384,
          },
          {
            year: "2021",
            value: 64.0,
          },
          {
            year: "2022",
            value: 95.0,
          },
          {
            year: "2023",
            value: 140.9672,
          },
          {
            year: "2024",
            value: 103.0258,
          },
        ],
      },
    },
    所罗门群岛: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 37627.3,
          },
          {
            year: "2017",
            value: 55481.9,
          },
          {
            year: "2018",
            value: 62931.6,
          },
          {
            year: "2019",
            value: 46111.8896,
          },
          {
            year: "2020",
            value: 35524.0301,
          },
          {
            year: "2021",
            value: 32064.0,
          },
          {
            year: "2022",
            value: 30153.0,
          },
          {
            year: "2023",
            value: 30394.0,
          },
          {
            year: "2024",
            value: 39134.4229,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 8655.6,
          },
          {
            year: "2017",
            value: 9258.2,
          },
          {
            year: "2018",
            value: 11824.1,
          },
          {
            year: "2019",
            value: 9825.669,
          },
          {
            year: "2020",
            value: 11660.1727,
          },
          {
            year: "2021",
            value: 16711.0,
          },
          {
            year: "2022",
            value: 19238.0,
          },
          {
            year: "2023",
            value: 23053.7851,
          },
          {
            year: "2024",
            value: 20841.2128,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 46282.9,
          },
          {
            year: "2017",
            value: 64740.1,
          },
          {
            year: "2018",
            value: 74755.7,
          },
          {
            year: "2019",
            value: 55937.5586,
          },
          {
            year: "2020",
            value: 47184.2028,
          },
          {
            year: "2021",
            value: 48775.0,
          },
          {
            year: "2022",
            value: 49391.0,
          },
          {
            year: "2023",
            value: 53447.0,
          },
          {
            year: "2024",
            value: 59975.6357,
          },
        ],
      },
    },
    汤加: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3032.7,
          },
          {
            year: "2017",
            value: 2794.2,
          },
          {
            year: "2018",
            value: 2494.7,
          },
          {
            year: "2019",
            value: 2944.2677,
          },
          {
            year: "2020",
            value: 3371.8773,
          },
          {
            year: "2021",
            value: 5365.0,
          },
          {
            year: "2022",
            value: 5536.0,
          },
          {
            year: "2023",
            value: 5758.7155,
          },
          {
            year: "2024",
            value: 6982.2445,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 3035.1,
          },
          {
            year: "2017",
            value: 2852.6,
          },
          {
            year: "2018",
            value: 2506.6,
          },
          {
            year: "2019",
            value: 2957.2815,
          },
          {
            year: "2020",
            value: 3395.6344,
          },
          {
            year: "2021",
            value: 5369.0,
          },
          {
            year: "2022",
            value: 5537.0,
          },
          {
            year: "2023",
            value: 5758.9618,
          },
          {
            year: "2024",
            value: 6989.6379,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2.4,
          },
          {
            year: "2017",
            value: 58.4,
          },
          {
            year: "2018",
            value: 11.9,
          },
          {
            year: "2019",
            value: 13.0138,
          },
          {
            year: "2020",
            value: 23.7571,
          },
          {
            year: "2021",
            value: 4.0,
          },
          {
            year: "2022",
            value: 0.2,
          },
          {
            year: "2023",
            value: 0.2463,
          },
          {
            year: "2024",
            value: 7.3934,
          },
        ],
      },
    },
    瓦努阿图: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 501.2,
          },
          {
            year: "2017",
            value: 1423.9,
          },
          {
            year: "2018",
            value: 1568.3,
          },
          {
            year: "2019",
            value: 1457.4368,
          },
          {
            year: "2020",
            value: 793.7074,
          },
          {
            year: "2021",
            value: 1183.0,
          },
          {
            year: "2022",
            value: 1082.0,
          },
          {
            year: "2023",
            value: 1392.0,
          },
          {
            year: "2024",
            value: 1928.9609,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 6373.9,
          },
          {
            year: "2017",
            value: 6558.5,
          },
          {
            year: "2018",
            value: 6341.8,
          },
          {
            year: "2019",
            value: 7725.2088,
          },
          {
            year: "2020",
            value: 7241.1508,
          },
          {
            year: "2021",
            value: 8764.0,
          },
          {
            year: "2022",
            value: 9486.0,
          },
          {
            year: "2023",
            value: 12416.9872,
          },
          {
            year: "2024",
            value: 18686.9766,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 6875.1,
          },
          {
            year: "2017",
            value: 7982.4,
          },
          {
            year: "2018",
            value: 7910.1,
          },
          {
            year: "2019",
            value: 9182.6456,
          },
          {
            year: "2020",
            value: 8034.8582,
          },
          {
            year: "2021",
            value: 9947.0,
          },
          {
            year: "2022",
            value: 10567.0,
          },
          {
            year: "2023",
            value: 13809.0,
          },
          {
            year: "2024",
            value: 20615.9375,
          },
        ],
      },
    },
    新西兰: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 714062.9,
          },
          {
            year: "2017",
            value: 939109.8,
          },
          {
            year: "2018",
            value: 1108333.2,
          },
          {
            year: "2019",
            value: 1255798.1111,
          },
          {
            year: "2020",
            value: 1207611.9113,
          },
          {
            year: "2021",
            value: 1615598.0,
          },
          {
            year: "2022",
            value: 1596911.0,
          },
          {
            year: "2023",
            value: 1348092.0,
          },
          {
            year: "2024",
            value: 1241627.9439,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 476828.3,
          },
          {
            year: "2017",
            value: 510010.3,
          },
          {
            year: "2018",
            value: 577469.6,
          },
          {
            year: "2019",
            value: 573630.4819,
          },
          {
            year: "2020",
            value: 605303.075,
          },
          {
            year: "2021",
            value: 856063.0,
          },
          {
            year: "2022",
            value: 910934.0,
          },
          {
            year: "2023",
            value: 787523.0,
          },
          {
            year: "2024",
            value: 773581.3474,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1190891.2,
          },
          {
            year: "2017",
            value: 1449120.1,
          },
          {
            year: "2018",
            value: 1685802.8,
          },
          {
            year: "2019",
            value: 1829428.593,
          },
          {
            year: "2020",
            value: 1812914.9863,
          },
          {
            year: "2021",
            value: 2471661.0,
          },
          {
            year: "2022",
            value: 2507845.0,
          },
          {
            year: "2023",
            value: 2135615.0,
          },
          {
            year: "2024",
            value: 2015209.2913,
          },
        ],
      },
    },
    哈萨克斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 480507.9,
          },
          {
            year: "2017",
            value: 637869.1,
          },
          {
            year: "2018",
            value: 852660.9,
          },
          {
            year: "2019",
            value: 927366.9859,
          },
          {
            year: "2020",
            value: 980510.065,
          },
          {
            year: "2021",
            value: 1129056.0,
          },
          {
            year: "2022",
            value: 1484088.0,
          },
          {
            year: "2023",
            value: 1634720.0,
          },
          {
            year: "2024",
            value: 1585557.6571,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 829258.9,
          },
          {
            year: "2017",
            value: 1156444.3,
          },
          {
            year: "2018",
            value: 1135152.8,
          },
          {
            year: "2019",
            value: 1272910.0679,
          },
          {
            year: "2020",
            value: 1170313.413,
          },
          {
            year: "2021",
            value: 1395926.0,
          },
          {
            year: "2022",
            value: 1624940.0,
          },
          {
            year: "2023",
            value: 2469589.0,
          },
          {
            year: "2024",
            value: 2796408.0463,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1309766.8,
          },
          {
            year: "2017",
            value: 1794313.4,
          },
          {
            year: "2018",
            value: 1987813.7,
          },
          {
            year: "2019",
            value: 2200277.0538,
          },
          {
            year: "2020",
            value: 2150823.478,
          },
          {
            year: "2021",
            value: 2524982.0,
          },
          {
            year: "2022",
            value: 3109028.0,
          },
          {
            year: "2023",
            value: 4104309.0,
          },
          {
            year: "2024",
            value: 4381965.7034,
          },
        ],
      },
    },
    韩国: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 15897453.1,
          },
          {
            year: "2017",
            value: 17755315.4,
          },
          {
            year: "2018",
            value: 20464340.1,
          },
          {
            year: "2019",
            value: 17355902.5773,
          },
          {
            year: "2020",
            value: 17310391.1776,
          },
          {
            year: "2021",
            value: 21344326.0,
          },
          {
            year: "2022",
            value: 19901610.0,
          },
          {
            year: "2023",
            value: 16171494.0,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 9372895.4,
          },
          {
            year: "2017",
            value: 10270377.7,
          },
          {
            year: "2018",
            value: 10875614.4,
          },
          {
            year: "2019",
            value: 11097441.0436,
          },
          {
            year: "2020",
            value: 11247683.0122,
          },
          {
            year: "2021",
            value: 14880548.0,
          },
          {
            year: "2022",
            value: 16097500.0,
          },
          {
            year: "2023",
            value: 14897594.0,
          },
          {
            year: "2024",
            value: 14636563.7318,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 25270348.5,
          },
          {
            year: "2017",
            value: 28025693.1,
          },
          {
            year: "2018",
            value: 31339954.5,
          },
          {
            year: "2019",
            value: 28453343.6209,
          },
          {
            year: "2020",
            value: 28558074.1898,
          },
          {
            year: "2021",
            value: 35910000.0,
          },
          {
            year: "2022",
            value: 35999110.0,
          },
          {
            year: "2023",
            value: 31069089.0,
          },
          {
            year: "2024",
            value: 32808264.1165,
          },
        ],
      },
    },
    吉尔吉斯斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 7123.5,
          },
          {
            year: "2017",
            value: 8705.5,
          },
          {
            year: "2018",
            value: 5432.7,
          },
          {
            year: "2019",
            value: 6604.1403,
          },
          {
            year: "2020",
            value: 3480.1089,
          },
          {
            year: "2021",
            value: 7974.0,
          },
          {
            year: "2022",
            value: 8166.0,
          },
          {
            year: "2023",
            value: 8321.0,
          },
          {
            year: "2024",
            value: 280437.1895,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 560545.5,
          },
          {
            year: "2017",
            value: 533680.8,
          },
          {
            year: "2018",
            value: 555679.3,
          },
          {
            year: "2019",
            value: 628051.9944,
          },
          {
            year: "2020",
            value: 286536.5575,
          },
          {
            year: "2021",
            value: 747400.0,
          },
          {
            year: "2022",
            value: 1534202.0,
          },
          {
            year: "2023",
            value: 1972041.0,
          },
          {
            year: "2024",
            value: 1990621.016,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 567669.0,
          },
          {
            year: "2017",
            value: 542386.3,
          },
          {
            year: "2018",
            value: 561112.0,
          },
          {
            year: "2019",
            value: 634656.1347,
          },
          {
            year: "2020",
            value: 290016.6664,
          },
          {
            year: "2021",
            value: 755374.0,
          },
          {
            year: "2022",
            value: 1542368.0,
          },
          {
            year: "2023",
            value: 1980362.0,
          },
          {
            year: "2024",
            value: 2271058.2055,
          },
        ],
      },
    },
    柬埔寨: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 83051.3,
          },
          {
            year: "2017",
            value: 100758.2,
          },
          {
            year: "2018",
            value: 137665.5,
          },
          {
            year: "2019",
            value: 144432.3229,
          },
          {
            year: "2020",
            value: 149748.6585,
          },
          {
            year: "2021",
            value: 210043.0,
          },
          {
            year: "2022",
            value: 183820.0,
          },
          {
            year: "2023",
            value: 207030.0,
          },
          {
            year: "2024",
            value: 249821.4503,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 393015.5,
          },
          {
            year: "2017",
            value: 478319.8,
          },
          {
            year: "2018",
            value: 600752.3,
          },
          {
            year: "2019",
            value: 798153.0879,
          },
          {
            year: "2020",
            value: 805448.9807,
          },
          {
            year: "2021",
            value: 1156509.0,
          },
          {
            year: "2022",
            value: 1393798.0,
          },
          {
            year: "2023",
            value: 1275200.0,
          },
          {
            year: "2024",
            value: 1533615.8788,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 476066.8,
          },
          {
            year: "2017",
            value: 579078.0,
          },
          {
            year: "2018",
            value: 738417.8,
          },
          {
            year: "2019",
            value: 942585.4108,
          },
          {
            year: "2020",
            value: 955197.6392,
          },
          {
            year: "2021",
            value: 1366552.0,
          },
          {
            year: "2022",
            value: 1577619.0,
          },
          {
            year: "2023",
            value: 1482230.0,
          },
          {
            year: "2024",
            value: 1783437.3291,
          },
        ],
      },
    },
    卡塔尔: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 401237.4,
          },
          {
            year: "2017",
            value: 640027.4,
          },
          {
            year: "2018",
            value: 914639.0,
          },
          {
            year: "2019",
            value: 871310.7686,
          },
          {
            year: "2020",
            value: 830509.6427,
          },
          {
            year: "2021",
            value: 1321100.0,
          },
          {
            year: "2022",
            value: 2258574.0,
          },
          {
            year: "2023",
            value: 2092833.0,
          },
          {
            year: "2024",
            value: 2004610.8669,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 151636.5,
          },
          {
            year: "2017",
            value: 168233.0,
          },
          {
            year: "2018",
            value: 248241.4,
          },
          {
            year: "2019",
            value: 240967.8189,
          },
          {
            year: "2020",
            value: 263116.5843,
          },
          {
            year: "2021",
            value: 396068.0,
          },
          {
            year: "2022",
            value: 393414.0,
          },
          {
            year: "2023",
            value: 363599.0,
          },
          {
            year: "2024",
            value: 417358.6697,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 552873.9,
          },
          {
            year: "2017",
            value: 808260.4,
          },
          {
            year: "2018",
            value: 1162880.4,
          },
          {
            year: "2019",
            value: 1112278.5875,
          },
          {
            year: "2020",
            value: 1093626.227,
          },
          {
            year: "2021",
            value: 1717168.0,
          },
          {
            year: "2022",
            value: 2651988.0,
          },
          {
            year: "2023",
            value: 2456432.0,
          },
          {
            year: "2024",
            value: 2421969.5366,
          },
        ],
      },
    },
    科威特: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 637028.4,
          },
          {
            year: "2017",
            value: 893495.0,
          },
          {
            year: "2018",
            value: 1534386.6,
          },
          {
            year: "2019",
            value: 1344747.4953,
          },
          {
            year: "2020",
            value: 1073510.1636,
          },
          {
            year: "2021",
            value: 1775554.0,
          },
          {
            year: "2022",
            value: 2649899.0,
          },
          {
            year: "2023",
            value: 1716455.0,
          },
          {
            year: "2024",
            value: 1146545.2291,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 300178.5,
          },
          {
            year: "2017",
            value: 311277.4,
          },
          {
            year: "2018",
            value: 331264.8,
          },
          {
            year: "2019",
            value: 383631.9571,
          },
          {
            year: "2020",
            value: 354783.0947,
          },
          {
            year: "2021",
            value: 436847.0,
          },
          {
            year: "2022",
            value: 491129.0,
          },
          {
            year: "2023",
            value: 522423.0,
          },
          {
            year: "2024",
            value: 482867.4264,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 937206.9,
          },
          {
            year: "2017",
            value: 1204772.4,
          },
          {
            year: "2018",
            value: 1865651.4,
          },
          {
            year: "2019",
            value: 1728379.4524,
          },
          {
            year: "2020",
            value: 1428293.2583,
          },
          {
            year: "2021",
            value: 2212401.0,
          },
          {
            year: "2022",
            value: 3141028.0,
          },
          {
            year: "2023",
            value: 2238878.0,
          },
          {
            year: "2024",
            value: 1629412.6555,
          },
        ],
      },
    },
    老挝: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 135960.8,
          },
          {
            year: "2017",
            value: 160499.7,
          },
          {
            year: "2018",
            value: 201815.3,
          },
          {
            year: "2019",
            value: 215700.039,
          },
          {
            year: "2020",
            value: 208828.934,
          },
          {
            year: "2021",
            value: 267570.0,
          },
          {
            year: "2022",
            value: 335127.0,
          },
          {
            year: "2023",
            value: 375394.0,
          },
          {
            year: "2024",
            value: 455562.6337,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 98709.8,
          },
          {
            year: "2017",
            value: 141935.1,
          },
          {
            year: "2018",
            value: 145399.5,
          },
          {
            year: "2019",
            value: 176245.3821,
          },
          {
            year: "2020",
            value: 149127.7597,
          },
          {
            year: "2021",
            value: 166677.0,
          },
          {
            year: "2022",
            value: 226671.0,
          },
          {
            year: "2023",
            value: 334830.0,
          },
          {
            year: "2024",
            value: 367577.7082,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 234670.6,
          },
          {
            year: "2017",
            value: 302434.8,
          },
          {
            year: "2018",
            value: 347214.8,
          },
          {
            year: "2019",
            value: 391945.4211,
          },
          {
            year: "2020",
            value: 357956.6937,
          },
          {
            year: "2021",
            value: 434247.0,
          },
          {
            year: "2022",
            value: 561798.0,
          },
          {
            year: "2023",
            value: 710223.0,
          },
          {
            year: "2024",
            value: 823140.3419,
          },
        ],
      },
    },
    黎巴嫩: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1767.3,
          },
          {
            year: "2017",
            value: 2304.0,
          },
          {
            year: "2018",
            value: 4898.4,
          },
          {
            year: "2019",
            value: 2600.7161,
          },
          {
            year: "2020",
            value: 3179.8465,
          },
          {
            year: "2021",
            value: 4793.0,
          },
          {
            year: "2022",
            value: 6404.0,
          },
          {
            year: "2023",
            value: 6415.0,
          },
          {
            year: "2024",
            value: 9266.4635,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 210071.4,
          },
          {
            year: "2017",
            value: 201061.1,
          },
          {
            year: "2018",
            value: 196928.4,
          },
          {
            year: "2019",
            value: 167959.9486,
          },
          {
            year: "2020",
            value: 94562.4534,
          },
          {
            year: "2021",
            value: 150869.0,
          },
          {
            year: "2022",
            value: 246163.0,
          },
          {
            year: "2023",
            value: 237131.0,
          },
          {
            year: "2024",
            value: 211142.6396,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 211838.7,
          },
          {
            year: "2017",
            value: 203365.1,
          },
          {
            year: "2018",
            value: 201826.8,
          },
          {
            year: "2019",
            value: 170560.6647,
          },
          {
            year: "2020",
            value: 97742.2999,
          },
          {
            year: "2021",
            value: 155662.0,
          },
          {
            year: "2022",
            value: 252567.0,
          },
          {
            year: "2023",
            value: 243546.0,
          },
          {
            year: "2024",
            value: 220409.1031,
          },
        ],
      },
    },
    马尔代夫: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 23.8,
          },
          {
            year: "2017",
            value: 62.1,
          },
          {
            year: "2018",
            value: 103.3,
          },
          {
            year: "2019",
            value: 3371.8734,
          },
          {
            year: "2020",
            value: 577.109,
          },
          {
            year: "2021",
            value: 436.0,
          },
          {
            year: "2022",
            value: 6.0,
          },
          {
            year: "2023",
            value: 3.4543,
          },
          {
            year: "2024",
            value: 3.0434,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 32094.0,
          },
          {
            year: "2017",
            value: 29562.6,
          },
          {
            year: "2018",
            value: 39617.3,
          },
          {
            year: "2019",
            value: 34798.5885,
          },
          {
            year: "2020",
            value: 27569.9683,
          },
          {
            year: "2021",
            value: 40689.0,
          },
          {
            year: "2022",
            value: 44069.0,
          },
          {
            year: "2023",
            value: 75709.0,
          },
          {
            year: "2024",
            value: 61963.2659,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 32117.8,
          },
          {
            year: "2017",
            value: 29624.7,
          },
          {
            year: "2018",
            value: 39720.6,
          },
          {
            year: "2019",
            value: 38170.4619,
          },
          {
            year: "2020",
            value: 28147.0773,
          },
          {
            year: "2021",
            value: 41125.0,
          },
          {
            year: "2022",
            value: 44074.0,
          },
          {
            year: "2023",
            value: 75712.0,
          },
          {
            year: "2024",
            value: 61966.3093,
          },
        ],
      },
    },
    马来西亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4926963.7,
          },
          {
            year: "2017",
            value: 5442613.9,
          },
          {
            year: "2018",
            value: 6320504.6,
          },
          {
            year: "2019",
            value: 7190997.5137,
          },
          {
            year: "2020",
            value: 7517442.1604,
          },
          {
            year: "2021",
            value: 9830508.0,
          },
          {
            year: "2022",
            value: 10983860.0,
          },
          {
            year: "2023",
            value: 10292983.0,
          },
          {
            year: "2024",
            value: 11056844.5069,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3767177.5,
          },
          {
            year: "2017",
            value: 4171227.7,
          },
          {
            year: "2018",
            value: 4537598.7,
          },
          {
            year: "2019",
            value: 5214178.1876,
          },
          {
            year: "2020",
            value: 5630131.4831,
          },
          {
            year: "2021",
            value: 7865488.0,
          },
          {
            year: "2022",
            value: 9171921.0,
          },
          {
            year: "2023",
            value: 8736913.0,
          },
          {
            year: "2024",
            value: 10146331.8941,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 8694141.2,
          },
          {
            year: "2017",
            value: 9613841.6,
          },
          {
            year: "2018",
            value: 10858103.3,
          },
          {
            year: "2019",
            value: 12405175.7013,
          },
          {
            year: "2020",
            value: 13147573.6435,
          },
          {
            year: "2021",
            value: 17695996.0,
          },
          {
            year: "2022",
            value: 20155781.0,
          },
          {
            year: "2023",
            value: 19029895.0,
          },
          {
            year: "2024",
            value: 21203176.401,
          },
        ],
      },
    },
    蒙古: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 362260.1,
          },
          {
            year: "2017",
            value: 516731.3,
          },
          {
            year: "2018",
            value: 634411.2,
          },
          {
            year: "2019",
            value: 633435.7304,
          },
          {
            year: "2020",
            value: 512456.2278,
          },
          {
            year: "2021",
            value: 689896.0,
          },
          {
            year: "2022",
            value: 933218.0,
          },
          {
            year: "2023",
            value: 1312393.0,
          },
          {
            year: "2024",
            value: 1373878.669,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 98863.7,
          },
          {
            year: "2017",
            value: 123561.2,
          },
          {
            year: "2018",
            value: 164488.9,
          },
          {
            year: "2019",
            value: 182658.9978,
          },
          {
            year: "2020",
            value: 161807.2894,
          },
          {
            year: "2021",
            value: 223306.0,
          },
          {
            year: "2022",
            value: 286622.0,
          },
          {
            year: "2023",
            value: 346989.0,
          },
          {
            year: "2024",
            value: 452483.5039,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 461123.8,
          },
          {
            year: "2017",
            value: 640292.5,
          },
          {
            year: "2018",
            value: 798900.1,
          },
          {
            year: "2019",
            value: 816094.7282,
          },
          {
            year: "2020",
            value: 674263.5172,
          },
          {
            year: "2021",
            value: 913202.0,
          },
          {
            year: "2022",
            value: 1219839.0,
          },
          {
            year: "2023",
            value: 1659382.0,
          },
          {
            year: "2024",
            value: 1826362.1729,
          },
        ],
      },
    },
    孟加拉国: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 86939.8,
          },
          {
            year: "2017",
            value: 87514.5,
          },
          {
            year: "2018",
            value: 98442.3,
          },
          {
            year: "2019",
            value: 103653.3766,
          },
          {
            year: "2020",
            value: 79975.463,
          },
          {
            year: "2021",
            value: 104693.0,
          },
          {
            year: "2022",
            value: 98173.0,
          },
          {
            year: "2023",
            value: 102597.7332,
          },
          {
            year: "2024",
            value: 116658.5962,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1430222.8,
          },
          {
            year: "2017",
            value: 1516902.1,
          },
          {
            year: "2018",
            value: 1775305.9,
          },
          {
            year: "2019",
            value: 1732328.6473,
          },
          {
            year: "2020",
            value: 1507569.6909,
          },
          {
            year: "2021",
            value: 2409441.0,
          },
          {
            year: "2022",
            value: 2661646.0,
          },
          {
            year: "2023",
            value: 2295248.0,
          },
          {
            year: "2024",
            value: 2288402.9843,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1517162.6,
          },
          {
            year: "2017",
            value: 1604416.6,
          },
          {
            year: "2018",
            value: 1873748.2,
          },
          {
            year: "2019",
            value: 1835982.0239,
          },
          {
            year: "2020",
            value: 1587545.1539,
          },
          {
            year: "2021",
            value: 2514134.0,
          },
          {
            year: "2022",
            value: 2759819.0,
          },
          {
            year: "2023",
            value: 2397848.0,
          },
          {
            year: "2024",
            value: 2405061.5805,
          },
        ],
      },
    },
    缅甸: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 409770.9,
          },
          {
            year: "2017",
            value: 452634.8,
          },
          {
            year: "2018",
            value: 468433.8,
          },
          {
            year: "2019",
            value: 638805.9154,
          },
          {
            year: "2020",
            value: 634679.808,
          },
          {
            year: "2021",
            value: 812208.0,
          },
          {
            year: "2022",
            value: 1149475.0,
          },
          {
            year: "2023",
            value: 956183.0,
          },
          {
            year: "2024",
            value: 706799.3443,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 818868.1,
          },
          {
            year: "2017",
            value: 894846.4,
          },
          {
            year: "2018",
            value: 1054777.1,
          },
          {
            year: "2019",
            value: 1231099.2449,
          },
          {
            year: "2020",
            value: 1254752.2172,
          },
          {
            year: "2021",
            value: 1052395.0,
          },
          {
            year: "2022",
            value: 1328764.0,
          },
          {
            year: "2023",
            value: 1139822.0,
          },
          {
            year: "2024",
            value: 921704.5314,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1228639.0,
          },
          {
            year: "2017",
            value: 1347481.2,
          },
          {
            year: "2018",
            value: 1523210.9,
          },
          {
            year: "2019",
            value: 1869905.1603,
          },
          {
            year: "2020",
            value: 1889432.0252,
          },
          {
            year: "2021",
            value: 1864603.0,
          },
          {
            year: "2022",
            value: 2478239.0,
          },
          {
            year: "2023",
            value: 2096006.0,
          },
          {
            year: "2024",
            value: 1628503.8757,
          },
        ],
      },
    },
    尼泊尔: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2240.6,
          },
          {
            year: "2017",
            value: 1785.4,
          },
          {
            year: "2018",
            value: 2200.0,
          },
          {
            year: "2019",
            value: 3353.8072,
          },
          {
            year: "2020",
            value: 1626.1278,
          },
          {
            year: "2021",
            value: 2651.0,
          },
          {
            year: "2022",
            value: 2181.0,
          },
          {
            year: "2023",
            value: 3483.0,
          },
          {
            year: "2024",
            value: 3710.6186,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 86626.9,
          },
          {
            year: "2017",
            value: 96695.5,
          },
          {
            year: "2018",
            value: 107736.8,
          },
          {
            year: "2019",
            value: 148247.7643,
          },
          {
            year: "2020",
            value: 116747.7765,
          },
          {
            year: "2021",
            value: 194992.0,
          },
          {
            year: "2022",
            value: 163855.0,
          },
          {
            year: "2023",
            value: 176473.0,
          },
          {
            year: "2024",
            value: 216041.3525,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 88867.5,
          },
          {
            year: "2017",
            value: 98480.9,
          },
          {
            year: "2018",
            value: 109936.8,
          },
          {
            year: "2019",
            value: 151601.5715,
          },
          {
            year: "2020",
            value: 118373.9043,
          },
          {
            year: "2021",
            value: 197643.0,
          },
          {
            year: "2022",
            value: 166037.0,
          },
          {
            year: "2023",
            value: 179955.0,
          },
          {
            year: "2024",
            value: 219751.9711,
          },
        ],
      },
    },
    沙特阿拉伯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2362601.9,
          },
          {
            year: "2017",
            value: 3176187.3,
          },
          {
            year: "2018",
            value: 4585438.0,
          },
          {
            year: "2019",
            value: 5419593.6612,
          },
          {
            year: "2020",
            value: 3906985.7145,
          },
          {
            year: "2021",
            value: 5696861.0,
          },
          {
            year: "2022",
            value: 7805625.0,
          },
          {
            year: "2023",
            value: 6436346.0,
          },
          {
            year: "2024",
            value: 5748415.8929,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1865528.1,
          },
          {
            year: "2017",
            value: 1837500.8,
          },
          {
            year: "2018",
            value: 1742803.6,
          },
          {
            year: "2019",
            value: 2387650.5592,
          },
          {
            year: "2020",
            value: 2809529.4391,
          },
          {
            year: "2021",
            value: 3032124.0,
          },
          {
            year: "2022",
            value: 3772055.0,
          },
          {
            year: "2023",
            value: 4285171.0,
          },
          {
            year: "2024",
            value: 5004999.4505,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4228130.0,
          },
          {
            year: "2017",
            value: 5013688.1,
          },
          {
            year: "2018",
            value: 6328241.6,
          },
          {
            year: "2019",
            value: 7807244.2204,
          },
          {
            year: "2020",
            value: 6716515.1536,
          },
          {
            year: "2021",
            value: 8728985.0,
          },
          {
            year: "2022",
            value: 11577680.0,
          },
          {
            year: "2023",
            value: 10721516.0,
          },
          {
            year: "2024",
            value: 10753415.3434,
          },
        ],
      },
    },
    斯里兰卡: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 27344.4,
          },
          {
            year: "2017",
            value: 31003.0,
          },
          {
            year: "2018",
            value: 32174.5,
          },
          {
            year: "2019",
            value: 39700.8323,
          },
          {
            year: "2020",
            value: 31776.3285,
          },
          {
            year: "2021",
            value: 65045.0,
          },
          {
            year: "2022",
            value: 49493.0,
          },
          {
            year: "2023",
            value: 35612.0,
          },
          {
            year: "2024",
            value: 39181.761,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 428832.9,
          },
          {
            year: "2017",
            value: 408799.6,
          },
          {
            year: "2018",
            value: 425504.9,
          },
          {
            year: "2019",
            value: 409060.6391,
          },
          {
            year: "2020",
            value: 384272.8983,
          },
          {
            year: "2021",
            value: 525443.0,
          },
          {
            year: "2022",
            value: 369644.0,
          },
          {
            year: "2023",
            value: 375543.0,
          },
          {
            year: "2024",
            value: 496858.2962,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 456177.3,
          },
          {
            year: "2017",
            value: 439802.6,
          },
          {
            year: "2018",
            value: 457679.4,
          },
          {
            year: "2019",
            value: 448761.4714,
          },
          {
            year: "2020",
            value: 416049.2268,
          },
          {
            year: "2021",
            value: 590488.0,
          },
          {
            year: "2022",
            value: 419137.0,
          },
          {
            year: "2023",
            value: 411155.0,
          },
          {
            year: "2024",
            value: 536040.0572,
          },
        ],
      },
    },
    塔吉克斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3124.5,
          },
          {
            year: "2017",
            value: 4673.7,
          },
          {
            year: "2018",
            value: 7684.4,
          },
          {
            year: "2019",
            value: 8461.9584,
          },
          {
            year: "2020",
            value: 4529.3459,
          },
          {
            year: "2021",
            value: 17547.0,
          },
          {
            year: "2022",
            value: 37378.0,
          },
          {
            year: "2023",
            value: 24981.0,
          },
          {
            year: "2024",
            value: 34835.7403,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 172509.7,
          },
          {
            year: "2017",
            value: 130137.5,
          },
          {
            year: "2018",
            value: 142908.2,
          },
          {
            year: "2019",
            value: 159006.7934,
          },
          {
            year: "2020",
            value: 101684.2189,
          },
          {
            year: "2021",
            value: 168315.0,
          },
          {
            year: "2022",
            value: 219681.0,
          },
          {
            year: "2023",
            value: 367661.0,
          },
          {
            year: "2024",
            value: 351233.9558,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 175634.2,
          },
          {
            year: "2017",
            value: 134811.2,
          },
          {
            year: "2018",
            value: 150592.6,
          },
          {
            year: "2019",
            value: 167468.7518,
          },
          {
            year: "2020",
            value: 106213.5648,
          },
          {
            year: "2021",
            value: 185862.0,
          },
          {
            year: "2022",
            value: 257059.0,
          },
          {
            year: "2023",
            value: 392642.0,
          },
          {
            year: "2024",
            value: 386069.6961,
          },
        ],
      },
    },
    泰国: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3853234.3,
          },
          {
            year: "2017",
            value: 4159608.3,
          },
          {
            year: "2018",
            value: 4462963.7,
          },
          {
            year: "2019",
            value: 4616164.9902,
          },
          {
            year: "2020",
            value: 4813973.7245,
          },
          {
            year: "2021",
            value: 6183263.0,
          },
          {
            year: "2022",
            value: 5655290.0,
          },
          {
            year: "2023",
            value: 5055010.0,
          },
          {
            year: "2024",
            value: 4794524.652,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3719508.4,
          },
          {
            year: "2017",
            value: 3854172.7,
          },
          {
            year: "2018",
            value: 4287871.7,
          },
          {
            year: "2019",
            value: 4558483.8927,
          },
          {
            year: "2020",
            value: 5051423.9522,
          },
          {
            year: "2021",
            value: 6935458.0,
          },
          {
            year: "2022",
            value: 7721773.0,
          },
          {
            year: "2023",
            value: 7572519.0,
          },
          {
            year: "2024",
            value: 8603629.9831,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 7572742.7,
          },
          {
            year: "2017",
            value: 8013781.0,
          },
          {
            year: "2018",
            value: 8750835.4,
          },
          {
            year: "2019",
            value: 9174648.8829,
          },
          {
            year: "2020",
            value: 9865397.6767,
          },
          {
            year: "2021",
            value: 13118721.0,
          },
          {
            year: "2022",
            value: 13377063.0,
          },
          {
            year: "2023",
            value: 12627529.0,
          },
          {
            year: "2024",
            value: 13398154.6351,
          },
        ],
      },
    },
    土耳其: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 278541.5,
          },
          {
            year: "2017",
            value: 378343.0,
          },
          {
            year: "2018",
            value: 375686.0,
          },
          {
            year: "2019",
            value: 349681.9906,
          },
          {
            year: "2020",
            value: 373141.1072,
          },
          {
            year: "2021",
            value: 504897.0,
          },
          {
            year: "2022",
            value: 450431.0,
          },
          {
            year: "2023",
            value: 451995.0,
          },
          {
            year: "2024",
            value: 477049.6527,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1668951.1,
          },
          {
            year: "2017",
            value: 1812150.8,
          },
          {
            year: "2018",
            value: 1778859.5,
          },
          {
            year: "2019",
            value: 1732370.4712,
          },
          {
            year: "2020",
            value: 2034648.2012,
          },
          {
            year: "2021",
            value: 2915179.0,
          },
          {
            year: "2022",
            value: 3382222.0,
          },
          {
            year: "2023",
            value: 3887138.0,
          },
          {
            year: "2024",
            value: 3811488.8074,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1947492.6,
          },
          {
            year: "2017",
            value: 2190493.8,
          },
          {
            year: "2018",
            value: 2154545.5,
          },
          {
            year: "2019",
            value: 2082052.4618,
          },
          {
            year: "2020",
            value: 2407789.3084,
          },
          {
            year: "2021",
            value: 3420076.0,
          },
          {
            year: "2022",
            value: 3832653.0,
          },
          {
            year: "2023",
            value: 4339133.0,
          },
          {
            year: "2024",
            value: 4288538.4601,
          },
        ],
      },
    },
    土库曼斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 556329.5,
          },
          {
            year: "2017",
            value: 657512.6,
          },
          {
            year: "2018",
            value: 811937.0,
          },
          {
            year: "2019",
            value: 868602.2768,
          },
          {
            year: "2020",
            value: 607188.1112,
          },
          {
            year: "2021",
            value: 684446.0,
          },
          {
            year: "2022",
            value: 1031356.0,
          },
          {
            year: "2023",
            value: 963340.0,
          },
          {
            year: "2024",
            value: 961832.0859,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 33847.9,
          },
          {
            year: "2017",
            value: 36811.7,
          },
          {
            year: "2018",
            value: 31692.5,
          },
          {
            year: "2019",
            value: 43085.3257,
          },
          {
            year: "2020",
            value: 44348.8588,
          },
          {
            year: "2021",
            value: 51297.0,
          },
          {
            year: "2022",
            value: 86055.0,
          },
          {
            year: "2023",
            value: 95683.8329,
          },
          {
            year: "2024",
            value: 102902.4569,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 590177.4,
          },
          {
            year: "2017",
            value: 694324.3,
          },
          {
            year: "2018",
            value: 843629.5,
          },
          {
            year: "2019",
            value: 911687.6025,
          },
          {
            year: "2020",
            value: 651536.97,
          },
          {
            year: "2021",
            value: 735743.0,
          },
          {
            year: "2022",
            value: 1117411.0,
          },
          {
            year: "2023",
            value: 1059024.0,
          },
          {
            year: "2024",
            value: 1064734.5428,
          },
        ],
      },
    },
    文莱: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 22154.6,
          },
          {
            year: "2017",
            value: 35181.0,
          },
          {
            year: "2018",
            value: 24751.0,
          },
          {
            year: "2019",
            value: 45287.7043,
          },
          {
            year: "2020",
            value: 147599.395,
          },
          {
            year: "2021",
            value: 222548.0,
          },
          {
            year: "2022",
            value: 224862.0,
          },
          {
            year: "2023",
            value: 194707.0,
          },
          {
            year: "2024",
            value: 209865.3789,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 51102.6,
          },
          {
            year: "2017",
            value: 63759.3,
          },
          {
            year: "2018",
            value: 159194.8,
          },
          {
            year: "2019",
            value: 64986.5127,
          },
          {
            year: "2020",
            value: 46622.4286,
          },
          {
            year: "2021",
            value: 63906.0,
          },
          {
            year: "2022",
            value: 81537.0,
          },
          {
            year: "2023",
            value: 85761.0,
          },
          {
            year: "2024",
            value: 71064.1125,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 73257.2,
          },
          {
            year: "2017",
            value: 98940.3,
          },
          {
            year: "2018",
            value: 183945.8,
          },
          {
            year: "2019",
            value: 110274.217,
          },
          {
            year: "2020",
            value: 194221.8236,
          },
          {
            year: "2021",
            value: 286454.0,
          },
          {
            year: "2022",
            value: 306399.0,
          },
          {
            year: "2023",
            value: 280468.0,
          },
          {
            year: "2024",
            value: 280929.4914,
          },
        ],
      },
    },
    乌兹别克斯坦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 160705.8,
          },
          {
            year: "2017",
            value: 147144.9,
          },
          {
            year: "2018",
            value: 232446.0,
          },
          {
            year: "2019",
            value: 218078.1409,
          },
          {
            year: "2020",
            value: 148330.8489,
          },
          {
            year: "2021",
            value: 215541.0,
          },
          {
            year: "2022",
            value: 227641.0,
          },
          {
            year: "2023",
            value: 165960.0,
          },
          {
            year: "2024",
            value: 201039.9312,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 200755.1,
          },
          {
            year: "2017",
            value: 274942.3,
          },
          {
            year: "2018",
            value: 394473.1,
          },
          {
            year: "2019",
            value: 503208.8425,
          },
          {
            year: "2020",
            value: 513871.6239,
          },
          {
            year: "2021",
            value: 588165.0,
          },
          {
            year: "2022",
            value: 742371.0,
          },
          {
            year: "2023",
            value: 1238066.0,
          },
          {
            year: "2024",
            value: 1177055.4382,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 361460.9,
          },
          {
            year: "2017",
            value: 422087.2,
          },
          {
            year: "2018",
            value: 626919.1,
          },
          {
            year: "2019",
            value: 721286.9834,
          },
          {
            year: "2020",
            value: 662202.4728,
          },
          {
            year: "2021",
            value: 803706.0,
          },
          {
            year: "2022",
            value: 970012.0,
          },
          {
            year: "2023",
            value: 1404026.0,
          },
          {
            year: "2024",
            value: 1378095.3694,
          },
        ],
      },
    },
    新加坡: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2601424.9,
          },
          {
            year: "2017",
            value: 3424962.4,
          },
          {
            year: "2018",
            value: 3372777.2,
          },
          {
            year: "2019",
            value: 3523781.8236,
          },
          {
            year: "2020",
            value: 3161807.126,
          },
          {
            year: "2021",
            value: 3881973.0,
          },
          {
            year: "2022",
            value: 3364172.0,
          },
          {
            year: "2023",
            value: 3142671.0,
          },
          {
            year: "2024",
            value: 3189332.8942,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 4451166.7,
          },
          {
            year: "2017",
            value: 4501930.0,
          },
          {
            year: "2018",
            value: 4903662.5,
          },
          {
            year: "2019",
            value: 5479848.8296,
          },
          {
            year: "2020",
            value: 5762612.1928,
          },
          {
            year: "2021",
            value: 5510346.0,
          },
          {
            year: "2022",
            value: 7942248.0,
          },
          {
            year: "2023",
            value: 7690828.0,
          },
          {
            year: "2024",
            value: 7922033.8937,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 7052591.6,
          },
          {
            year: "2017",
            value: 7926892.4,
          },
          {
            year: "2018",
            value: 8276439.7,
          },
          {
            year: "2019",
            value: 9003630.6532,
          },
          {
            year: "2020",
            value: 8924419.3188,
          },
          {
            year: "2021",
            value: 9392319.0,
          },
          {
            year: "2022",
            value: 11306419.0,
          },
          {
            year: "2023",
            value: 10833499.0,
          },
          {
            year: "2024",
            value: 11111366.7879,
          },
        ],
      },
    },
    叙利亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 326.4,
          },
          {
            year: "2017",
            value: 133.4,
          },
          {
            year: "2018",
            value: 86.9,
          },
          {
            year: "2019",
            value: 140.9486,
          },
          {
            year: "2020",
            value: 133.1472,
          },
          {
            year: "2021",
            value: 128.0,
          },
          {
            year: "2022",
            value: 224.0,
          },
          {
            year: "2023",
            value: 155.3166,
          },
          {
            year: "2024",
            value: 281.8012,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 91534.6,
          },
          {
            year: "2017",
            value: 110281.4,
          },
          {
            year: "2018",
            value: 127277.2,
          },
          {
            year: "2019",
            value: 131380.7451,
          },
          {
            year: "2020",
            value: 83352.1413,
          },
          {
            year: "2021",
            value: 48235.0,
          },
          {
            year: "2022",
            value: 42012.0,
          },
          {
            year: "2023",
            value: 35601.0,
          },
          {
            year: "2024",
            value: 38635.9358,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 91861.0,
          },
          {
            year: "2017",
            value: 110414.8,
          },
          {
            year: "2018",
            value: 127364.1,
          },
          {
            year: "2019",
            value: 131521.6937,
          },
          {
            year: "2020",
            value: 83485.2885,
          },
          {
            year: "2021",
            value: 48363.0,
          },
          {
            year: "2022",
            value: 42236.0,
          },
          {
            year: "2023",
            value: 35757.0215,
          },
          {
            year: "2024",
            value: 38917.737,
          },
        ],
      },
    },
    亚美尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 28061.8,
          },
          {
            year: "2017",
            value: 30267.7,
          },
          {
            year: "2018",
            value: 30214.3,
          },
          {
            year: "2019",
            value: 53130.4034,
          },
          {
            year: "2020",
            value: 79448.688,
          },
          {
            year: "2021",
            value: 108762.0,
          },
          {
            year: "2022",
            value: 90747.0,
          },
          {
            year: "2023",
            value: 98093.0,
          },
          {
            year: "2024",
            value: 76816.346,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 11119.4,
          },
          {
            year: "2017",
            value: 14385.2,
          },
          {
            year: "2018",
            value: 21318.4,
          },
          {
            year: "2019",
            value: 22309.3382,
          },
          {
            year: "2020",
            value: 22279.3564,
          },
          {
            year: "2021",
            value: 33098.0,
          },
          {
            year: "2022",
            value: 47953.0,
          },
          {
            year: "2023",
            value: 59790.0,
          },
          {
            year: "2024",
            value: 104790.5858,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 39181.2,
          },
          {
            year: "2017",
            value: 44652.9,
          },
          {
            year: "2018",
            value: 51532.7,
          },
          {
            year: "2019",
            value: 75439.7416,
          },
          {
            year: "2020",
            value: 101728.0444,
          },
          {
            year: "2021",
            value: 141860.0,
          },
          {
            year: "2022",
            value: 138701.0,
          },
          {
            year: "2023",
            value: 157883.0,
          },
          {
            year: "2024",
            value: 181606.9318,
          },
        ],
      },
    },
    也门: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16602.8,
          },
          {
            year: "2017",
            value: 65996.2,
          },
          {
            year: "2018",
            value: 71993.3,
          },
          {
            year: "2019",
            value: 86662.5199,
          },
          {
            year: "2020",
            value: 67401.9114,
          },
          {
            year: "2021",
            value: 48617.0,
          },
          {
            year: "2022",
            value: 63327.0,
          },
          {
            year: "2023",
            value: 1692.882,
          },
          {
            year: "2024",
            value: 2002.6925,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 169240.7,
          },
          {
            year: "2017",
            value: 164303.8,
          },
          {
            year: "2018",
            value: 187460.8,
          },
          {
            year: "2019",
            value: 281902.8984,
          },
          {
            year: "2020",
            value: 288133.6396,
          },
          {
            year: "2021",
            value: 257011.0,
          },
          {
            year: "2022",
            value: 275731.0,
          },
          {
            year: "2023",
            value: 267615.0,
          },
          {
            year: "2024",
            value: 247211.2579,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 185843.5,
          },
          {
            year: "2017",
            value: 230300.0,
          },
          {
            year: "2018",
            value: 259454.1,
          },
          {
            year: "2019",
            value: 368565.4183,
          },
          {
            year: "2020",
            value: 355535.551,
          },
          {
            year: "2021",
            value: 305628.0,
          },
          {
            year: "2022",
            value: 339057.0,
          },
          {
            year: "2023",
            value: 269306.0,
          },
          {
            year: "2024",
            value: 249213.9504,
          },
        ],
      },
    },
    伊拉克: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1066327.1,
          },
          {
            year: "2017",
            value: 1381411.2,
          },
          {
            year: "2018",
            value: 2249527.4,
          },
          {
            year: "2019",
            value: 2392733.6322,
          },
          {
            year: "2020",
            value: 1930376.4652,
          },
          {
            year: "2021",
            value: 2665311.0,
          },
          {
            year: "2022",
            value: 3939520.0,
          },
          {
            year: "2023",
            value: 3547555.0,
          },
          {
            year: "2024",
            value: 3823708.2198,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 754817.6,
          },
          {
            year: "2017",
            value: 833041.5,
          },
          {
            year: "2018",
            value: 790332.4,
          },
          {
            year: "2019",
            value: 946132.2795,
          },
          {
            year: "2020",
            value: 1092298.1278,
          },
          {
            year: "2021",
            value: 1068987.0,
          },
          {
            year: "2022",
            value: 1368657.0,
          },
          {
            year: "2023",
            value: 1428532.0,
          },
          {
            year: "2024",
            value: 1598612.9324,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1821144.7,
          },
          {
            year: "2017",
            value: 2214452.7,
          },
          {
            year: "2018",
            value: 3039859.8,
          },
          {
            year: "2019",
            value: 3338865.9117,
          },
          {
            year: "2020",
            value: 3022674.593,
          },
          {
            year: "2021",
            value: 3734298.0,
          },
          {
            year: "2022",
            value: 5308178.0,
          },
          {
            year: "2023",
            value: 4976087.0,
          },
          {
            year: "2024",
            value: 5422321.1522,
          },
        ],
      },
    },
    伊朗: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1482719.2,
          },
          {
            year: "2017",
            value: 1855369.3,
          },
          {
            year: "2018",
            value: 2110228.0,
          },
          {
            year: "2019",
            value: 1344562.9531,
          },
          {
            year: "2020",
            value: 644155.6555,
          },
          {
            year: "2021",
            value: 650253.0,
          },
          {
            year: "2022",
            value: 635370.0,
          },
          {
            year: "2023",
            value: 459313.0,
          },
          {
            year: "2024",
            value: 444402.9039,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1641866.1,
          },
          {
            year: "2017",
            value: 1858481.5,
          },
          {
            year: "2018",
            value: 1393973.3,
          },
          {
            year: "2019",
            value: 958998.6041,
          },
          {
            year: "2020",
            value: 849183.7762,
          },
          {
            year: "2021",
            value: 827822.0,
          },
          {
            year: "2022",
            value: 932655.0,
          },
          {
            year: "2023",
            value: 1002479.0,
          },
          {
            year: "2024",
            value: 892821.4509,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 3124585.3,
          },
          {
            year: "2017",
            value: 3713850.8,
          },
          {
            year: "2018",
            value: 3504201.3,
          },
          {
            year: "2019",
            value: 2303561.5572,
          },
          {
            year: "2020",
            value: 1493339.4317,
          },
          {
            year: "2021",
            value: 1478075.0,
          },
          {
            year: "2022",
            value: 1568025.0,
          },
          {
            year: "2023",
            value: 1461792.0,
          },
          {
            year: "2024",
            value: 1337224.3548,
          },
        ],
      },
    },
    印度尼西亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2141403.6,
          },
          {
            year: "2017",
            value: 2857430.6,
          },
          {
            year: "2018",
            value: 3414977.6,
          },
          {
            year: "2019",
            value: 3411387.4419,
          },
          {
            year: "2020",
            value: 3748185.2148,
          },
          {
            year: "2021",
            value: 6392283.0,
          },
          {
            year: "2022",
            value: 7789081.0,
          },
          {
            year: "2023",
            value: 7407424.0,
          },
          {
            year: "2024",
            value: 7109843.0545,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3212612.7,
          },
          {
            year: "2017",
            value: 3475738.5,
          },
          {
            year: "2018",
            value: 4319140.5,
          },
          {
            year: "2019",
            value: 4564873.7002,
          },
          {
            year: "2020",
            value: 4098122.5324,
          },
          {
            year: "2021",
            value: 6064749.0,
          },
          {
            year: "2022",
            value: 7064104.0,
          },
          {
            year: "2023",
            value: 6519192.0,
          },
          {
            year: "2024",
            value: 7669782.9823,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 5354016.3,
          },
          {
            year: "2017",
            value: 6333169.1,
          },
          {
            year: "2018",
            value: 7734118.1,
          },
          {
            year: "2019",
            value: 7976261.1421,
          },
          {
            year: "2020",
            value: 7846307.7472,
          },
          {
            year: "2021",
            value: 12457032.0,
          },
          {
            year: "2022",
            value: 14853185.0,
          },
          {
            year: "2023",
            value: 13926616.0,
          },
          {
            year: "2024",
            value: 14779626.0368,
          },
        ],
      },
    },
    约旦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 21116.1,
          },
          {
            year: "2017",
            value: 27918.5,
          },
          {
            year: "2018",
            value: 21418.2,
          },
          {
            year: "2019",
            value: 43406.0039,
          },
          {
            year: "2020",
            value: 42572.9742,
          },
          {
            year: "2021",
            value: 42471.0,
          },
          {
            year: "2022",
            value: 74587.0,
          },
          {
            year: "2023",
            value: 70594.0,
          },
          {
            year: "2024",
            value: 44191.259,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 295482.5,
          },
          {
            year: "2017",
            value: 280360.9,
          },
          {
            year: "2018",
            value: 296948.5,
          },
          {
            year: "2019",
            value: 367791.6011,
          },
          {
            year: "2020",
            value: 318150.8856,
          },
          {
            year: "2021",
            value: 399009.0,
          },
          {
            year: "2022",
            value: 565042.0,
          },
          {
            year: "2023",
            value: 508042.0,
          },
          {
            year: "2024",
            value: 492817.7501,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 316598.6,
          },
          {
            year: "2017",
            value: 308279.4,
          },
          {
            year: "2018",
            value: 318366.7,
          },
          {
            year: "2019",
            value: 411197.605,
          },
          {
            year: "2020",
            value: 360723.8598,
          },
          {
            year: "2021",
            value: 441480.0,
          },
          {
            year: "2022",
            value: 639629.0,
          },
          {
            year: "2023",
            value: 578635.0,
          },
          {
            year: "2024",
            value: 537009.0091,
          },
        ],
      },
    },
    越南: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3717160.4,
          },
          {
            year: "2017",
            value: 5037461.7,
          },
          {
            year: "2018",
            value: 6395634.9,
          },
          {
            year: "2019",
            value: 6411667.4838,
          },
          {
            year: "2020",
            value: 7847442.5894,
          },
          {
            year: "2021",
            value: 9231942.0,
          },
          {
            year: "2022",
            value: 8794254.0,
          },
          {
            year: "2023",
            value: 9213259.0,
          },
          {
            year: "2024",
            value: 9876131.7651,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 6110412.8,
          },
          {
            year: "2017",
            value: 7161724.8,
          },
          {
            year: "2018",
            value: 8387668.8,
          },
          {
            year: "2019",
            value: 9786888.2174,
          },
          {
            year: "2020",
            value: 11381565.6726,
          },
          {
            year: "2021",
            value: 13789507.0,
          },
          {
            year: "2022",
            value: 14387570.0,
          },
          {
            year: "2023",
            value: 13760140.0,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 9827573.2,
          },
          {
            year: "2017",
            value: 12199186.5,
          },
          {
            year: "2018",
            value: 14783303.7,
          },
          {
            year: "2019",
            value: 16198555.7012,
          },
          {
            year: "2020",
            value: 19229008.262,
          },
          {
            year: "2021",
            value: 23021449.0,
          },
          {
            year: "2022",
            value: 23181824.0,
          },
          {
            year: "2023",
            value: 22973398.0,
          },
          {
            year: "2024",
            value: 26065080.5679,
          },
        ],
      },
    },
    阿尔及利亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 33188.6,
          },
          {
            year: "2017",
            value: 44832.4,
          },
          {
            year: "2018",
            value: 117770.1,
          },
          {
            year: "2019",
            value: 114125.1265,
          },
          {
            year: "2020",
            value: 99706.0111,
          },
          {
            year: "2021",
            value: 108077.0,
          },
          {
            year: "2022",
            value: 114348.0,
          },
          {
            year: "2023",
            value: 84941.0,
          },
          {
            year: "2024",
            value: 80035.1165,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 764811.2,
          },
          {
            year: "2017",
            value: 678474.6,
          },
          {
            year: "2018",
            value: 792645.4,
          },
          {
            year: "2019",
            value: 694178.2829,
          },
          {
            year: "2020",
            value: 559636.8602,
          },
          {
            year: "2021",
            value: 634955.0,
          },
          {
            year: "2022",
            value: 623449.0,
          },
          {
            year: "2023",
            value: 945715.0,
          },
          {
            year: "2024",
            value: 1168178.0094,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 797999.8,
          },
          {
            year: "2017",
            value: 723307.0,
          },
          {
            year: "2018",
            value: 910415.5,
          },
          {
            year: "2019",
            value: 808303.4094,
          },
          {
            year: "2020",
            value: 659342.8713,
          },
          {
            year: "2021",
            value: 743032.0,
          },
          {
            year: "2022",
            value: 737797.0,
          },
          {
            year: "2023",
            value: 1030656.0,
          },
          {
            year: "2024",
            value: 1248213.1259,
          },
        ],
      },
    },
    埃及: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 55321.2,
          },
          {
            year: "2017",
            value: 134193.4,
          },
          {
            year: "2018",
            value: 184252.4,
          },
          {
            year: "2019",
            value: 100071.9187,
          },
          {
            year: "2020",
            value: 92348.2598,
          },
          {
            year: "2021",
            value: 170358.0,
          },
          {
            year: "2022",
            value: 101983.0,
          },
          {
            year: "2023",
            value: 88134.0,
          },
          {
            year: "2024",
            value: 57753.8543,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1043728.1,
          },
          {
            year: "2017",
            value: 948564.3,
          },
          {
            year: "2018",
            value: 1198720.8,
          },
          {
            year: "2019",
            value: 1220070.5391,
          },
          {
            year: "2020",
            value: 1362784.2904,
          },
          {
            year: "2021",
            value: 1826461.0,
          },
          {
            year: "2022",
            value: 1698945.0,
          },
          {
            year: "2023",
            value: 1493327.0,
          },
          {
            year: "2024",
            value: 1680056.518,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1099049.3,
          },
          {
            year: "2017",
            value: 1082757.7,
          },
          {
            year: "2018",
            value: 1382973.2,
          },
          {
            year: "2019",
            value: 1320142.4578,
          },
          {
            year: "2020",
            value: 1455132.5502,
          },
          {
            year: "2021",
            value: 1996819.0,
          },
          {
            year: "2022",
            value: 1800927.0,
          },
          {
            year: "2023",
            value: 1581460.0,
          },
          {
            year: "2024",
            value: 1737810.3723,
          },
        ],
      },
    },
    埃塞俄比亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 41942.0,
          },
          {
            year: "2017",
            value: 35758.3,
          },
          {
            year: "2018",
            value: 34530.2,
          },
          {
            year: "2019",
            value: 34395.2778,
          },
          {
            year: "2020",
            value: 33877.0517,
          },
          {
            year: "2021",
            value: 36599.0,
          },
          {
            year: "2022",
            value: 45359.0,
          },
          {
            year: "2023",
            value: 43555.0,
          },
          {
            year: "2024",
            value: 40936.5674,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 321468.9,
          },
          {
            year: "2017",
            value: 266455.5,
          },
          {
            year: "2018",
            value: 253087.2,
          },
          {
            year: "2019",
            value: 232349.9016,
          },
          {
            year: "2020",
            value: 223332.152,
          },
          {
            year: "2021",
            value: 229079.0,
          },
          {
            year: "2022",
            value: 220426.0,
          },
          {
            year: "2023",
            value: 258878.0,
          },
          {
            year: "2024",
            value: 314373.5643,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 363410.9,
          },
          {
            year: "2017",
            value: 302213.8,
          },
          {
            year: "2018",
            value: 287617.4,
          },
          {
            year: "2019",
            value: 266745.1794,
          },
          {
            year: "2020",
            value: 257209.2037,
          },
          {
            year: "2021",
            value: 265678.0,
          },
          {
            year: "2022",
            value: 265785.0,
          },
          {
            year: "2023",
            value: 302432.0,
          },
          {
            year: "2024",
            value: 355310.1317,
          },
        ],
      },
    },
    安哥拉: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1396611.7,
          },
          {
            year: "2017",
            value: 2069870.9,
          },
          {
            year: "2018",
            value: 2582651.0,
          },
          {
            year: "2019",
            value: 2383740.2142,
          },
          {
            year: "2020",
            value: 1475773.0338,
          },
          {
            year: "2021",
            value: 2102743.0,
          },
          {
            year: "2022",
            value: 2324018.0,
          },
          {
            year: "2023",
            value: 1891640.0,
          },
          {
            year: "2024",
            value: 1764197.7948,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 168065.1,
          },
          {
            year: "2017",
            value: 225745.3,
          },
          {
            year: "2018",
            value: 225313.7,
          },
          {
            year: "2019",
            value: 205572.7417,
          },
          {
            year: "2020",
            value: 174815.4461,
          },
          {
            year: "2021",
            value: 249142.0,
          },
          {
            year: "2022",
            value: 399719.0,
          },
          {
            year: "2023",
            value: 414022.0,
          },
          {
            year: "2024",
            value: 324335.3213,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1564676.8,
          },
          {
            year: "2017",
            value: 2295616.2,
          },
          {
            year: "2018",
            value: 2807964.7,
          },
          {
            year: "2019",
            value: 2589312.9559,
          },
          {
            year: "2020",
            value: 1650588.4799,
          },
          {
            year: "2021",
            value: 2351885.0,
          },
          {
            year: "2022",
            value: 2723738.0,
          },
          {
            year: "2023",
            value: 2305662.0,
          },
          {
            year: "2024",
            value: 2088533.1161,
          },
        ],
      },
    },
    贝宁: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 5539.2,
          },
          {
            year: "2017",
            value: 9159.0,
          },
          {
            year: "2018",
            value: 4832.5,
          },
          {
            year: "2019",
            value: 15435.6896,
          },
          {
            year: "2020",
            value: 5824.7536,
          },
          {
            year: "2021",
            value: 23157.0,
          },
          {
            year: "2022",
            value: 25701.0,
          },
          {
            year: "2023",
            value: 9845.0,
          },
          {
            year: "2024",
            value: 14148.3005,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 203949.7,
          },
          {
            year: "2017",
            value: 192650.9,
          },
          {
            year: "2018",
            value: 214994.8,
          },
          {
            year: "2019",
            value: 215251.8547,
          },
          {
            year: "2020",
            value: 98838.796,
          },
          {
            year: "2021",
            value: 122752.0,
          },
          {
            year: "2022",
            value: 166770.0,
          },
          {
            year: "2023",
            value: 162994.0,
          },
          {
            year: "2024",
            value: 96575.9123,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 209488.9,
          },
          {
            year: "2017",
            value: 201809.9,
          },
          {
            year: "2018",
            value: 219827.3,
          },
          {
            year: "2019",
            value: 230687.5443,
          },
          {
            year: "2020",
            value: 104663.5496,
          },
          {
            year: "2021",
            value: 145909.0,
          },
          {
            year: "2022",
            value: 192471.0,
          },
          {
            year: "2023",
            value: 172839.0,
          },
          {
            year: "2024",
            value: 110724.2128,
          },
        ],
      },
    },
    博茨瓦纳: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 20972.8,
          },
          {
            year: "2017",
            value: 23270.0,
          },
          {
            year: "2018",
            value: 28160.3,
          },
          {
            year: "2019",
            value: 30145.857,
          },
          {
            year: "2020",
            value: 23543.9013,
          },
          {
            year: "2021",
            value: 25550.0,
          },
          {
            year: "2022",
            value: 21872.0,
          },
          {
            year: "2023",
            value: 21423.6367,
          },
          {
            year: "2024",
            value: 23981.4729,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 27187.0,
          },
          {
            year: "2017",
            value: 26624.8,
          },
          {
            year: "2018",
            value: 29583.3,
          },
          {
            year: "2019",
            value: 31859.2773,
          },
          {
            year: "2020",
            value: 32292.5172,
          },
          {
            year: "2021",
            value: 42821.0,
          },
          {
            year: "2022",
            value: 61163.0,
          },
          {
            year: "2023",
            value: 71095.0,
          },
          {
            year: "2024",
            value: 101027.3399,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 6214.2,
          },
          {
            year: "2017",
            value: 3354.8,
          },
          {
            year: "2018",
            value: 1423.0,
          },
          {
            year: "2019",
            value: 1713.4203,
          },
          {
            year: "2020",
            value: 8748.6159,
          },
          {
            year: "2021",
            value: 17271.0,
          },
          {
            year: "2022",
            value: 39291.0,
          },
          {
            year: "2023",
            value: 49672.0,
          },
          {
            year: "2024",
            value: 77045.867,
          },
        ],
      },
    },
    布基纳法索: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 14109.3,
          },
          {
            year: "2017",
            value: 18304.9,
          },
          {
            year: "2018",
            value: 22299.6,
          },
          {
            year: "2019",
            value: 26161.2964,
          },
          {
            year: "2020",
            value: 32252.178,
          },
          {
            year: "2021",
            value: 44254.0,
          },
          {
            year: "2022",
            value: 50072.0,
          },
          {
            year: "2023",
            value: 53780.6182,
          },
          {
            year: "2024",
            value: 68626.3711,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 15509.2,
          },
          {
            year: "2017",
            value: 20348.5,
          },
          {
            year: "2018",
            value: 31811.4,
          },
          {
            year: "2019",
            value: 32147.0803,
          },
          {
            year: "2020",
            value: 40247.8596,
          },
          {
            year: "2021",
            value: 63465.0,
          },
          {
            year: "2022",
            value: 60474.0,
          },
          {
            year: "2023",
            value: 59438.0884,
          },
          {
            year: "2024",
            value: 74144.3434,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1399.9,
          },
          {
            year: "2017",
            value: 2043.6,
          },
          {
            year: "2018",
            value: 9511.8,
          },
          {
            year: "2019",
            value: 5985.7839,
          },
          {
            year: "2020",
            value: 7995.6816,
          },
          {
            year: "2021",
            value: 19211.0,
          },
          {
            year: "2022",
            value: 10402.0,
          },
          {
            year: "2023",
            value: 5657.4702,
          },
          {
            year: "2024",
            value: 5517.9723,
          },
        ],
      },
    },
    布隆迪: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 4506.4,
          },
          {
            year: "2017",
            value: 4525.3,
          },
          {
            year: "2018",
            value: 3732.4,
          },
          {
            year: "2019",
            value: 6638.841,
          },
          {
            year: "2020",
            value: 7396.6173,
          },
          {
            year: "2021",
            value: 12690.0,
          },
          {
            year: "2022",
            value: 11612.0,
          },
          {
            year: "2023",
            value: 10438.8362,
          },
          {
            year: "2024",
            value: 9007.5263,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4780.1,
          },
          {
            year: "2017",
            value: 5218.2,
          },
          {
            year: "2018",
            value: 4925.2,
          },
          {
            year: "2019",
            value: 7933.4631,
          },
          {
            year: "2020",
            value: 8160.3711,
          },
          {
            year: "2021",
            value: 13551.0,
          },
          {
            year: "2022",
            value: 12619.0,
          },
          {
            year: "2023",
            value: 11391.8692,
          },
          {
            year: "2024",
            value: 11290.9211,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 273.7,
          },
          {
            year: "2017",
            value: 692.9,
          },
          {
            year: "2018",
            value: 1192.8,
          },
          {
            year: "2019",
            value: 1294.6221,
          },
          {
            year: "2020",
            value: 763.7538,
          },
          {
            year: "2021",
            value: 861.0,
          },
          {
            year: "2022",
            value: 1007.0,
          },
          {
            year: "2023",
            value: 953.033,
          },
          {
            year: "2024",
            value: 2283.3948,
          },
        ],
      },
    },
    赤道几内亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 63185.2,
          },
          {
            year: "2017",
            value: 148383.5,
          },
          {
            year: "2018",
            value: 213937.2,
          },
          {
            year: "2019",
            value: 172306.4057,
          },
          {
            year: "2020",
            value: 118254.9225,
          },
          {
            year: "2021",
            value: 121519.0,
          },
          {
            year: "2022",
            value: 150440.0,
          },
          {
            year: "2023",
            value: 137109.0,
          },
          {
            year: "2024",
            value: 98173.5295,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 14829.2,
          },
          {
            year: "2017",
            value: 16621.8,
          },
          {
            year: "2018",
            value: 14514.6,
          },
          {
            year: "2019",
            value: 11320.4451,
          },
          {
            year: "2020",
            value: 12212.0216,
          },
          {
            year: "2021",
            value: 12398.0,
          },
          {
            year: "2022",
            value: 22775.0,
          },
          {
            year: "2023",
            value: 20178.0,
          },
          {
            year: "2024",
            value: 17041.5616,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 78014.4,
          },
          {
            year: "2017",
            value: 165005.3,
          },
          {
            year: "2018",
            value: 228451.8,
          },
          {
            year: "2019",
            value: 183626.8508,
          },
          {
            year: "2020",
            value: 130466.9441,
          },
          {
            year: "2021",
            value: 133917.0,
          },
          {
            year: "2022",
            value: 173214.0,
          },
          {
            year: "2023",
            value: 157286.0,
          },
          {
            year: "2024",
            value: 115215.0911,
          },
        ],
      },
    },
    多哥: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 10533.2,
          },
          {
            year: "2017",
            value: 7318.7,
          },
          {
            year: "2018",
            value: 14576.2,
          },
          {
            year: "2019",
            value: 18043.6943,
          },
          {
            year: "2020",
            value: 16419.9953,
          },
          {
            year: "2021",
            value: 53288.0,
          },
          {
            year: "2022",
            value: 19229.0,
          },
          {
            year: "2023",
            value: 16867.0,
          },
          {
            year: "2024",
            value: 21269.4701,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 191929.8,
          },
          {
            year: "2017",
            value: 188634.6,
          },
          {
            year: "2018",
            value: 198924.5,
          },
          {
            year: "2019",
            value: 213075.1253,
          },
          {
            year: "2020",
            value: 245918.2151,
          },
          {
            year: "2021",
            value: 295272.0,
          },
          {
            year: "2022",
            value: 310103.0,
          },
          {
            year: "2023",
            value: 377620.0,
          },
          {
            year: "2024",
            value: 328430.2759,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 202463.0,
          },
          {
            year: "2017",
            value: 195953.3,
          },
          {
            year: "2018",
            value: 213500.7,
          },
          {
            year: "2019",
            value: 231118.8196,
          },
          {
            year: "2020",
            value: 262338.2104,
          },
          {
            year: "2021",
            value: 348560.0,
          },
          {
            year: "2022",
            value: 329333.0,
          },
          {
            year: "2023",
            value: 394487.0,
          },
          {
            year: "2024",
            value: 349699.746,
          },
        ],
      },
    },
    厄立特里亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 17547.5,
          },
          {
            year: "2017",
            value: 17069.0,
          },
          {
            year: "2018",
            value: 31085.8,
          },
          {
            year: "2019",
            value: 20606.403,
          },
          {
            year: "2020",
            value: 30862.989,
          },
          {
            year: "2021",
            value: 39138.0,
          },
          {
            year: "2022",
            value: 45771.0,
          },
          {
            year: "2023",
            value: 35482.0,
          },
          {
            year: "2024",
            value: 44578.8204,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 6933.4,
          },
          {
            year: "2017",
            value: 4294.7,
          },
          {
            year: "2018",
            value: 4284.5,
          },
          {
            year: "2019",
            value: 4854.2506,
          },
          {
            year: "2020",
            value: 7048.619,
          },
          {
            year: "2021",
            value: 6996.0,
          },
          {
            year: "2022",
            value: 14799.0,
          },
          {
            year: "2023",
            value: 13896.1739,
          },
          {
            year: "2024",
            value: 15987.8466,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 24480.9,
          },
          {
            year: "2017",
            value: 21363.7,
          },
          {
            year: "2018",
            value: 35370.3,
          },
          {
            year: "2019",
            value: 25460.6536,
          },
          {
            year: "2020",
            value: 37911.608,
          },
          {
            year: "2021",
            value: 46134.0,
          },
          {
            year: "2022",
            value: 60571.0,
          },
          {
            year: "2023",
            value: 49378.0,
          },
          {
            year: "2024",
            value: 60566.667,
          },
        ],
      },
    },
    佛得角: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 4869.8,
          },
          {
            year: "2017",
            value: 6924.0,
          },
          {
            year: "2018",
            value: 7826.6,
          },
          {
            year: "2019",
            value: 6416.6991,
          },
          {
            year: "2020",
            value: 7783.7209,
          },
          {
            year: "2021",
            value: 8454.0,
          },
          {
            year: "2022",
            value: 9174.0,
          },
          {
            year: "2023",
            value: 10319.0,
          },
          {
            year: "2024",
            value: 11389.4588,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4878.1,
          },
          {
            year: "2017",
            value: 6924.8,
          },
          {
            year: "2018",
            value: 7855.6,
          },
          {
            year: "2019",
            value: 6419.5682,
          },
          {
            year: "2020",
            value: 7904.7201,
          },
          {
            year: "2021",
            value: 8569.0,
          },
          {
            year: "2022",
            value: 9176.0,
          },
          {
            year: "2023",
            value: 10326.0,
          },
          {
            year: "2024",
            value: 11390.8346,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 8.3,
          },
          {
            year: "2017",
            value: 0.8,
          },
          {
            year: "2018",
            value: 29.0,
          },
          {
            year: "2019",
            value: 2.8691,
          },
          {
            year: "2020",
            value: 120.9992,
          },
          {
            year: "2021",
            value: 115.0,
          },
          {
            year: "2022",
            value: 2.0,
          },
          {
            year: "2023",
            value: 7.2199,
          },
          {
            year: "2024",
            value: 1.3758,
          },
        ],
      },
    },
    冈比亚: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 31510.6,
          },
          {
            year: "2017",
            value: 39865.3,
          },
          {
            year: "2018",
            value: 42619.1,
          },
          {
            year: "2019",
            value: 51248.0767,
          },
          {
            year: "2020",
            value: 53566.6916,
          },
          {
            year: "2021",
            value: 54395.0,
          },
          {
            year: "2022",
            value: 44619.0,
          },
          {
            year: "2023",
            value: 47450.0,
          },
          {
            year: "2024",
            value: 43419.7026,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 40520.1,
          },
          {
            year: "2017",
            value: 49770.5,
          },
          {
            year: "2018",
            value: 44625.3,
          },
          {
            year: "2019",
            value: 58392.4399,
          },
          {
            year: "2020",
            value: 56556.9022,
          },
          {
            year: "2021",
            value: 58855.0,
          },
          {
            year: "2022",
            value: 49033.0,
          },
          {
            year: "2023",
            value: 51392.0,
          },
          {
            year: "2024",
            value: 49522.4349,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 9009.5,
          },
          {
            year: "2017",
            value: 9905.2,
          },
          {
            year: "2018",
            value: 2006.2,
          },
          {
            year: "2019",
            value: 7144.3632,
          },
          {
            year: "2020",
            value: 2990.2106,
          },
          {
            year: "2021",
            value: 4460.0,
          },
          {
            year: "2022",
            value: 4414.0,
          },
          {
            year: "2023",
            value: 3942.3748,
          },
          {
            year: "2024",
            value: 6102.7323,
          },
        ],
      },
    },
    "刚果(布)": {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 233300.2,
          },
          {
            year: "2017",
            value: 396206.5,
          },
          {
            year: "2018",
            value: 681300.1,
          },
          {
            year: "2019",
            value: 610222.4091,
          },
          {
            year: "2020",
            value: 337184.905,
          },
          {
            year: "2021",
            value: 471058.0,
          },
          {
            year: "2022",
            value: 559876.0,
          },
          {
            year: "2023",
            value: 545197.0,
          },
          {
            year: "2024",
            value: 420908.8711,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 74068.2,
          },
          {
            year: "2017",
            value: 49783.6,
          },
          {
            year: "2018",
            value: 44596.1,
          },
          {
            year: "2019",
            value: 43509.5402,
          },
          {
            year: "2020",
            value: 59631.4061,
          },
          {
            year: "2021",
            value: 67914.0,
          },
          {
            year: "2022",
            value: 94897.0,
          },
          {
            year: "2023",
            value: 149656.0,
          },
          {
            year: "2024",
            value: 150424.3423,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 307368.4,
          },
          {
            year: "2017",
            value: 445990.1,
          },
          {
            year: "2018",
            value: 725896.2,
          },
          {
            year: "2019",
            value: 653731.9493,
          },
          {
            year: "2020",
            value: 396816.3111,
          },
          {
            year: "2021",
            value: 538972.0,
          },
          {
            year: "2022",
            value: 654774.0,
          },
          {
            year: "2023",
            value: 694853.0,
          },
          {
            year: "2024",
            value: 571333.2134,
          },
        ],
      },
    },
    "刚果(金)": {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 208496.2,
          },
          {
            year: "2017",
            value: 328998.9,
          },
          {
            year: "2018",
            value: 565553.7,
          },
          {
            year: "2019",
            value: 442918.5342,
          },
          {
            year: "2020",
            value: 708372.7458,
          },
          {
            year: "2021",
            value: 1167891.0,
          },
          {
            year: "2022",
            value: 1656179.0,
          },
          {
            year: "2023",
            value: 1421873.0,
          },
          {
            year: "2024",
            value: 2158514.7288,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 99258.3,
          },
          {
            year: "2017",
            value: 96998.3,
          },
          {
            year: "2018",
            value: 177324.8,
          },
          {
            year: "2019",
            value: 207679.5634,
          },
          {
            year: "2020",
            value: 201343.0994,
          },
          {
            year: "2021",
            value: 275686.0,
          },
          {
            year: "2022",
            value: 506654.0,
          },
          {
            year: "2023",
            value: 448518.0,
          },
          {
            year: "2024",
            value: 434550.5116,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 307754.5,
          },
          {
            year: "2017",
            value: 425997.2,
          },
          {
            year: "2018",
            value: 742878.5,
          },
          {
            year: "2019",
            value: 650598.0976,
          },
          {
            year: "2020",
            value: 909715.8452,
          },
          {
            year: "2021",
            value: 1443577.0,
          },
          {
            year: "2022",
            value: 2162832.0,
          },
          {
            year: "2023",
            value: 1870391.0,
          },
          {
            year: "2024",
            value: 2593065.2404,
          },
        ],
      },
    },
    吉布提: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 13.4,
          },
          {
            year: "2017",
            value: 1.5,
          },
          {
            year: "2018",
            value: 20.4,
          },
          {
            year: "2019",
            value: 2004.4965,
          },
          {
            year: "2020",
            value: 4624.8864,
          },
          {
            year: "2021",
            value: 5581.0,
          },
          {
            year: "2022",
            value: 9673.0,
          },
          {
            year: "2023",
            value: 11921.7651,
          },
          {
            year: "2024",
            value: 2055.4519,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 214843.8,
          },
          {
            year: "2017",
            value: 217541.0,
          },
          {
            year: "2018",
            value: 186377.9,
          },
          {
            year: "2019",
            value: 220638.5569,
          },
          {
            year: "2020",
            value: 231012.6454,
          },
          {
            year: "2021",
            value: 257181.0,
          },
          {
            year: "2022",
            value: 319271.0,
          },
          {
            year: "2023",
            value: 336368.0,
          },
          {
            year: "2024",
            value: 303666.3587,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 214857.2,
          },
          {
            year: "2017",
            value: 217542.5,
          },
          {
            year: "2018",
            value: 186398.3,
          },
          {
            year: "2019",
            value: 222643.0534,
          },
          {
            year: "2020",
            value: 235637.5318,
          },
          {
            year: "2021",
            value: 262762.0,
          },
          {
            year: "2022",
            value: 328944.0,
          },
          {
            year: "2023",
            value: 348289.0,
          },
          {
            year: "2024",
            value: 305721.8106,
          },
        ],
      },
    },
    几内亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 63005.7,
          },
          {
            year: "2017",
            value: 146675.3,
          },
          {
            year: "2018",
            value: 218761.6,
          },
          {
            year: "2019",
            value: 245608.9817,
          },
          {
            year: "2020",
            value: 243885.1194,
          },
          {
            year: "2021",
            value: 279387.0,
          },
          {
            year: "2022",
            value: 452146.0,
          },
          {
            year: "2023",
            value: 640837.0,
          },
          {
            year: "2024",
            value: 764365.5267,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 114449.8,
          },
          {
            year: "2017",
            value: 123995.7,
          },
          {
            year: "2018",
            value: 135349.7,
          },
          {
            year: "2019",
            value: 171742.9222,
          },
          {
            year: "2020",
            value: 191170.3967,
          },
          {
            year: "2021",
            value: 215847.0,
          },
          {
            year: "2022",
            value: 224607.0,
          },
          {
            year: "2023",
            value: 264289.0,
          },
          {
            year: "2024",
            value: 393077.3226,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 177455.5,
          },
          {
            year: "2017",
            value: 270671.0,
          },
          {
            year: "2018",
            value: 354111.3,
          },
          {
            year: "2019",
            value: 417351.9039,
          },
          {
            year: "2020",
            value: 435055.5161,
          },
          {
            year: "2021",
            value: 495234.0,
          },
          {
            year: "2022",
            value: 676753.0,
          },
          {
            year: "2023",
            value: 905126.0,
          },
          {
            year: "2024",
            value: 1157442.8493,
          },
        ],
      },
    },
    几内亚比绍: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 2125.3,
          },
          {
            year: "2017",
            value: 3372.4,
          },
          {
            year: "2018",
            value: 2983.2,
          },
          {
            year: "2019",
            value: 3193.8678,
          },
          {
            year: "2020",
            value: 5143.1071,
          },
          {
            year: "2021",
            value: 8888.0,
          },
          {
            year: "2022",
            value: 5569.0,
          },
          {
            year: "2023",
            value: 6269.0,
          },
          {
            year: "2024",
            value: 9766.7602,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 2141.4,
          },
          {
            year: "2017",
            value: 3412.6,
          },
          {
            year: "2018",
            value: 3747.1,
          },
          {
            year: "2019",
            value: 4034.1038,
          },
          {
            year: "2020",
            value: 5143.6452,
          },
          {
            year: "2021",
            value: 8888.0,
          },
          {
            year: "2022",
            value: 5569.0,
          },
          {
            year: "2023",
            value: 6270.4196,
          },
          {
            year: "2024",
            value: 9766.8469,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16.1,
          },
          {
            year: "2017",
            value: 40.2,
          },
          {
            year: "2018",
            value: 763.9,
          },
          {
            year: "2019",
            value: 840.236,
          },
          {
            year: "2020",
            value: 0.5381,
          },
          {
            year: "2021",
            value: 0.11,
          },
          {
            year: "2022",
            value: 0.3,
          },
          {
            year: "2023",
            value: 0.1533,
          },
          {
            year: "2024",
            value: 0.0867,
          },
        ],
      },
    },
    加纳: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 130965.0,
          },
          {
            year: "2017",
            value: 185293.9,
          },
          {
            year: "2018",
            value: 244201.2,
          },
          {
            year: "2019",
            value: 257640.5874,
          },
          {
            year: "2020",
            value: 177449.871,
          },
          {
            year: "2021",
            value: 146617.0,
          },
          {
            year: "2022",
            value: 234146.0,
          },
          {
            year: "2023",
            value: 182233.0,
          },
          {
            year: "2024",
            value: 199168.622,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 466703.1,
          },
          {
            year: "2017",
            value: 482479.7,
          },
          {
            year: "2018",
            value: 481394.8,
          },
          {
            year: "2019",
            value: 490325.6486,
          },
          {
            year: "2020",
            value: 675628.3115,
          },
          {
            year: "2021",
            value: 810394.0,
          },
          {
            year: "2022",
            value: 776730.0,
          },
          {
            year: "2023",
            value: 922364.0,
          },
          {
            year: "2024",
            value: 984372.0073,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 597668.1,
          },
          {
            year: "2017",
            value: 667773.6,
          },
          {
            year: "2018",
            value: 725596.0,
          },
          {
            year: "2019",
            value: 747966.236,
          },
          {
            year: "2020",
            value: 853078.1825,
          },
          {
            year: "2021",
            value: 957011.0,
          },
          {
            year: "2022",
            value: 1010876.0,
          },
          {
            year: "2023",
            value: 1104597.0,
          },
          {
            year: "2024",
            value: 1183540.6293,
          },
        ],
      },
    },
    加蓬: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 143907.9,
          },
          {
            year: "2017",
            value: 229361.1,
          },
          {
            year: "2018",
            value: 297672.3,
          },
          {
            year: "2019",
            value: 464665.8917,
          },
          {
            year: "2020",
            value: 324406.7014,
          },
          {
            year: "2021",
            value: 258479.0,
          },
          {
            year: "2022",
            value: 394697.0,
          },
          {
            year: "2023",
            value: 307530.0,
          },
          {
            year: "2024",
            value: 292139.5369,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 37724.0,
          },
          {
            year: "2017",
            value: 44619.1,
          },
          {
            year: "2018",
            value: 38585.8,
          },
          {
            year: "2019",
            value: 37726.1997,
          },
          {
            year: "2020",
            value: 41544.9663,
          },
          {
            year: "2021",
            value: 43616.0,
          },
          {
            year: "2022",
            value: 57159.0,
          },
          {
            year: "2023",
            value: 71941.6845,
          },
          {
            year: "2024",
            value: 72113.481,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 181631.9,
          },
          {
            year: "2017",
            value: 273980.2,
          },
          {
            year: "2018",
            value: 336258.1,
          },
          {
            year: "2019",
            value: 502392.0914,
          },
          {
            year: "2020",
            value: 365951.6677,
          },
          {
            year: "2021",
            value: 302095.0,
          },
          {
            year: "2022",
            value: 451856.0,
          },
          {
            year: "2023",
            value: 379470.0,
          },
          {
            year: "2024",
            value: 364253.0179,
          },
        ],
      },
    },
    津巴布韦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 72688.0,
          },
          {
            year: "2017",
            value: 87203.0,
          },
          {
            year: "2018",
            value: 88962.6,
          },
          {
            year: "2019",
            value: 97392.5221,
          },
          {
            year: "2020",
            value: 87272.4102,
          },
          {
            year: "2021",
            value: 95854.0,
          },
          {
            year: "2022",
            value: 129931.0,
          },
          {
            year: "2023",
            value: 166168.0,
          },
          {
            year: "2024",
            value: 244654.1639,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 38772.2,
          },
          {
            year: "2017",
            value: 44381.9,
          },
          {
            year: "2018",
            value: 44567.6,
          },
          {
            year: "2019",
            value: 36880.4693,
          },
          {
            year: "2020",
            value: 52470.9936,
          },
          {
            year: "2021",
            value: 91946.0,
          },
          {
            year: "2022",
            value: 111554.0,
          },
          {
            year: "2023",
            value: 140713.0,
          },
          {
            year: "2024",
            value: 137222.1782,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 111460.2,
          },
          {
            year: "2017",
            value: 131584.9,
          },
          {
            year: "2018",
            value: 133530.2,
          },
          {
            year: "2019",
            value: 134272.9914,
          },
          {
            year: "2020",
            value: 139743.4038,
          },
          {
            year: "2021",
            value: 187800.0,
          },
          {
            year: "2022",
            value: 241485.0,
          },
          {
            year: "2023",
            value: 306882.0,
          },
          {
            year: "2024",
            value: 381876.3421,
          },
        ],
      },
    },
    喀麦隆: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 40223.0,
          },
          {
            year: "2017",
            value: 50850.3,
          },
          {
            year: "2018",
            value: 109535.0,
          },
          {
            year: "2019",
            value: 100968.0551,
          },
          {
            year: "2020",
            value: 76132.6749,
          },
          {
            year: "2021",
            value: 163669.0,
          },
          {
            year: "2022",
            value: 65597.0,
          },
          {
            year: "2023",
            value: 51703.0,
          },
          {
            year: "2024",
            value: 107648.1111,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 155725.0,
          },
          {
            year: "2017",
            value: 138861.1,
          },
          {
            year: "2018",
            value: 169422.0,
          },
          {
            year: "2019",
            value: 167016.9625,
          },
          {
            year: "2020",
            value: 202247.0054,
          },
          {
            year: "2021",
            value: 271399.0,
          },
          {
            year: "2022",
            value: 311692.0,
          },
          {
            year: "2023",
            value: 371428.0,
          },
          {
            year: "2024",
            value: 364333.539,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 195948.0,
          },
          {
            year: "2017",
            value: 189711.4,
          },
          {
            year: "2018",
            value: 278957.0,
          },
          {
            year: "2019",
            value: 267985.0176,
          },
          {
            year: "2020",
            value: 278379.6803,
          },
          {
            year: "2021",
            value: 435068.0,
          },
          {
            year: "2022",
            value: 377289.0,
          },
          {
            year: "2023",
            value: 423132.0,
          },
          {
            year: "2024",
            value: 471981.6501,
          },
        ],
      },
    },
    科摩罗: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1.3,
          },
          {
            year: "2017",
            value: 3.8,
          },
          {
            year: "2018",
            value: 2.8,
          },
          {
            year: "2019",
            value: 3.1723,
          },
          {
            year: "2020",
            value: 11.736,
          },
          {
            year: "2021",
            value: 11.0,
          },
          {
            year: "2022",
            value: 8.0,
          },
          {
            year: "2023",
            value: 6.5492,
          },
          {
            year: "2024",
            value: 22.4165,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 4839.7,
          },
          {
            year: "2017",
            value: 6775.8,
          },
          {
            year: "2018",
            value: 7919.6,
          },
          {
            year: "2019",
            value: 7368.4891,
          },
          {
            year: "2020",
            value: 5053.6987,
          },
          {
            year: "2021",
            value: 5695.0,
          },
          {
            year: "2022",
            value: 6523.0,
          },
          {
            year: "2023",
            value: 11101.4778,
          },
          {
            year: "2024",
            value: 9639.2855,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4841.0,
          },
          {
            year: "2017",
            value: 6779.6,
          },
          {
            year: "2018",
            value: 7922.4,
          },
          {
            year: "2019",
            value: 7371.6614,
          },
          {
            year: "2020",
            value: 5065.4347,
          },
          {
            year: "2021",
            value: 5706.0,
          },
          {
            year: "2022",
            value: 6530.0,
          },
          {
            year: "2023",
            value: 11107.0,
          },
          {
            year: "2024",
            value: 9661.702,
          },
        ],
      },
    },
    科特迪瓦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 10138.1,
          },
          {
            year: "2017",
            value: 15791.0,
          },
          {
            year: "2018",
            value: 25230.6,
          },
          {
            year: "2019",
            value: 45567.2627,
          },
          {
            year: "2020",
            value: 58047.141,
          },
          {
            year: "2021",
            value: 64158.0,
          },
          {
            year: "2022",
            value: 96792.0,
          },
          {
            year: "2023",
            value: 106845.0,
          },
          {
            year: "2024",
            value: 89823.2497,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 158468.5,
          },
          {
            year: "2017",
            value: 169254.5,
          },
          {
            year: "2018",
            value: 189178.9,
          },
          {
            year: "2019",
            value: 204156.9324,
          },
          {
            year: "2020",
            value: 233356.693,
          },
          {
            year: "2021",
            value: 312094.0,
          },
          {
            year: "2022",
            value: 343493.0,
          },
          {
            year: "2023",
            value: 420689.0,
          },
          {
            year: "2024",
            value: 415560.7249,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 168606.6,
          },
          {
            year: "2017",
            value: 185045.5,
          },
          {
            year: "2018",
            value: 214409.5,
          },
          {
            year: "2019",
            value: 249724.1951,
          },
          {
            year: "2020",
            value: 291403.834,
          },
          {
            year: "2021",
            value: 376252.0,
          },
          {
            year: "2022",
            value: 440285.0,
          },
          {
            year: "2023",
            value: 527533.0,
          },
          {
            year: "2024",
            value: 505383.9746,
          },
        ],
      },
    },
    肯尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 9713.5,
          },
          {
            year: "2017",
            value: 16682.0,
          },
          {
            year: "2018",
            value: 17375.8,
          },
          {
            year: "2019",
            value: 17890.6799,
          },
          {
            year: "2020",
            value: 15059.4884,
          },
          {
            year: "2021",
            value: 22578.0,
          },
          {
            year: "2022",
            value: 26900.0,
          },
          {
            year: "2023",
            value: 22766.0,
          },
          {
            year: "2024",
            value: 23749.3599,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 558800.3,
          },
          {
            year: "2017",
            value: 503465.0,
          },
          {
            year: "2018",
            value: 519720.1,
          },
          {
            year: "2019",
            value: 500926.6265,
          },
          {
            year: "2020",
            value: 540967.0062,
          },
          {
            year: "2021",
            value: 673209.0,
          },
          {
            year: "2022",
            value: 809778.0,
          },
          {
            year: "2023",
            value: 787562.0,
          },
          {
            year: "2024",
            value: 858249.2048,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 568513.8,
          },
          {
            year: "2017",
            value: 520147.0,
          },
          {
            year: "2018",
            value: 537095.9,
          },
          {
            year: "2019",
            value: 518817.3064,
          },
          {
            year: "2020",
            value: 556026.4946,
          },
          {
            year: "2021",
            value: 695787.0,
          },
          {
            year: "2022",
            value: 836678.0,
          },
          {
            year: "2023",
            value: 810328.0,
          },
          {
            year: "2024",
            value: 881998.5647,
          },
        ],
      },
    },
    莱索托: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1964.4,
          },
          {
            year: "2017",
            value: 2484.7,
          },
          {
            year: "2018",
            value: 3008.9,
          },
          {
            year: "2019",
            value: 3127.3538,
          },
          {
            year: "2020",
            value: 1226.2426,
          },
          {
            year: "2021",
            value: 2366.0,
          },
          {
            year: "2022",
            value: 2224.0,
          },
          {
            year: "2023",
            value: 2656.4023,
          },
          {
            year: "2024",
            value: 2930.9178,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 5471.9,
          },
          {
            year: "2017",
            value: 6130.1,
          },
          {
            year: "2018",
            value: 6413.9,
          },
          {
            year: "2019",
            value: 7203.3842,
          },
          {
            year: "2020",
            value: 5938.2361,
          },
          {
            year: "2021",
            value: 8444.0,
          },
          {
            year: "2022",
            value: 6018.0,
          },
          {
            year: "2023",
            value: 10286.3823,
          },
          {
            year: "2024",
            value: 12389.143,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 7436.3,
          },
          {
            year: "2017",
            value: 8614.8,
          },
          {
            year: "2018",
            value: 9422.8,
          },
          {
            year: "2019",
            value: 10330.738,
          },
          {
            year: "2020",
            value: 7164.4787,
          },
          {
            year: "2021",
            value: 10810.0,
          },
          {
            year: "2022",
            value: 8242.0,
          },
          {
            year: "2023",
            value: 12942.7846,
          },
          {
            year: "2024",
            value: 15320.0608,
          },
        ],
      },
    },
    利比里亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4817.1,
          },
          {
            year: "2017",
            value: 2885.7,
          },
          {
            year: "2018",
            value: 8927.0,
          },
          {
            year: "2019",
            value: 12385.4379,
          },
          {
            year: "2020",
            value: 9734.4331,
          },
          {
            year: "2021",
            value: 2377.0,
          },
          {
            year: "2022",
            value: 1500.0,
          },
          {
            year: "2023",
            value: 8296.0,
          },
          {
            year: "2024",
            value: 10559.4921,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 159269.3,
          },
          {
            year: "2017",
            value: 210367.1,
          },
          {
            year: "2018",
            value: 195448.2,
          },
          {
            year: "2019",
            value: 390225.4816,
          },
          {
            year: "2020",
            value: 340140.89,
          },
          {
            year: "2021",
            value: 568801.0,
          },
          {
            year: "2022",
            value: 751512.0,
          },
          {
            year: "2023",
            value: 983590.0,
          },
          {
            year: "2024",
            value: 1306152.3994,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 164086.4,
          },
          {
            year: "2017",
            value: 213252.8,
          },
          {
            year: "2018",
            value: 204375.2,
          },
          {
            year: "2019",
            value: 402610.9195,
          },
          {
            year: "2020",
            value: 349875.3231,
          },
          {
            year: "2021",
            value: 571178.0,
          },
          {
            year: "2022",
            value: 753012.0,
          },
          {
            year: "2023",
            value: 991887.0,
          },
          {
            year: "2024",
            value: 1316711.8915,
          },
        ],
      },
    },
    利比亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 34562.0,
          },
          {
            year: "2017",
            value: 136265.8,
          },
          {
            year: "2018",
            value: 477918.1,
          },
          {
            year: "2019",
            value: 481649.711,
          },
          {
            year: "2020",
            value: 82706.5454,
          },
          {
            year: "2021",
            value: 327538.0,
          },
          {
            year: "2022",
            value: 293674.0,
          },
          {
            year: "2023",
            value: 219994.0,
          },
          {
            year: "2024",
            value: 116103.0028,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 118475.5,
          },
          {
            year: "2017",
            value: 102797.0,
          },
          {
            year: "2018",
            value: 142823.3,
          },
          {
            year: "2019",
            value: 245159.2741,
          },
          {
            year: "2020",
            value: 188045.0774,
          },
          {
            year: "2021",
            value: 212903.0,
          },
          {
            year: "2022",
            value: 233863.0,
          },
          {
            year: "2023",
            value: 390060.0,
          },
          {
            year: "2024",
            value: 358523.1623,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 153037.5,
          },
          {
            year: "2017",
            value: 239062.8,
          },
          {
            year: "2018",
            value: 620741.4,
          },
          {
            year: "2019",
            value: 726808.9851,
          },
          {
            year: "2020",
            value: 270751.6228,
          },
          {
            year: "2021",
            value: 540441.0,
          },
          {
            year: "2022",
            value: 527538.0,
          },
          {
            year: "2023",
            value: 610054.0,
          },
          {
            year: "2024",
            value: 474626.1651,
          },
        ],
      },
    },
    卢旺达: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3314.0,
          },
          {
            year: "2017",
            value: 2887.9,
          },
          {
            year: "2018",
            value: 3932.7,
          },
          {
            year: "2019",
            value: 3500.6511,
          },
          {
            year: "2020",
            value: 3820.9405,
          },
          {
            year: "2021",
            value: 2872.0,
          },
          {
            year: "2022",
            value: 7047.0,
          },
          {
            year: "2023",
            value: 13114.0,
          },
          {
            year: "2024",
            value: 16061.4278,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 10860.3,
          },
          {
            year: "2017",
            value: 12866.9,
          },
          {
            year: "2018",
            value: 16559.0,
          },
          {
            year: "2019",
            value: 26507.4997,
          },
          {
            year: "2020",
            value: 28252.2921,
          },
          {
            year: "2021",
            value: 33514.0,
          },
          {
            year: "2022",
            value: 40407.0,
          },
          {
            year: "2023",
            value: 42069.0,
          },
          {
            year: "2024",
            value: 50911.8266,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 14174.3,
          },
          {
            year: "2017",
            value: 15754.8,
          },
          {
            year: "2018",
            value: 20491.7,
          },
          {
            year: "2019",
            value: 30008.1508,
          },
          {
            year: "2020",
            value: 32073.2326,
          },
          {
            year: "2021",
            value: 36386.0,
          },
          {
            year: "2022",
            value: 47454.0,
          },
          {
            year: "2023",
            value: 55183.0,
          },
          {
            year: "2024",
            value: 66973.2544,
          },
        ],
      },
    },
    马达加斯加: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16079.3,
          },
          {
            year: "2017",
            value: 22709.3,
          },
          {
            year: "2018",
            value: 20005.6,
          },
          {
            year: "2019",
            value: 20436.1765,
          },
          {
            year: "2020",
            value: 13865.1863,
          },
          {
            year: "2021",
            value: 33274.0,
          },
          {
            year: "2022",
            value: 62661.0,
          },
          {
            year: "2023",
            value: 28257.0,
          },
          {
            year: "2024",
            value: 26591.645,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 94314.1,
          },
          {
            year: "2017",
            value: 100748.7,
          },
          {
            year: "2018",
            value: 101007.7,
          },
          {
            year: "2019",
            value: 107254.644,
          },
          {
            year: "2020",
            value: 99765.4255,
          },
          {
            year: "2021",
            value: 128318.0,
          },
          {
            year: "2022",
            value: 143100.0,
          },
          {
            year: "2023",
            value: 138638.0,
          },
          {
            year: "2024",
            value: 141404.6852,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 110393.4,
          },
          {
            year: "2017",
            value: 123458.0,
          },
          {
            year: "2018",
            value: 121013.3,
          },
          {
            year: "2019",
            value: 127690.8205,
          },
          {
            year: "2020",
            value: 113630.6118,
          },
          {
            year: "2021",
            value: 161592.0,
          },
          {
            year: "2022",
            value: 205761.0,
          },
          {
            year: "2023",
            value: 166895.0,
          },
          {
            year: "2024",
            value: 167996.3302,
          },
        ],
      },
    },
    马拉维: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2611.7,
          },
          {
            year: "2017",
            value: 2732.6,
          },
          {
            year: "2018",
            value: 2735.6,
          },
          {
            year: "2019",
            value: 1570.9429,
          },
          {
            year: "2020",
            value: 1233.2333,
          },
          {
            year: "2021",
            value: 981.0,
          },
          {
            year: "2022",
            value: 1261.0,
          },
          {
            year: "2023",
            value: 1421.1309,
          },
          {
            year: "2024",
            value: 1435.4802,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 22828.3,
          },
          {
            year: "2017",
            value: 26194.4,
          },
          {
            year: "2018",
            value: 22160.2,
          },
          {
            year: "2019",
            value: 26004.8133,
          },
          {
            year: "2020",
            value: 21849.1409,
          },
          {
            year: "2021",
            value: 28053.0,
          },
          {
            year: "2022",
            value: 27724.0,
          },
          {
            year: "2023",
            value: 22536.0,
          },
          {
            year: "2024",
            value: 25164.2615,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 25440.0,
          },
          {
            year: "2017",
            value: 28927.0,
          },
          {
            year: "2018",
            value: 24895.8,
          },
          {
            year: "2019",
            value: 27575.7562,
          },
          {
            year: "2020",
            value: 23082.3742,
          },
          {
            year: "2021",
            value: 29034.0,
          },
          {
            year: "2022",
            value: 28985.0,
          },
          {
            year: "2023",
            value: 23957.0,
          },
          {
            year: "2024",
            value: 26599.7417,
          },
        ],
      },
    },
    马里: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 9870.1,
          },
          {
            year: "2017",
            value: 6787.7,
          },
          {
            year: "2018",
            value: 8850.9,
          },
          {
            year: "2019",
            value: 16030.1461,
          },
          {
            year: "2020",
            value: 16865.233,
          },
          {
            year: "2021",
            value: 12755.0,
          },
          {
            year: "2022",
            value: 8765.0,
          },
          {
            year: "2023",
            value: 7840.0,
          },
          {
            year: "2024",
            value: 7296.6703,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 36672.7,
          },
          {
            year: "2017",
            value: 33724.8,
          },
          {
            year: "2018",
            value: 34550.6,
          },
          {
            year: "2019",
            value: 43510.113,
          },
          {
            year: "2020",
            value: 46844.0643,
          },
          {
            year: "2021",
            value: 59489.0,
          },
          {
            year: "2022",
            value: 57800.0,
          },
          {
            year: "2023",
            value: 80288.0,
          },
          {
            year: "2024",
            value: 100510.5478,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 46542.8,
          },
          {
            year: "2017",
            value: 40512.5,
          },
          {
            year: "2018",
            value: 43401.5,
          },
          {
            year: "2019",
            value: 59540.2591,
          },
          {
            year: "2020",
            value: 63709.2973,
          },
          {
            year: "2021",
            value: 72244.0,
          },
          {
            year: "2022",
            value: 66565.0,
          },
          {
            year: "2023",
            value: 88128.0,
          },
          {
            year: "2024",
            value: 107807.2181,
          },
        ],
      },
    },
    摩洛哥: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 55345.7,
          },
          {
            year: "2017",
            value: 65059.7,
          },
          {
            year: "2018",
            value: 70690.0,
          },
          {
            year: "2019",
            value: 63334.6602,
          },
          {
            year: "2020",
            value: 59561.1279,
          },
          {
            year: "2021",
            value: 82642.0,
          },
          {
            year: "2022",
            value: 90902.0,
          },
          {
            year: "2023",
            value: 97928.0,
          },
          {
            year: "2024",
            value: 129914.1752,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 307918.0,
          },
          {
            year: "2017",
            value: 317622.6,
          },
          {
            year: "2018",
            value: 368091.3,
          },
          {
            year: "2019",
            value: 403454.4667,
          },
          {
            year: "2020",
            value: 417358.1434,
          },
          {
            year: "2021",
            value: 568974.0,
          },
          {
            year: "2022",
            value: 566332.0,
          },
          {
            year: "2023",
            value: 645215.0,
          },
          {
            year: "2024",
            value: 773833.303,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 363263.7,
          },
          {
            year: "2017",
            value: 382682.3,
          },
          {
            year: "2018",
            value: 438781.3,
          },
          {
            year: "2019",
            value: 466789.1269,
          },
          {
            year: "2020",
            value: 476919.2713,
          },
          {
            year: "2021",
            value: 651616.0,
          },
          {
            year: "2022",
            value: 657233.0,
          },
          {
            year: "2023",
            value: 743143.0,
          },
          {
            year: "2024",
            value: 903747.4782,
          },
        ],
      },
    },
    莫桑比克: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 47935.7,
          },
          {
            year: "2017",
            value: 52871.5,
          },
          {
            year: "2018",
            value: 63353.4,
          },
          {
            year: "2019",
            value: 71324.1603,
          },
          {
            year: "2020",
            value: 57949.8619,
          },
          {
            year: "2021",
            value: 114457.0,
          },
          {
            year: "2022",
            value: 133806.0,
          },
          {
            year: "2023",
            value: 177258.0,
          },
          {
            year: "2024",
            value: 180957.2297,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 130871.1,
          },
          {
            year: "2017",
            value: 130674.6,
          },
          {
            year: "2018",
            value: 186178.1,
          },
          {
            year: "2019",
            value: 195769.5041,
          },
          {
            year: "2020",
            value: 200009.3836,
          },
          {
            year: "2021",
            value: 289561.0,
          },
          {
            year: "2022",
            value: 321870.0,
          },
          {
            year: "2023",
            value: 371425.0,
          },
          {
            year: "2024",
            value: 338370.814,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 178806.8,
          },
          {
            year: "2017",
            value: 183546.1,
          },
          {
            year: "2018",
            value: 249531.5,
          },
          {
            year: "2019",
            value: 267093.6644,
          },
          {
            year: "2020",
            value: 257959.2455,
          },
          {
            year: "2021",
            value: 404018.0,
          },
          {
            year: "2022",
            value: 455676.0,
          },
          {
            year: "2023",
            value: 548683.0,
          },
          {
            year: "2024",
            value: 519328.0437,
          },
        ],
      },
    },
    纳米比亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16578.5,
          },
          {
            year: "2017",
            value: 29754.1,
          },
          {
            year: "2018",
            value: 50292.3,
          },
          {
            year: "2019",
            value: 51128.1131,
          },
          {
            year: "2020",
            value: 56288.5348,
          },
          {
            year: "2021",
            value: 73460.0,
          },
          {
            year: "2022",
            value: 59391.0,
          },
          {
            year: "2023",
            value: 74781.0,
          },
          {
            year: "2024",
            value: 83315.6941,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 26868.6,
          },
          {
            year: "2017",
            value: 27214.1,
          },
          {
            year: "2018",
            value: 32371.1,
          },
          {
            year: "2019",
            value: 19817.3902,
          },
          {
            year: "2020",
            value: 22311.1836,
          },
          {
            year: "2021",
            value: 40157.0,
          },
          {
            year: "2022",
            value: 54803.0,
          },
          {
            year: "2023",
            value: 55722.0,
          },
          {
            year: "2024",
            value: 53317.4746,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 43447.1,
          },
          {
            year: "2017",
            value: 56968.2,
          },
          {
            year: "2018",
            value: 82663.4,
          },
          {
            year: "2019",
            value: 70945.5033,
          },
          {
            year: "2020",
            value: 78599.7184,
          },
          {
            year: "2021",
            value: 113617.0,
          },
          {
            year: "2022",
            value: 114194.0,
          },
          {
            year: "2023",
            value: 130503.0,
          },
          {
            year: "2024",
            value: 136633.1687,
          },
        ],
      },
    },
    南非: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2222889.4,
          },
          {
            year: "2017",
            value: 2438859.6,
          },
          {
            year: "2018",
            value: 2728748.9,
          },
          {
            year: "2019",
            value: 2594885.5607,
          },
          {
            year: "2020",
            value: 2082480.0475,
          },
          {
            year: "2021",
            value: 3295561.0,
          },
          {
            year: "2022",
            value: 3244557.0,
          },
          {
            year: "2023",
            value: 3199187.0,
          },
          {
            year: "2024",
            value: 3064321.6567,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1285352.2,
          },
          {
            year: "2017",
            value: 1480876.7,
          },
          {
            year: "2018",
            value: 1624838.1,
          },
          {
            year: "2019",
            value: 1654294.1878,
          },
          {
            year: "2020",
            value: 1523886.9801,
          },
          {
            year: "2021",
            value: 2111525.0,
          },
          {
            year: "2022",
            value: 2398386.0,
          },
          {
            year: "2023",
            value: 2364768.0,
          },
          {
            year: "2024",
            value: 2181367.6476,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 3508241.6,
          },
          {
            year: "2017",
            value: 3919736.3,
          },
          {
            year: "2018",
            value: 4353587.0,
          },
          {
            year: "2019",
            value: 4249179.7485,
          },
          {
            year: "2020",
            value: 3606367.0276,
          },
          {
            year: "2021",
            value: 5370000.0,
          },
          {
            year: "2022",
            value: 5642942.0,
          },
          {
            year: "2023",
            value: 5563955.0,
          },
          {
            year: "2024",
            value: 5245689.3043,
          },
        ],
      },
    },
    南苏丹: {
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 150602.5,
          },
          {
            year: "2017",
            value: 132199.2,
          },
          {
            year: "2018",
            value: 168130.1,
          },
          {
            year: "2019",
            value: 165544.5254,
          },
          {
            year: "2020",
            value: 83932.4569,
          },
          {
            year: "2021",
            value: 43923.0,
          },
          {
            year: "2022",
            value: 39257.0,
          },
          {
            year: "2023",
            value: 51570.0,
          },
          {
            year: "2024",
            value: 46619.5114,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 4627.4,
          },
          {
            year: "2017",
            value: 5194.2,
          },
          {
            year: "2018",
            value: 7716.5,
          },
          {
            year: "2019",
            value: 12224.2186,
          },
          {
            year: "2020",
            value: 15608.2888,
          },
          {
            year: "2021",
            value: 13982.0,
          },
          {
            year: "2022",
            value: 15559.0,
          },
          {
            year: "2023",
            value: 16085.0,
          },
          {
            year: "2024",
            value: 16622.3159,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 145975.1,
          },
          {
            year: "2017",
            value: 127005.0,
          },
          {
            year: "2018",
            value: 160413.6,
          },
          {
            year: "2019",
            value: 153320.3068,
          },
          {
            year: "2020",
            value: 68324.1681,
          },
          {
            year: "2021",
            value: 29941.0,
          },
          {
            year: "2022",
            value: 23697.0,
          },
          {
            year: "2023",
            value: 35485.0,
          },
          {
            year: "2024",
            value: 29997.1955,
          },
        ],
      },
    },
    尼日尔: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 10080.3,
          },
          {
            year: "2017",
            value: 9787.6,
          },
          {
            year: "2018",
            value: 11625.7,
          },
          {
            year: "2019",
            value: 28733.509,
          },
          {
            year: "2020",
            value: 30313.4674,
          },
          {
            year: "2021",
            value: 39159.0,
          },
          {
            year: "2022",
            value: 67428.0,
          },
          {
            year: "2023",
            value: 32443.7559,
          },
          {
            year: "2024",
            value: 23214.2923,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 22503.9,
          },
          {
            year: "2017",
            value: 19695.5,
          },
          {
            year: "2018",
            value: 28737.0,
          },
          {
            year: "2019",
            value: 51120.3347,
          },
          {
            year: "2020",
            value: 52783.081,
          },
          {
            year: "2021",
            value: 76097.0,
          },
          {
            year: "2022",
            value: 99199.0,
          },
          {
            year: "2023",
            value: 63617.0488,
          },
          {
            year: "2024",
            value: 83627.0635,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 12423.6,
          },
          {
            year: "2017",
            value: 9907.9,
          },
          {
            year: "2018",
            value: 17111.3,
          },
          {
            year: "2019",
            value: 22386.8257,
          },
          {
            year: "2020",
            value: 22469.6136,
          },
          {
            year: "2021",
            value: 36938.0,
          },
          {
            year: "2022",
            value: 31771.0,
          },
          {
            year: "2023",
            value: 31173.2929,
          },
          {
            year: "2024",
            value: 60412.7712,
          },
        ],
      },
    },
    尼日利亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 90700.8,
          },
          {
            year: "2017",
            value: 162405.0,
          },
          {
            year: "2018",
            value: 185309.2,
          },
          {
            year: "2019",
            value: 265637.4985,
          },
          {
            year: "2020",
            value: 248536.3217,
          },
          {
            year: "2021",
            value: 303163.0,
          },
          {
            year: "2022",
            value: 159721.0,
          },
          {
            year: "2023",
            value: 237414.0,
          },
          {
            year: "2024",
            value: 298567.9722,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 971532.8,
          },
          {
            year: "2017",
            value: 1215316.1,
          },
          {
            year: "2018",
            value: 1340478.2,
          },
          {
            year: "2019",
            value: 1662261.502,
          },
          {
            year: "2020",
            value: 1678750.9471,
          },
          {
            year: "2021",
            value: 2263626.0,
          },
          {
            year: "2022",
            value: 2197687.0,
          },
          {
            year: "2023",
            value: 2017313.0,
          },
          {
            year: "2024",
            value: 1889906.1234,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1062233.6,
          },
          {
            year: "2017",
            value: 1377721.1,
          },
          {
            year: "2018",
            value: 1525787.4,
          },
          {
            year: "2019",
            value: 1927899.0005,
          },
          {
            year: "2020",
            value: 1927287.2688,
          },
          {
            year: "2021",
            value: 2566789.0,
          },
          {
            year: "2022",
            value: 2357408.0,
          },
          {
            year: "2023",
            value: 2254727.0,
          },
          {
            year: "2024",
            value: 2188474.0956,
          },
        ],
      },
    },
    塞拉利昂: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 24219.5,
          },
          {
            year: "2017",
            value: 24243.1,
          },
          {
            year: "2018",
            value: 25302.2,
          },
          {
            year: "2019",
            value: 31354.0796,
          },
          {
            year: "2020",
            value: 37137.2677,
          },
          {
            year: "2021",
            value: 48920.0,
          },
          {
            year: "2022",
            value: 55859.0,
          },
          {
            year: "2023",
            value: 61126.0,
          },
          {
            year: "2024",
            value: 81126.807,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 48175.1,
          },
          {
            year: "2017",
            value: 58044.9,
          },
          {
            year: "2018",
            value: 43016.6,
          },
          {
            year: "2019",
            value: 50743.5307,
          },
          {
            year: "2020",
            value: 52986.4199,
          },
          {
            year: "2021",
            value: 87844.0,
          },
          {
            year: "2022",
            value: 132300.0,
          },
          {
            year: "2023",
            value: 164732.0,
          },
          {
            year: "2024",
            value: 176692.3673,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 23955.6,
          },
          {
            year: "2017",
            value: 33801.8,
          },
          {
            year: "2018",
            value: 17714.4,
          },
          {
            year: "2019",
            value: 19389.4511,
          },
          {
            year: "2020",
            value: 15849.1522,
          },
          {
            year: "2021",
            value: 38924.0,
          },
          {
            year: "2022",
            value: 76440.0,
          },
          {
            year: "2023",
            value: 103607.0,
          },
          {
            year: "2024",
            value: 95565.5603,
          },
        ],
      },
    },
    塞内加尔: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16158.9,
          },
          {
            year: "2017",
            value: 14969.9,
          },
          {
            year: "2018",
            value: 12859.8,
          },
          {
            year: "2019",
            value: 30078.5809,
          },
          {
            year: "2020",
            value: 31509.2417,
          },
          {
            year: "2021",
            value: 43951.0,
          },
          {
            year: "2022",
            value: 26858.0,
          },
          {
            year: "2023",
            value: 34124.0,
          },
          {
            year: "2024",
            value: 108826.2484,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 219449.8,
          },
          {
            year: "2017",
            value: 204071.3,
          },
          {
            year: "2018",
            value: 214285.1,
          },
          {
            year: "2019",
            value: 221102.2084,
          },
          {
            year: "2020",
            value: 256400.5017,
          },
          {
            year: "2021",
            value: 335306.0,
          },
          {
            year: "2022",
            value: 399130.0,
          },
          {
            year: "2023",
            value: 522805.0,
          },
          {
            year: "2024",
            value: 473439.5065,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 235608.7,
          },
          {
            year: "2017",
            value: 219041.2,
          },
          {
            year: "2018",
            value: 227144.9,
          },
          {
            year: "2019",
            value: 251180.7893,
          },
          {
            year: "2020",
            value: 287909.7434,
          },
          {
            year: "2021",
            value: 379257.0,
          },
          {
            year: "2022",
            value: 425988.0,
          },
          {
            year: "2023",
            value: 556929.0,
          },
          {
            year: "2024",
            value: 582265.7549,
          },
        ],
      },
    },
    塞舌尔: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 7.5,
          },
          {
            year: "2017",
            value: 147.4,
          },
          {
            year: "2018",
            value: 2.5,
          },
          {
            year: "2019",
            value: 6.8601,
          },
          {
            year: "2020",
            value: 3.7621,
          },
          {
            year: "2021",
            value: 1.0,
          },
          {
            year: "2022",
            value: 7.0,
          },
          {
            year: "2023",
            value: 484.6194,
          },
          {
            year: "2024",
            value: 20.6712,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 5572.8,
          },
          {
            year: "2017",
            value: 4882.4,
          },
          {
            year: "2018",
            value: 6132.7,
          },
          {
            year: "2019",
            value: 6564.6954,
          },
          {
            year: "2020",
            value: 5766.9983,
          },
          {
            year: "2021",
            value: 6865.0,
          },
          {
            year: "2022",
            value: 9243.0,
          },
          {
            year: "2023",
            value: 9935.4979,
          },
          {
            year: "2024",
            value: 8420.8028,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 5580.3,
          },
          {
            year: "2017",
            value: 5029.8,
          },
          {
            year: "2018",
            value: 6135.2,
          },
          {
            year: "2019",
            value: 6571.5555,
          },
          {
            year: "2020",
            value: 5770.7604,
          },
          {
            year: "2021",
            value: 6866.0,
          },
          {
            year: "2022",
            value: 9250.0,
          },
          {
            year: "2023",
            value: 10420.1173,
          },
          {
            year: "2024",
            value: 8441.474,
          },
        ],
      },
    },
    圣多美和普林西比: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 640.5,
          },
          {
            year: "2017",
            value: 690.2,
          },
          {
            year: "2018",
            value: 725.5,
          },
          {
            year: "2019",
            value: 892.0559,
          },
          {
            year: "2020",
            value: 2031.3472,
          },
          {
            year: "2021",
            value: 1494.0,
          },
          {
            year: "2022",
            value: 1528.0,
          },
          {
            year: "2023",
            value: 1156.4851,
          },
          {
            year: "2024",
            value: 2092.2118,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 642.3,
          },
          {
            year: "2017",
            value: 690.3,
          },
          {
            year: "2018",
            value: 730.4,
          },
          {
            year: "2019",
            value: 893.4279,
          },
          {
            year: "2020",
            value: 2036.0128,
          },
          {
            year: "2021",
            value: 1507.0,
          },
          {
            year: "2022",
            value: 1543.0,
          },
          {
            year: "2023",
            value: 1163.4195,
          },
          {
            year: "2024",
            value: 2093.9601,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1.8,
          },
          {
            year: "2017",
            value: 0.1,
          },
          {
            year: "2018",
            value: 4.9,
          },
          {
            year: "2019",
            value: 1.372,
          },
          {
            year: "2020",
            value: 4.6656,
          },
          {
            year: "2021",
            value: 13.0,
          },
          {
            year: "2022",
            value: 15.0,
          },
          {
            year: "2023",
            value: 6.9344,
          },
          {
            year: "2024",
            value: 1.7483,
          },
        ],
      },
    },
    苏丹: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 50470.6,
          },
          {
            year: "2017",
            value: 59079.8,
          },
          {
            year: "2018",
            value: 66516.6,
          },
          {
            year: "2019",
            value: 74355.2825,
          },
          {
            year: "2020",
            value: 76629.5393,
          },
          {
            year: "2021",
            value: 77980.0,
          },
          {
            year: "2022",
            value: 87730.0,
          },
          {
            year: "2023",
            value: 88194.0,
          },
          {
            year: "2024",
            value: 56087.0982,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 212984.2,
          },
          {
            year: "2017",
            value: 222176.0,
          },
          {
            year: "2018",
            value: 188040.2,
          },
          {
            year: "2019",
            value: 228968.1192,
          },
          {
            year: "2020",
            value: 251145.3095,
          },
          {
            year: "2021",
            value: 181639.0,
          },
          {
            year: "2022",
            value: 200539.0,
          },
          {
            year: "2023",
            value: 128848.4663,
          },
          {
            year: "2024",
            value: 83298.4117,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 263454.8,
          },
          {
            year: "2017",
            value: 281255.8,
          },
          {
            year: "2018",
            value: 254556.8,
          },
          {
            year: "2019",
            value: 303323.4017,
          },
          {
            year: "2020",
            value: 327774.8488,
          },
          {
            year: "2021",
            value: 259619.0,
          },
          {
            year: "2022",
            value: 288269.0,
          },
          {
            year: "2023",
            value: 217042.0,
          },
          {
            year: "2024",
            value: 139385.5099,
          },
        ],
      },
    },
    索马里: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1095.8,
          },
          {
            year: "2017",
            value: 1180.3,
          },
          {
            year: "2018",
            value: 1655.2,
          },
          {
            year: "2019",
            value: 1869.7707,
          },
          {
            year: "2020",
            value: 787.1903,
          },
          {
            year: "2021",
            value: 1078.0,
          },
          {
            year: "2022",
            value: 738.0,
          },
          {
            year: "2023",
            value: 671.5359,
          },
          {
            year: "2024",
            value: 311.4506,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 39195.8,
          },
          {
            year: "2017",
            value: 47350.0,
          },
          {
            year: "2018",
            value: 63545.2,
          },
          {
            year: "2019",
            value: 73138.1515,
          },
          {
            year: "2020",
            value: 89258.4586,
          },
          {
            year: "2021",
            value: 99971.0,
          },
          {
            year: "2022",
            value: 102427.0,
          },
          {
            year: "2023",
            value: 101304.0,
          },
          {
            year: "2024",
            value: 96843.5932,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 40291.6,
          },
          {
            year: "2017",
            value: 48530.3,
          },
          {
            year: "2018",
            value: 65200.4,
          },
          {
            year: "2019",
            value: 75007.9222,
          },
          {
            year: "2020",
            value: 90045.6489,
          },
          {
            year: "2021",
            value: 101049.0,
          },
          {
            year: "2022",
            value: 103165.0,
          },
          {
            year: "2023",
            value: 101976.4534,
          },
          {
            year: "2024",
            value: 97155.0438,
          },
        ],
      },
    },
    坦桑尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 31582.7,
          },
          {
            year: "2017",
            value: 33585.9,
          },
          {
            year: "2018",
            value: 39125.5,
          },
          {
            year: "2019",
            value: 35973.3387,
          },
          {
            year: "2020",
            value: 41111.8015,
          },
          {
            year: "2021",
            value: 60378.0,
          },
          {
            year: "2022",
            value: 53687.0,
          },
          {
            year: "2023",
            value: 68859.0,
          },
          {
            year: "2024",
            value: 70364.1266,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 356711.7,
          },
          {
            year: "2017",
            value: 311955.4,
          },
          {
            year: "2018",
            value: 358314.0,
          },
          {
            year: "2019",
            value: 381141.6296,
          },
          {
            year: "2020",
            value: 417436.8632,
          },
          {
            year: "2021",
            value: 613670.0,
          },
          {
            year: "2022",
            value: 764002.0,
          },
          {
            year: "2023",
            value: 808856.0,
          },
          {
            year: "2024",
            value: 817458.2869,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 388294.4,
          },
          {
            year: "2017",
            value: 345541.3,
          },
          {
            year: "2018",
            value: 397439.5,
          },
          {
            year: "2019",
            value: 417114.9683,
          },
          {
            year: "2020",
            value: 458548.6647,
          },
          {
            year: "2021",
            value: 674048.0,
          },
          {
            year: "2022",
            value: 817688.0,
          },
          {
            year: "2023",
            value: 877716.0,
          },
          {
            year: "2024",
            value: 887822.4135,
          },
        ],
      },
    },
    突尼斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 13884.7,
          },
          {
            year: "2017",
            value: 19816.3,
          },
          {
            year: "2018",
            value: 19507.7,
          },
          {
            year: "2019",
            value: 20910.4831,
          },
          {
            year: "2020",
            value: 22271.7951,
          },
          {
            year: "2021",
            value: 28272.0,
          },
          {
            year: "2022",
            value: 25455.0,
          },
          {
            year: "2023",
            value: 24522.0,
          },
          {
            year: "2024",
            value: 50535.6505,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 129612.7,
          },
          {
            year: "2017",
            value: 132798.7,
          },
          {
            year: "2018",
            value: 141460.0,
          },
          {
            year: "2019",
            value: 136420.1748,
          },
          {
            year: "2020",
            value: 142768.5759,
          },
          {
            year: "2021",
            value: 186563.0,
          },
          {
            year: "2022",
            value: 186967.0,
          },
          {
            year: "2023",
            value: 202452.0,
          },
          {
            year: "2024",
            value: 237675.9926,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 143497.4,
          },
          {
            year: "2017",
            value: 152615.0,
          },
          {
            year: "2018",
            value: 160967.7,
          },
          {
            year: "2019",
            value: 157330.6579,
          },
          {
            year: "2020",
            value: 165040.371,
          },
          {
            year: "2021",
            value: 214835.0,
          },
          {
            year: "2022",
            value: 212423.0,
          },
          {
            year: "2023",
            value: 226975.0,
          },
          {
            year: "2024",
            value: 288211.6431,
          },
        ],
      },
    },
    乌干达: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3761.7,
          },
          {
            year: "2017",
            value: 3341.3,
          },
          {
            year: "2018",
            value: 4622.4,
          },
          {
            year: "2019",
            value: 4159.2741,
          },
          {
            year: "2020",
            value: 3969.232,
          },
          {
            year: "2021",
            value: 4390.0,
          },
          {
            year: "2022",
            value: 5826.0,
          },
          {
            year: "2023",
            value: 6966.8056,
          },
          {
            year: "2024",
            value: 7930.7293,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 82390.1,
          },
          {
            year: "2017",
            value: 77736.7,
          },
          {
            year: "2018",
            value: 70639.6,
          },
          {
            year: "2019",
            value: 74064.8831,
          },
          {
            year: "2020",
            value: 79028.7287,
          },
          {
            year: "2021",
            value: 102295.0,
          },
          {
            year: "2022",
            value: 106647.0,
          },
          {
            year: "2023",
            value: 123502.0,
          },
          {
            year: "2024",
            value: 138378.2268,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 86151.8,
          },
          {
            year: "2017",
            value: 81078.0,
          },
          {
            year: "2018",
            value: 75262.0,
          },
          {
            year: "2019",
            value: 78224.1572,
          },
          {
            year: "2020",
            value: 82997.9607,
          },
          {
            year: "2021",
            value: 106685.0,
          },
          {
            year: "2022",
            value: 112473.0,
          },
          {
            year: "2023",
            value: 130469.0,
          },
          {
            year: "2024",
            value: 146308.9561,
          },
        ],
      },
    },
    赞比亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 218350.1,
          },
          {
            year: "2017",
            value: 312275.4,
          },
          {
            year: "2018",
            value: 408285.0,
          },
          {
            year: "2019",
            value: 326454.1815,
          },
          {
            year: "2020",
            value: 350604.3957,
          },
          {
            year: "2021",
            value: 439136.0,
          },
          {
            year: "2022",
            value: 572923.0,
          },
          {
            year: "2023",
            value: 429983.0,
          },
          {
            year: "2024",
            value: 527331.4489,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 49021.7,
          },
          {
            year: "2017",
            value: 70946.8,
          },
          {
            year: "2018",
            value: 96949.1,
          },
          {
            year: "2019",
            value: 97034.892,
          },
          {
            year: "2020",
            value: 68135.047,
          },
          {
            year: "2021",
            value: 78085.0,
          },
          {
            year: "2022",
            value: 97164.0,
          },
          {
            year: "2023",
            value: 99878.0,
          },
          {
            year: "2024",
            value: 140798.5139,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 267371.8,
          },
          {
            year: "2017",
            value: 383222.2,
          },
          {
            year: "2018",
            value: 505234.1,
          },
          {
            year: "2019",
            value: 423489.0735,
          },
          {
            year: "2020",
            value: 418739.4427,
          },
          {
            year: "2021",
            value: 517221.0,
          },
          {
            year: "2022",
            value: 670087.0,
          },
          {
            year: "2023",
            value: 529861.0,
          },
          {
            year: "2024",
            value: 668129.9628,
          },
        ],
      },
    },
    乍得: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 11490.8,
          },
          {
            year: "2017",
            value: 27991.4,
          },
          {
            year: "2018",
            value: 9594.5,
          },
          {
            year: "2019",
            value: 45275.0775,
          },
          {
            year: "2020",
            value: 42147.1363,
          },
          {
            year: "2021",
            value: 19680.0,
          },
          {
            year: "2022",
            value: 108624.0,
          },
          {
            year: "2023",
            value: 82340.0,
          },
          {
            year: "2024",
            value: 75812.1345,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 9358.7,
          },
          {
            year: "2017",
            value: 11536.4,
          },
          {
            year: "2018",
            value: 18458.5,
          },
          {
            year: "2019",
            value: 27910.6802,
          },
          {
            year: "2020",
            value: 29832.0679,
          },
          {
            year: "2021",
            value: 36527.0,
          },
          {
            year: "2022",
            value: 28115.0,
          },
          {
            year: "2023",
            value: 37771.0,
          },
          {
            year: "2024",
            value: 37483.803,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 20849.5,
          },
          {
            year: "2017",
            value: 39527.8,
          },
          {
            year: "2018",
            value: 28053.0,
          },
          {
            year: "2019",
            value: 73185.7577,
          },
          {
            year: "2020",
            value: 71979.2042,
          },
          {
            year: "2021",
            value: 56207.0,
          },
          {
            year: "2022",
            value: 136739.0,
          },
          {
            year: "2023",
            value: 120111.0,
          },
          {
            year: "2024",
            value: 113295.9375,
          },
        ],
      },
    },
    中非: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3156.5,
          },
          {
            year: "2017",
            value: 2810.8,
          },
          {
            year: "2018",
            value: 5425.0,
          },
          {
            year: "2019",
            value: 3620.18,
          },
          {
            year: "2020",
            value: 5707.5172,
          },
          {
            year: "2021",
            value: 3607.0,
          },
          {
            year: "2022",
            value: 2503.0,
          },
          {
            year: "2023",
            value: 2872.841,
          },
          {
            year: "2024",
            value: 3309.4421,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1547.3,
          },
          {
            year: "2017",
            value: 1296.2,
          },
          {
            year: "2018",
            value: 1893.7,
          },
          {
            year: "2019",
            value: 2566.0365,
          },
          {
            year: "2020",
            value: 2796.3792,
          },
          {
            year: "2021",
            value: 4553.0,
          },
          {
            year: "2022",
            value: 5206.0,
          },
          {
            year: "2023",
            value: 5456.4867,
          },
          {
            year: "2024",
            value: 6160.0248,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4703.8,
          },
          {
            year: "2017",
            value: 4107.0,
          },
          {
            year: "2018",
            value: 7318.7,
          },
          {
            year: "2019",
            value: 6186.2165,
          },
          {
            year: "2020",
            value: 8503.8964,
          },
          {
            year: "2021",
            value: 8160.0,
          },
          {
            year: "2022",
            value: 7708.0,
          },
          {
            year: "2023",
            value: 8329.3277,
          },
          {
            year: "2024",
            value: 9469.4669,
          },
        ],
      },
    },
    阿尔巴尼亚: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 50672.0,
          },
          {
            year: "2017",
            value: 45403.4,
          },
          {
            year: "2018",
            value: 53990.5,
          },
          {
            year: "2019",
            value: 60109.3182,
          },
          {
            year: "2020",
            value: 57122.6053,
          },
          {
            year: "2021",
            value: 59166.0,
          },
          {
            year: "2022",
            value: 70054.0,
          },
          {
            year: "2023",
            value: 109401.0,
          },
          {
            year: "2024",
            value: 113720.3601,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 63531.6,
          },
          {
            year: "2017",
            value: 65025.6,
          },
          {
            year: "2018",
            value: 64794.1,
          },
          {
            year: "2019",
            value: 70381.3832,
          },
          {
            year: "2020",
            value: 65234.6624,
          },
          {
            year: "2021",
            value: 75611.0,
          },
          {
            year: "2022",
            value: 88576.0,
          },
          {
            year: "2023",
            value: 127410.0,
          },
          {
            year: "2024",
            value: 134178.4271,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 12859.6,
          },
          {
            year: "2017",
            value: 19622.2,
          },
          {
            year: "2018",
            value: 10803.6,
          },
          {
            year: "2019",
            value: 10272.065,
          },
          {
            year: "2020",
            value: 8112.0571,
          },
          {
            year: "2021",
            value: 16445.0,
          },
          {
            year: "2022",
            value: 18522.0,
          },
          {
            year: "2023",
            value: 18008.0,
          },
          {
            year: "2024",
            value: 20458.067,
          },
        ],
      },
    },
    爱沙尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 21179.1,
          },
          {
            year: "2017",
            value: 26033.9,
          },
          {
            year: "2018",
            value: 24519.1,
          },
          {
            year: "2019",
            value: 29872.2434,
          },
          {
            year: "2020",
            value: 28140.0051,
          },
          {
            year: "2021",
            value: 28146.0,
          },
          {
            year: "2022",
            value: 29087.0,
          },
          {
            year: "2023",
            value: 34535.0,
          },
          {
            year: "2024",
            value: 33526.6462,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 96417.4,
          },
          {
            year: "2017",
            value: 100635.2,
          },
          {
            year: "2018",
            value: 103150.7,
          },
          {
            year: "2019",
            value: 92232.4808,
          },
          {
            year: "2020",
            value: 86388.0707,
          },
          {
            year: "2021",
            value: 100991.0,
          },
          {
            year: "2022",
            value: 94655.0,
          },
          {
            year: "2023",
            value: 82474.0,
          },
          {
            year: "2024",
            value: 81495.7136,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 117596.5,
          },
          {
            year: "2017",
            value: 126669.1,
          },
          {
            year: "2018",
            value: 127669.8,
          },
          {
            year: "2019",
            value: 122104.7242,
          },
          {
            year: "2020",
            value: 114528.0758,
          },
          {
            year: "2021",
            value: 129137.0,
          },
          {
            year: "2022",
            value: 123742.0,
          },
          {
            year: "2023",
            value: 117010.0,
          },
          {
            year: "2024",
            value: 115022.3598,
          },
        ],
      },
    },
    奥地利: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 502654.4,
          },
          {
            year: "2017",
            value: 586591.1,
          },
          {
            year: "2018",
            value: 692328.4,
          },
          {
            year: "2019",
            value: 762329.7148,
          },
          {
            year: "2020",
            value: 663980.7037,
          },
          {
            year: "2021",
            value: 841886.0,
          },
          {
            year: "2022",
            value: 824077.0,
          },
          {
            year: "2023",
            value: 784755.0,
          },
          {
            year: "2024",
            value: 814809.9941,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 224287.3,
          },
          {
            year: "2017",
            value: 252712.9,
          },
          {
            year: "2018",
            value: 282753.7,
          },
          {
            year: "2019",
            value: 304777.1143,
          },
          {
            year: "2020",
            value: 340636.5736,
          },
          {
            year: "2021",
            value: 534957.0,
          },
          {
            year: "2022",
            value: 512140.0,
          },
          {
            year: "2023",
            value: 469888.0,
          },
          {
            year: "2024",
            value: 410127.1542,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 726941.7,
          },
          {
            year: "2017",
            value: 839304.0,
          },
          {
            year: "2018",
            value: 975082.1,
          },
          {
            year: "2019",
            value: 1067106.8291,
          },
          {
            year: "2020",
            value: 1004617.2773,
          },
          {
            year: "2021",
            value: 1376843.0,
          },
          {
            year: "2022",
            value: 1336217.0,
          },
          {
            year: "2023",
            value: 1254643.0,
          },
          {
            year: "2024",
            value: 1224937.1483,
          },
        ],
      },
    },
    白俄罗斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 43518.9,
          },
          {
            year: "2017",
            value: 51538.4,
          },
          {
            year: "2018",
            value: 57105.4,
          },
          {
            year: "2019",
            value: 91485.9793,
          },
          {
            year: "2020",
            value: 88869.2999,
          },
          {
            year: "2021",
            value: 109069.0,
          },
          {
            year: "2022",
            value: 180197.0,
          },
          {
            year: "2023",
            value: 260446.0,
          },
          {
            year: "2024",
            value: 181089.64,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 109017.3,
          },
          {
            year: "2017",
            value: 93336.2,
          },
          {
            year: "2018",
            value: 114158.9,
          },
          {
            year: "2019",
            value: 179906.92,
          },
          {
            year: "2020",
            value: 211323.1579,
          },
          {
            year: "2021",
            value: 272941.0,
          },
          {
            year: "2022",
            value: 325176.0,
          },
          {
            year: "2023",
            value: 583728.0,
          },
          {
            year: "2024",
            value: 658256.1632,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 152536.2,
          },
          {
            year: "2017",
            value: 144874.6,
          },
          {
            year: "2018",
            value: 171264.3,
          },
          {
            year: "2019",
            value: 271392.8993,
          },
          {
            year: "2020",
            value: 300192.4578,
          },
          {
            year: "2021",
            value: 382010.0,
          },
          {
            year: "2022",
            value: 505373.0,
          },
          {
            year: "2023",
            value: 844174.0,
          },
          {
            year: "2024",
            value: 839345.8032,
          },
        ],
      },
    },
    保加利亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 59010.8,
          },
          {
            year: "2017",
            value: 96918.3,
          },
          {
            year: "2018",
            value: 114643.1,
          },
          {
            year: "2019",
            value: 116413.6835,
          },
          {
            year: "2020",
            value: 137098.2164,
          },
          {
            year: "2021",
            value: 179855.0,
          },
          {
            year: "2022",
            value: 127352.0,
          },
          {
            year: "2023",
            value: 157485.0,
          },
          {
            year: "2024",
            value: 121422.5398,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 105653.6,
          },
          {
            year: "2017",
            value: 116904.7,
          },
          {
            year: "2018",
            value: 144025.3,
          },
          {
            year: "2019",
            value: 155478.7822,
          },
          {
            year: "2020",
            value: 154708.9088,
          },
          {
            year: "2021",
            value: 231221.0,
          },
          {
            year: "2022",
            value: 284408.0,
          },
          {
            year: "2023",
            value: 264589.0,
          },
          {
            year: "2024",
            value: 283465.874,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 164664.4,
          },
          {
            year: "2017",
            value: 213823.0,
          },
          {
            year: "2018",
            value: 258668.4,
          },
          {
            year: "2019",
            value: 271892.4657,
          },
          {
            year: "2020",
            value: 291807.1252,
          },
          {
            year: "2021",
            value: 411076.0,
          },
          {
            year: "2022",
            value: 411760.0,
          },
          {
            year: "2023",
            value: 422074.0,
          },
          {
            year: "2024",
            value: 404888.4138,
          },
        ],
      },
    },
    北马其顿: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4670.5,
          },
          {
            year: "2017",
            value: 8668.9,
          },
          {
            year: "2018",
            value: 4834.3,
          },
          {
            year: "2019",
            value: 14705.8917,
          },
          {
            year: "2020",
            value: 22713.3494,
          },
          {
            year: "2021",
            value: 36594.0,
          },
          {
            year: "2022",
            value: 17897.0,
          },
          {
            year: "2023",
            value: 19373.0,
          },
          {
            year: "2024",
            value: 17432.8074,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 9013.8,
          },
          {
            year: "2017",
            value: 7804.1,
          },
          {
            year: "2018",
            value: 10574.4,
          },
          {
            year: "2019",
            value: 13482.702,
          },
          {
            year: "2020",
            value: 15679.4594,
          },
          {
            year: "2021",
            value: 22428.0,
          },
          {
            year: "2022",
            value: 23458.0,
          },
          {
            year: "2023",
            value: 28198.0,
          },
          {
            year: "2024",
            value: 31557.8597,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 13684.3,
          },
          {
            year: "2017",
            value: 16473.0,
          },
          {
            year: "2018",
            value: 15408.7,
          },
          {
            year: "2019",
            value: 28188.5937,
          },
          {
            year: "2020",
            value: 38392.8088,
          },
          {
            year: "2021",
            value: 59022.0,
          },
          {
            year: "2022",
            value: 41355.0,
          },
          {
            year: "2023",
            value: 47571.0,
          },
          {
            year: "2024",
            value: 48990.6671,
          },
        ],
      },
    },
    波黑: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4354.6,
          },
          {
            year: "2017",
            value: 5725.4,
          },
          {
            year: "2018",
            value: 7740.2,
          },
          {
            year: "2019",
            value: 7687.8578,
          },
          {
            year: "2020",
            value: 7268.4402,
          },
          {
            year: "2021",
            value: 13764.0,
          },
          {
            year: "2022",
            value: 12271.0,
          },
          {
            year: "2023",
            value: 8288.0,
          },
          {
            year: "2024",
            value: 12708.6821,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 6413.2,
          },
          {
            year: "2017",
            value: 7881.7,
          },
          {
            year: "2018",
            value: 10971.8,
          },
          {
            year: "2019",
            value: 11516.4881,
          },
          {
            year: "2020",
            value: 12010.1901,
          },
          {
            year: "2021",
            value: 13695.0,
          },
          {
            year: "2022",
            value: 18518.0,
          },
          {
            year: "2023",
            value: 27883.7008,
          },
          {
            year: "2024",
            value: 28960.7932,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 10767.8,
          },
          {
            year: "2017",
            value: 13607.1,
          },
          {
            year: "2018",
            value: 18712.0,
          },
          {
            year: "2019",
            value: 19204.3459,
          },
          {
            year: "2020",
            value: 19278.6303,
          },
          {
            year: "2021",
            value: 27459.0,
          },
          {
            year: "2022",
            value: 30789.0,
          },
          {
            year: "2023",
            value: 36171.0,
          },
          {
            year: "2024",
            value: 41669.4753,
          },
        ],
      },
    },
    波兰: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 253772.2,
          },
          {
            year: "2017",
            value: 335350.8,
          },
          {
            year: "2018",
            value: 364536.8,
          },
          {
            year: "2019",
            value: 394149.4616,
          },
          {
            year: "2020",
            value: 432043.0163,
          },
          {
            year: "2021",
            value: 554183.0,
          },
          {
            year: "2022",
            value: 505487.0,
          },
          {
            year: "2023",
            value: 485900.0,
          },
          {
            year: "2024",
            value: 489880.4902,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1510001.9,
          },
          {
            year: "2017",
            value: 1787305.0,
          },
          {
            year: "2018",
            value: 2087621.2,
          },
          {
            year: "2019",
            value: 2388010.7357,
          },
          {
            year: "2020",
            value: 2673074.9062,
          },
          {
            year: "2021",
            value: 3657787.0,
          },
          {
            year: "2022",
            value: 3792948.0,
          },
          {
            year: "2023",
            value: 3716322.0,
          },
          {
            year: "2024",
            value: 4005076.2152,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1763774.1,
          },
          {
            year: "2017",
            value: 2122655.8,
          },
          {
            year: "2018",
            value: 2452158.0,
          },
          {
            year: "2019",
            value: 2782160.1973,
          },
          {
            year: "2020",
            value: 3105117.9225,
          },
          {
            year: "2021",
            value: 4211970.0,
          },
          {
            year: "2022",
            value: 4298434.0,
          },
          {
            year: "2023",
            value: 4202222.0,
          },
          {
            year: "2024",
            value: 4494956.7054,
          },
        ],
      },
    },
    俄罗斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3226014.8,
          },
          {
            year: "2017",
            value: 4139029.3,
          },
          {
            year: "2018",
            value: 5914217.6,
          },
          {
            year: "2019",
            value: 6119170.6178,
          },
          {
            year: "2020",
            value: 5768467.8863,
          },
          {
            year: "2021",
            value: 7960907.0,
          },
          {
            year: "2022",
            value: 11437983.0,
          },
          {
            year: "2023",
            value: 12932343.0,
          },
          {
            year: "2024",
            value: 12932035.614,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 3735576.7,
          },
          {
            year: "2017",
            value: 4283060.0,
          },
          {
            year: "2018",
            value: 4796527.3,
          },
          {
            year: "2019",
            value: 4974848.651,
          },
          {
            year: "2020",
            value: 5050446.6205,
          },
          {
            year: "2021",
            value: 6755117.0,
          },
          {
            year: "2022",
            value: 7564105.0,
          },
          {
            year: "2023",
            value: 11091316.0,
          },
          {
            year: "2024",
            value: 11549917.8626,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 6961591.5,
          },
          {
            year: "2017",
            value: 8422089.3,
          },
          {
            year: "2018",
            value: 10710744.9,
          },
          {
            year: "2019",
            value: 11094019.2688,
          },
          {
            year: "2020",
            value: 10818914.5068,
          },
          {
            year: "2021",
            value: 14680000.0,
          },
          {
            year: "2022",
            value: 19002088.0,
          },
          {
            year: "2023",
            value: 24023659.0,
          },
          {
            year: "2024",
            value: 24481953.4766,
          },
        ],
      },
    },
    黑山: {
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 14093.2,
          },
          {
            year: "2017",
            value: 19885.7,
          },
          {
            year: "2018",
            value: 21983.3,
          },
          {
            year: "2019",
            value: 15713.1128,
          },
          {
            year: "2020",
            value: 17054.527,
          },
          {
            year: "2021",
            value: 10746.0,
          },
          {
            year: "2022",
            value: 26601.0,
          },
          {
            year: "2023",
            value: 22285.0,
          },
          {
            year: "2024",
            value: 22603.943,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 10835.0,
          },
          {
            year: "2017",
            value: 13245.6,
          },
          {
            year: "2018",
            value: 17809.7,
          },
          {
            year: "2019",
            value: 11381.8914,
          },
          {
            year: "2020",
            value: 11316.1054,
          },
          {
            year: "2021",
            value: 9613.0,
          },
          {
            year: "2022",
            value: 21874.0,
          },
          {
            year: "2023",
            value: 18226.3276,
          },
          {
            year: "2024",
            value: 17171.5946,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3258.2,
          },
          {
            year: "2017",
            value: 6640.1,
          },
          {
            year: "2018",
            value: 4173.6,
          },
          {
            year: "2019",
            value: 4331.2214,
          },
          {
            year: "2020",
            value: 5738.4216,
          },
          {
            year: "2021",
            value: 1133.0,
          },
          {
            year: "2022",
            value: 4726.0,
          },
          {
            year: "2023",
            value: 4059.0,
          },
          {
            year: "2024",
            value: 5432.3484,
          },
        ],
      },
    },
    捷克: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 295154.3,
          },
          {
            year: "2017",
            value: 369570.6,
          },
          {
            year: "2018",
            value: 439904.7,
          },
          {
            year: "2019",
            value: 462821.1225,
          },
          {
            year: "2020",
            value: 513353.7228,
          },
          {
            year: "2021",
            value: 605328.0,
          },
          {
            year: "2022",
            value: 541425.0,
          },
          {
            year: "2023",
            value: 522432.0,
          },
          {
            year: "2024",
            value: 568818.6877,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 806174.9,
          },
          {
            year: "2017",
            value: 879297.0,
          },
          {
            year: "2018",
            value: 1190958.3,
          },
          {
            year: "2019",
            value: 1297304.2719,
          },
          {
            year: "2020",
            value: 1373768.8449,
          },
          {
            year: "2021",
            value: 1510814.0,
          },
          {
            year: "2022",
            value: 1821652.0,
          },
          {
            year: "2023",
            value: 1628889.0,
          },
          {
            year: "2024",
            value: 1753961.7378,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1101329.2,
          },
          {
            year: "2017",
            value: 1248867.6,
          },
          {
            year: "2018",
            value: 1630863.0,
          },
          {
            year: "2019",
            value: 1760125.3944,
          },
          {
            year: "2020",
            value: 1887122.5677,
          },
          {
            year: "2021",
            value: 2116142.0,
          },
          {
            year: "2022",
            value: 2363077.0,
          },
          {
            year: "2023",
            value: 2151321.0,
          },
          {
            year: "2024",
            value: 2322780.4255,
          },
        ],
      },
    },
    克罗地亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16144.0,
          },
          {
            year: "2017",
            value: 18308.4,
          },
          {
            year: "2018",
            value: 21199.7,
          },
          {
            year: "2019",
            value: 14498.1204,
          },
          {
            year: "2020",
            value: 13759.0092,
          },
          {
            year: "2021",
            value: 33990.0,
          },
          {
            year: "2022",
            value: 15863.0,
          },
          {
            year: "2023",
            value: 13705.0,
          },
          {
            year: "2024",
            value: 26421.143,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 101723.9,
          },
          {
            year: "2017",
            value: 115964.1,
          },
          {
            year: "2018",
            value: 132716.2,
          },
          {
            year: "2019",
            value: 139682.1033,
          },
          {
            year: "2020",
            value: 156674.1362,
          },
          {
            year: "2021",
            value: 197692.0,
          },
          {
            year: "2022",
            value: 225520.0,
          },
          {
            year: "2023",
            value: 239594.0,
          },
          {
            year: "2024",
            value: 269360.6408,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 117867.9,
          },
          {
            year: "2017",
            value: 134272.5,
          },
          {
            year: "2018",
            value: 153915.9,
          },
          {
            year: "2019",
            value: 154180.2237,
          },
          {
            year: "2020",
            value: 170433.1454,
          },
          {
            year: "2021",
            value: 231682.0,
          },
          {
            year: "2022",
            value: 241383.0,
          },
          {
            year: "2023",
            value: 253298.0,
          },
          {
            year: "2024",
            value: 295781.7838,
          },
        ],
      },
    },
    拉脱维亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 13220.5,
          },
          {
            year: "2017",
            value: 17724.0,
          },
          {
            year: "2018",
            value: 21305.1,
          },
          {
            year: "2019",
            value: 19569.0941,
          },
          {
            year: "2020",
            value: 20039.4953,
          },
          {
            year: "2021",
            value: 23910.0,
          },
          {
            year: "2022",
            value: 37534.0,
          },
          {
            year: "2023",
            value: 27196.0,
          },
          {
            year: "2024",
            value: 28585.8372,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 106272.4,
          },
          {
            year: "2017",
            value: 114824.2,
          },
          {
            year: "2018",
            value: 116608.8,
          },
          {
            year: "2019",
            value: 109358.5683,
          },
          {
            year: "2020",
            value: 105233.709,
          },
          {
            year: "2021",
            value: 114636.0,
          },
          {
            year: "2022",
            value: 102473.0,
          },
          {
            year: "2023",
            value: 98798.0,
          },
          {
            year: "2024",
            value: 86567.8877,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 119492.9,
          },
          {
            year: "2017",
            value: 132548.2,
          },
          {
            year: "2018",
            value: 137913.9,
          },
          {
            year: "2019",
            value: 128927.6624,
          },
          {
            year: "2020",
            value: 125273.2043,
          },
          {
            year: "2021",
            value: 138546.0,
          },
          {
            year: "2022",
            value: 140008.0,
          },
          {
            year: "2023",
            value: 125994.0,
          },
          {
            year: "2024",
            value: 115153.7249,
          },
        ],
      },
    },
    立陶宛: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16401.1,
          },
          {
            year: "2017",
            value: 25515.1,
          },
          {
            year: "2018",
            value: 33003.9,
          },
          {
            year: "2019",
            value: 43650.3043,
          },
          {
            year: "2020",
            value: 48761.0102,
          },
          {
            year: "2021",
            value: 43349.0,
          },
          {
            year: "2022",
            value: 9067.0,
          },
          {
            year: "2023",
            value: 13455.0,
          },
          {
            year: "2024",
            value: 21123.3666,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 129167.0,
          },
          {
            year: "2017",
            value: 160027.4,
          },
          {
            year: "2018",
            value: 176295.5,
          },
          {
            year: "2019",
            value: 169764.4892,
          },
          {
            year: "2020",
            value: 180760.5465,
          },
          {
            year: "2021",
            value: 219579.0,
          },
          {
            year: "2022",
            value: 178660.0,
          },
          {
            year: "2023",
            value: 195935.0,
          },
          {
            year: "2024",
            value: 198757.2937,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 145568.1,
          },
          {
            year: "2017",
            value: 185542.5,
          },
          {
            year: "2018",
            value: 209299.4,
          },
          {
            year: "2019",
            value: 213414.7935,
          },
          {
            year: "2020",
            value: 229521.5567,
          },
          {
            year: "2021",
            value: 262928.0,
          },
          {
            year: "2022",
            value: 187727.0,
          },
          {
            year: "2023",
            value: 209389.0,
          },
          {
            year: "2024",
            value: 219880.6603,
          },
        ],
      },
    },
    卢森堡: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 30556.5,
          },
          {
            year: "2017",
            value: 30803.6,
          },
          {
            year: "2018",
            value: 31204.3,
          },
          {
            year: "2019",
            value: 28220.2326,
          },
          {
            year: "2020",
            value: 27593.2766,
          },
          {
            year: "2021",
            value: 33238.0,
          },
          {
            year: "2022",
            value: 32443.0,
          },
          {
            year: "2023",
            value: 26726.6408,
          },
          {
            year: "2024",
            value: 31481.5982,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 125566.1,
          },
          {
            year: "2017",
            value: 70094.0,
          },
          {
            year: "2018",
            value: 80557.2,
          },
          {
            year: "2019",
            value: 155020.0562,
          },
          {
            year: "2020",
            value: 94947.2692,
          },
          {
            year: "2021",
            value: 144190.0,
          },
          {
            year: "2022",
            value: 52442.0,
          },
          {
            year: "2023",
            value: 44988.0,
          },
          {
            year: "2024",
            value: 43456.5857,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 156122.6,
          },
          {
            year: "2017",
            value: 100897.6,
          },
          {
            year: "2018",
            value: 111761.5,
          },
          {
            year: "2019",
            value: 183240.2888,
          },
          {
            year: "2020",
            value: 122540.5458,
          },
          {
            year: "2021",
            value: 177428.0,
          },
          {
            year: "2022",
            value: 84885.0,
          },
          {
            year: "2023",
            value: 71715.0,
          },
          {
            year: "2024",
            value: 74938.1839,
          },
        ],
      },
    },
    罗马尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 145522.1,
          },
          {
            year: "2017",
            value: 182431.8,
          },
          {
            year: "2018",
            value: 216785.2,
          },
          {
            year: "2019",
            value: 232565.1898,
          },
          {
            year: "2020",
            value: 263840.4916,
          },
          {
            year: "2021",
            value: 350746.0,
          },
          {
            year: "2022",
            value: 307710.0,
          },
          {
            year: "2023",
            value: 282231.1953,
          },
          {
            year: "2024",
            value: 411618.9108,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 344871.5,
          },
          {
            year: "2017",
            value: 377796.0,
          },
          {
            year: "2018",
            value: 450710.6,
          },
          {
            year: "2019",
            value: 457343.8493,
          },
          {
            year: "2020",
            value: 512640.4412,
          },
          {
            year: "2021",
            value: 670829.0,
          },
          {
            year: "2022",
            value: 736364.0,
          },
          {
            year: "2023",
            value: 773273.0,
          },
          {
            year: "2024",
            value: 933419.9844,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 490393.6,
          },
          {
            year: "2017",
            value: 560227.8,
          },
          {
            year: "2018",
            value: 667495.8,
          },
          {
            year: "2019",
            value: 689909.0391,
          },
          {
            year: "2020",
            value: 776480.9328,
          },
          {
            year: "2021",
            value: 1021575.0,
          },
          {
            year: "2022",
            value: 1044074.0,
          },
          {
            year: "2023",
            value: 1055473.0,
          },
          {
            year: "2024",
            value: 1345038.8952,
          },
        ],
      },
    },
    马耳他: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 40012.7,
          },
          {
            year: "2017",
            value: 41091.4,
          },
          {
            year: "2018",
            value: 34920.3,
          },
          {
            year: "2019",
            value: 35862.3461,
          },
          {
            year: "2020",
            value: 38761.2617,
          },
          {
            year: "2021",
            value: 55350.0,
          },
          {
            year: "2022",
            value: 58521.0,
          },
          {
            year: "2023",
            value: 64321.3628,
          },
          {
            year: "2024",
            value: 48208.9638,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 156602.1,
          },
          {
            year: "2017",
            value: 209594.2,
          },
          {
            year: "2018",
            value: 143199.8,
          },
          {
            year: "2019",
            value: 115983.1724,
          },
          {
            year: "2020",
            value: 136780.3891,
          },
          {
            year: "2021",
            value: 220230.0,
          },
          {
            year: "2022",
            value: 196573.0,
          },
          {
            year: "2023",
            value: 182888.0,
          },
          {
            year: "2024",
            value: 406129.0258,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 196614.8,
          },
          {
            year: "2017",
            value: 250685.6,
          },
          {
            year: "2018",
            value: 178120.1,
          },
          {
            year: "2019",
            value: 151845.5185,
          },
          {
            year: "2020",
            value: 175541.6508,
          },
          {
            year: "2021",
            value: 275580.0,
          },
          {
            year: "2022",
            value: 255093.0,
          },
          {
            year: "2023",
            value: 247209.0,
          },
          {
            year: "2024",
            value: 454337.9896,
          },
        ],
      },
    },
    摩尔多瓦: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2437.2,
          },
          {
            year: "2017",
            value: 3396.4,
          },
          {
            year: "2018",
            value: 3838.8,
          },
          {
            year: "2019",
            value: 4680.7566,
          },
          {
            year: "2020",
            value: 6047.2982,
          },
          {
            year: "2021",
            value: 10469.0,
          },
          {
            year: "2022",
            value: 8488.0,
          },
          {
            year: "2023",
            value: 9455.2374,
          },
          {
            year: "2024",
            value: 12861.4749,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 7681.2,
          },
          {
            year: "2017",
            value: 9791.6,
          },
          {
            year: "2018",
            value: 10869.5,
          },
          {
            year: "2019",
            value: 12931.2171,
          },
          {
            year: "2020",
            value: 14579.9105,
          },
          {
            year: "2021",
            value: 17881.0,
          },
          {
            year: "2022",
            value: 20584.0,
          },
          {
            year: "2023",
            value: 25156.0,
          },
          {
            year: "2024",
            value: 33715.7045,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 10118.4,
          },
          {
            year: "2017",
            value: 13188.0,
          },
          {
            year: "2018",
            value: 14708.3,
          },
          {
            year: "2019",
            value: 17611.9737,
          },
          {
            year: "2020",
            value: 20627.2087,
          },
          {
            year: "2021",
            value: 28350.0,
          },
          {
            year: "2022",
            value: 29073.0,
          },
          {
            year: "2023",
            value: 34612.0,
          },
          {
            year: "2024",
            value: 46577.1794,
          },
        ],
      },
    },
    葡萄牙: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 158281.8,
          },
          {
            year: "2017",
            value: 213917.9,
          },
          {
            year: "2018",
            value: 224905.6,
          },
          {
            year: "2019",
            value: 232231.4576,
          },
          {
            year: "2020",
            value: 277249.1896,
          },
          {
            year: "2021",
            value: 345356.0,
          },
          {
            year: "2022",
            value: 303636.0,
          },
          {
            year: "2023",
            value: 291193.0,
          },
          {
            year: "2024",
            value: 317095.0355,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 400428.3,
          },
          {
            year: "2017",
            value: 344521.5,
          },
          {
            year: "2018",
            value: 375019.8,
          },
          {
            year: "2019",
            value: 436643.8258,
          },
          {
            year: "2020",
            value: 418059.214,
          },
          {
            year: "2021",
            value: 535424.0,
          },
          {
            year: "2022",
            value: 596720.0,
          },
          {
            year: "2023",
            value: 579203.0,
          },
          {
            year: "2024",
            value: 610972.1368,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 558710.1,
          },
          {
            year: "2017",
            value: 558439.4,
          },
          {
            year: "2018",
            value: 599925.4,
          },
          {
            year: "2019",
            value: 668875.2834,
          },
          {
            year: "2020",
            value: 695308.4036,
          },
          {
            year: "2021",
            value: 880780.0,
          },
          {
            year: "2022",
            value: 900356.0,
          },
          {
            year: "2023",
            value: 870396.0,
          },
          {
            year: "2024",
            value: 928067.1723,
          },
        ],
      },
    },
    塞尔维亚: {
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 59493.8,
          },
          {
            year: "2017",
            value: 75722.4,
          },
          {
            year: "2018",
            value: 95217.3,
          },
          {
            year: "2019",
            value: 139357.9888,
          },
          {
            year: "2020",
            value: 212251.682,
          },
          {
            year: "2021",
            value: 322569.0,
          },
          {
            year: "2022",
            value: 352456.0,
          },
          {
            year: "2023",
            value: 434877.0,
          },
          {
            year: "2024",
            value: 573140.5855,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 43224.2,
          },
          {
            year: "2017",
            value: 54563.9,
          },
          {
            year: "2018",
            value: 72830.1,
          },
          {
            year: "2019",
            value: 103296.7143,
          },
          {
            year: "2020",
            value: 162434.0156,
          },
          {
            year: "2021",
            value: 224216.0,
          },
          {
            year: "2022",
            value: 216925.0,
          },
          {
            year: "2023",
            value: 269920.0,
          },
          {
            year: "2024",
            value: 344556.7762,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 16269.6,
          },
          {
            year: "2017",
            value: 21158.5,
          },
          {
            year: "2018",
            value: 22387.2,
          },
          {
            year: "2019",
            value: 36061.2745,
          },
          {
            year: "2020",
            value: 49817.6664,
          },
          {
            year: "2021",
            value: 98353.0,
          },
          {
            year: "2022",
            value: 135531.0,
          },
          {
            year: "2023",
            value: 164957.0,
          },
          {
            year: "2024",
            value: 228583.8093,
          },
        ],
      },
    },
    塞浦路斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4778.7,
          },
          {
            year: "2017",
            value: 5334.2,
          },
          {
            year: "2018",
            value: 5398.8,
          },
          {
            year: "2019",
            value: 5528.1032,
          },
          {
            year: "2020",
            value: 2517.235,
          },
          {
            year: "2021",
            value: 2887.0,
          },
          {
            year: "2022",
            value: 3374.0,
          },
          {
            year: "2023",
            value: 3554.0,
          },
          {
            year: "2024",
            value: 2548.1302,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 46235.7,
          },
          {
            year: "2017",
            value: 52430.7,
          },
          {
            year: "2018",
            value: 73812.4,
          },
          {
            year: "2019",
            value: 58080.9891,
          },
          {
            year: "2020",
            value: 89310.5601,
          },
          {
            year: "2021",
            value: 86638.0,
          },
          {
            year: "2022",
            value: 116325.0,
          },
          {
            year: "2023",
            value: 95753.0,
          },
          {
            year: "2024",
            value: 112416.6164,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 51014.4,
          },
          {
            year: "2017",
            value: 57764.9,
          },
          {
            year: "2018",
            value: 79211.2,
          },
          {
            year: "2019",
            value: 63609.0923,
          },
          {
            year: "2020",
            value: 91827.7951,
          },
          {
            year: "2021",
            value: 89525.0,
          },
          {
            year: "2022",
            value: 119698.0,
          },
          {
            year: "2023",
            value: 99307.0,
          },
          {
            year: "2024",
            value: 114964.7466,
          },
        ],
      },
    },
    斯洛伐克: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 241016.6,
          },
          {
            year: "2017",
            value: 258496.3,
          },
          {
            year: "2018",
            value: 524562.5,
          },
          {
            year: "2019",
            value: 596877.5199,
          },
          {
            year: "2020",
            value: 643108.4889,
          },
          {
            year: "2021",
            value: 754723.0,
          },
          {
            year: "2022",
            value: 770907.0,
          },
          {
            year: "2023",
            value: 723394.0,
          },
          {
            year: "2024",
            value: 577054.0293,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 286234.0,
          },
          {
            year: "2017",
            value: 272947.9,
          },
          {
            year: "2018",
            value: 253585.0,
          },
          {
            year: "2019",
            value: 292382.4153,
          },
          {
            year: "2020",
            value: 303154.6137,
          },
          {
            year: "2021",
            value: 454531.0,
          },
          {
            year: "2022",
            value: 443490.0,
          },
          {
            year: "2023",
            value: 429988.0,
          },
          {
            year: "2024",
            value: 394948.3236,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 527250.6,
          },
          {
            year: "2017",
            value: 531444.2,
          },
          {
            year: "2018",
            value: 778147.5,
          },
          {
            year: "2019",
            value: 889259.9352,
          },
          {
            year: "2020",
            value: 946263.1026,
          },
          {
            year: "2021",
            value: 1209254.0,
          },
          {
            year: "2022",
            value: 1214397.0,
          },
          {
            year: "2023",
            value: 1153383.0,
          },
          {
            year: "2024",
            value: 972002.3529,
          },
        ],
      },
    },
    斯洛文尼亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 43685.8,
          },
          {
            year: "2017",
            value: 49535.2,
          },
          {
            year: "2018",
            value: 59102.2,
          },
          {
            year: "2019",
            value: 51646.6962,
          },
          {
            year: "2020",
            value: 50868.1108,
          },
          {
            year: "2021",
            value: 63207.0,
          },
          {
            year: "2022",
            value: 58948.0,
          },
          {
            year: "2023",
            value: 49895.0,
          },
          {
            year: "2024",
            value: 51002.3409,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 227025.8,
          },
          {
            year: "2017",
            value: 288693.0,
          },
          {
            year: "2018",
            value: 442423.4,
          },
          {
            year: "2019",
            value: 341152.3282,
          },
          {
            year: "2020",
            value: 345219.4297,
          },
          {
            year: "2021",
            value: 536313.0,
          },
          {
            year: "2022",
            value: 683493.0,
          },
          {
            year: "2023",
            value: 619806.0,
          },
          {
            year: "2024",
            value: 612548.9581,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 270711.6,
          },
          {
            year: "2017",
            value: 338228.2,
          },
          {
            year: "2018",
            value: 501525.6,
          },
          {
            year: "2019",
            value: 392799.0244,
          },
          {
            year: "2020",
            value: 396087.5405,
          },
          {
            year: "2021",
            value: 599521.0,
          },
          {
            year: "2022",
            value: 742441.0,
          },
          {
            year: "2023",
            value: 669701.0,
          },
          {
            year: "2024",
            value: 663551.299,
          },
        ],
      },
    },
    乌克兰: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 249079.5,
          },
          {
            year: "2017",
            value: 233964.2,
          },
          {
            year: "2018",
            value: 264503.0,
          },
          {
            year: "2019",
            value: 450900.9448,
          },
          {
            year: "2020",
            value: 800175.2356,
          },
          {
            year: "2021",
            value: 977446.0,
          },
          {
            year: "2022",
            value: 434923.0,
          },
          {
            year: "2023",
            value: 403028.0,
          },
          {
            year: "2024",
            value: 428929.0487,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 422022.9,
          },
          {
            year: "2017",
            value: 504064.5,
          },
          {
            year: "2018",
            value: 701850.2,
          },
          {
            year: "2019",
            value: 739957.4556,
          },
          {
            year: "2020",
            value: 687801.0393,
          },
          {
            year: "2021",
            value: 940443.0,
          },
          {
            year: "2022",
            value: 329468.0,
          },
          {
            year: "2023",
            value: 278135.0,
          },
          {
            year: "2024",
            value: 370288.777,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 671102.4,
          },
          {
            year: "2017",
            value: 738028.7,
          },
          {
            year: "2018",
            value: 966353.2,
          },
          {
            year: "2019",
            value: 1190858.4004,
          },
          {
            year: "2020",
            value: 1487976.2749,
          },
          {
            year: "2021",
            value: 1917889.0,
          },
          {
            year: "2022",
            value: 764391.0,
          },
          {
            year: "2023",
            value: 681163.0,
          },
          {
            year: "2024",
            value: 799217.8257,
          },
        ],
      },
    },
    希腊: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 28310.6,
          },
          {
            year: "2017",
            value: 43004.0,
          },
          {
            year: "2018",
            value: 56250.8,
          },
          {
            year: "2019",
            value: 72525.463,
          },
          {
            year: "2020",
            value: 77389.1395,
          },
          {
            year: "2021",
            value: 97322.0,
          },
          {
            year: "2022",
            value: 83579.0,
          },
          {
            year: "2023",
            value: 83239.0,
          },
          {
            year: "2024",
            value: 106059.6124,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 420269.0,
          },
          {
            year: "2017",
            value: 475138.1,
          },
          {
            year: "2018",
            value: 649832.0,
          },
          {
            year: "2019",
            value: 774011.5331,
          },
          {
            year: "2020",
            value: 703659.3162,
          },
          {
            year: "2021",
            value: 1117965.0,
          },
          {
            year: "2022",
            value: 1286372.0,
          },
          {
            year: "2023",
            value: 1276260.0,
          },
          {
            year: "2024",
            value: 1180540.2065,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 448579.6,
          },
          {
            year: "2017",
            value: 518142.1,
          },
          {
            year: "2018",
            value: 706082.8,
          },
          {
            year: "2019",
            value: 846536.9961,
          },
          {
            year: "2020",
            value: 781048.4557,
          },
          {
            year: "2021",
            value: 1215287.0,
          },
          {
            year: "2022",
            value: 1369951.0,
          },
          {
            year: "2023",
            value: 1359499.0,
          },
          {
            year: "2024",
            value: 1286599.8189,
          },
        ],
      },
    },
    匈牙利: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 346423.0,
          },
          {
            year: "2017",
            value: 407722.4,
          },
          {
            year: "2018",
            value: 434207.4,
          },
          {
            year: "2019",
            value: 374502.0256,
          },
          {
            year: "2020",
            value: 428289.8329,
          },
          {
            year: "2021",
            value: 557035.0,
          },
          {
            year: "2022",
            value: 504885.0,
          },
          {
            year: "2023",
            value: 472932.0,
          },
          {
            year: "2024",
            value: 479857.0961,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 542516.5,
          },
          {
            year: "2017",
            value: 604934.5,
          },
          {
            year: "2018",
            value: 654021.4,
          },
          {
            year: "2019",
            value: 647285.5061,
          },
          {
            year: "2020",
            value: 740372.17,
          },
          {
            year: "2021",
            value: 1014163.0,
          },
          {
            year: "2022",
            value: 1045370.0,
          },
          {
            year: "2023",
            value: 979536.0,
          },
          {
            year: "2024",
            value: 1140708.0327,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 888939.5,
          },
          {
            year: "2017",
            value: 1012656.9,
          },
          {
            year: "2018",
            value: 1088228.8,
          },
          {
            year: "2019",
            value: 1021787.5317,
          },
          {
            year: "2020",
            value: 1168662.0029,
          },
          {
            year: "2021",
            value: 1571198.0,
          },
          {
            year: "2022",
            value: 1550255.0,
          },
          {
            year: "2023",
            value: 1452468.0,
          },
          {
            year: "2024",
            value: 1620565.1288,
          },
        ],
      },
    },
    意大利: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1671318.5,
          },
          {
            year: "2017",
            value: 2049794.2,
          },
          {
            year: "2018",
            value: 2106219.4,
          },
          {
            year: "2019",
            value: 2142434.8961,
          },
          {
            year: "2020",
            value: 2224955.4645,
          },
          {
            year: "2021",
            value: 3032373.0,
          },
          {
            year: "2022",
            value: 2687118.0,
          },
          {
            year: "2023",
            value: 2722413.0,
          },
          {
            year: "2024",
            value: 2634753.1927,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 2638835.3,
          },
          {
            year: "2017",
            value: 2919996.2,
          },
          {
            year: "2018",
            value: 3317161.0,
          },
          {
            year: "2019",
            value: 3351978.4047,
          },
          {
            year: "2020",
            value: 3291470.6234,
          },
          {
            year: "2021",
            value: 4362921.0,
          },
          {
            year: "2022",
            value: 5055928.0,
          },
          {
            year: "2023",
            value: 4452099.0,
          },
          {
            year: "2024",
            value: 4619472.5457,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 4310153.8,
          },
          {
            year: "2017",
            value: 4969790.4,
          },
          {
            year: "2018",
            value: 5423380.4,
          },
          {
            year: "2019",
            value: 5494413.3008,
          },
          {
            year: "2020",
            value: 5516426.0879,
          },
          {
            year: "2021",
            value: 7395294.0,
          },
          {
            year: "2022",
            value: 7743046.0,
          },
          {
            year: "2023",
            value: 7174513.0,
          },
          {
            year: "2024",
            value: 7254225.7384,
          },
        ],
      },
    },
    安提瓜和巴布达: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 13344.9,
          },
          {
            year: "2017",
            value: 4487.0,
          },
          {
            year: "2018",
            value: 5536.0,
          },
          {
            year: "2019",
            value: 7193.6357,
          },
          {
            year: "2020",
            value: 9131.6077,
          },
          {
            year: "2021",
            value: 11026.0,
          },
          {
            year: "2022",
            value: 10364.0,
          },
          {
            year: "2023",
            value: 16684.0,
          },
          {
            year: "2024",
            value: 11483.9823,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 13348.6,
          },
          {
            year: "2017",
            value: 4487.8,
          },
          {
            year: "2018",
            value: 5540.5,
          },
          {
            year: "2019",
            value: 7200.5995,
          },
          {
            year: "2020",
            value: 9134.8795,
          },
          {
            year: "2021",
            value: 11295.0,
          },
          {
            year: "2022",
            value: 10469.0,
          },
          {
            year: "2023",
            value: 17233.0,
          },
          {
            year: "2024",
            value: 11997.1774,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3.7,
          },
          {
            year: "2017",
            value: 0.8,
          },
          {
            year: "2018",
            value: 4.5,
          },
          {
            year: "2019",
            value: 6.9638,
          },
          {
            year: "2020",
            value: 3.2718,
          },
          {
            year: "2021",
            value: 269.0,
          },
          {
            year: "2022",
            value: 105.0,
          },
          {
            year: "2023",
            value: 549.4287,
          },
          {
            year: "2024",
            value: 513.1951,
          },
        ],
      },
    },
    巴巴多斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1863.6,
          },
          {
            year: "2017",
            value: 2477.1,
          },
          {
            year: "2018",
            value: 2127.5,
          },
          {
            year: "2019",
            value: 2026.2968,
          },
          {
            year: "2020",
            value: 1516.2203,
          },
          {
            year: "2021",
            value: 1525.0,
          },
          {
            year: "2022",
            value: 2655.0,
          },
          {
            year: "2023",
            value: 1180.3992,
          },
          {
            year: "2024",
            value: 1111.6339,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 7243.1,
          },
          {
            year: "2017",
            value: 10779.8,
          },
          {
            year: "2018",
            value: 13673.1,
          },
          {
            year: "2019",
            value: 15613.5079,
          },
          {
            year: "2020",
            value: 7909.5659,
          },
          {
            year: "2021",
            value: 23874.0,
          },
          {
            year: "2022",
            value: 15988.0,
          },
          {
            year: "2023",
            value: 15167.0,
          },
          {
            year: "2024",
            value: 18640.3368,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 9106.7,
          },
          {
            year: "2017",
            value: 13256.9,
          },
          {
            year: "2018",
            value: 15800.6,
          },
          {
            year: "2019",
            value: 17639.8047,
          },
          {
            year: "2020",
            value: 9425.7862,
          },
          {
            year: "2021",
            value: 25399.0,
          },
          {
            year: "2022",
            value: 18643.0,
          },
          {
            year: "2023",
            value: 16348.0,
          },
          {
            year: "2024",
            value: 19751.9707,
          },
        ],
      },
    },
    巴拿马: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 3765.4,
          },
          {
            year: "2017",
            value: 6202.7,
          },
          {
            year: "2018",
            value: 8176.3,
          },
          {
            year: "2019",
            value: 45202.8397,
          },
          {
            year: "2020",
            value: 46941.6895,
          },
          {
            year: "2021",
            value: 117915.0,
          },
          {
            year: "2022",
            value: 122158.0,
          },
          {
            year: "2023",
            value: 161228.0,
          },
          {
            year: "2024",
            value: 8103.9503,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 634408.6,
          },
          {
            year: "2017",
            value: 662696.9,
          },
          {
            year: "2018",
            value: 694013.2,
          },
          {
            year: "2019",
            value: 794450.0688,
          },
          {
            year: "2020",
            value: 879365.0575,
          },
          {
            year: "2021",
            value: 1017947.0,
          },
          {
            year: "2022",
            value: 1251057.0,
          },
          {
            year: "2023",
            value: 1132640.0,
          },
          {
            year: "2024",
            value: 1275484.2769,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 638174.0,
          },
          {
            year: "2017",
            value: 668899.6,
          },
          {
            year: "2018",
            value: 702189.5,
          },
          {
            year: "2019",
            value: 839652.9085,
          },
          {
            year: "2020",
            value: 926306.747,
          },
          {
            year: "2021",
            value: 1135862.0,
          },
          {
            year: "2022",
            value: 1373214.0,
          },
          {
            year: "2023",
            value: 1293869.0,
          },
          {
            year: "2024",
            value: 1283588.2272,
          },
        ],
      },
    },
    多米尼加: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 13026.3,
          },
          {
            year: "2017",
            value: 16758.7,
          },
          {
            year: "2018",
            value: 18012.5,
          },
          {
            year: "2019",
            value: 45433.257,
          },
          {
            year: "2020",
            value: 29930.4139,
          },
          {
            year: "2021",
            value: 34813.0,
          },
          {
            year: "2022",
            value: 52826.0,
          },
          {
            year: "2023",
            value: 63022.0,
          },
          {
            year: "2024",
            value: 55910.8053,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 156720.6,
          },
          {
            year: "2017",
            value: 170294.8,
          },
          {
            year: "2018",
            value: 210838.3,
          },
          {
            year: "2019",
            value: 239042.7684,
          },
          {
            year: "2020",
            value: 249395.9159,
          },
          {
            year: "2021",
            value: 400242.0,
          },
          {
            year: "2022",
            value: 425335.0,
          },
          {
            year: "2023",
            value: 433516.0,
          },
          {
            year: "2024",
            value: 462832.4729,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 169746.9,
          },
          {
            year: "2017",
            value: 187053.5,
          },
          {
            year: "2018",
            value: 228850.8,
          },
          {
            year: "2019",
            value: 284476.0254,
          },
          {
            year: "2020",
            value: 279326.3298,
          },
          {
            year: "2021",
            value: 435055.0,
          },
          {
            year: "2022",
            value: 478161.0,
          },
          {
            year: "2023",
            value: 496538.0,
          },
          {
            year: "2024",
            value: 518743.2782,
          },
        ],
      },
    },
    格林纳达: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 734.1,
          },
          {
            year: "2017",
            value: 1070.0,
          },
          {
            year: "2018",
            value: 1314.6,
          },
          {
            year: "2019",
            value: 1458.9898,
          },
          {
            year: "2020",
            value: 1540.7757,
          },
          {
            year: "2021",
            value: 2045.0,
          },
          {
            year: "2022",
            value: 2222.0,
          },
          {
            year: "2023",
            value: 2404.1768,
          },
          {
            year: "2024",
            value: 2738.6966,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 735.0,
          },
          {
            year: "2017",
            value: 1071.2,
          },
          {
            year: "2018",
            value: 1314.9,
          },
          {
            year: "2019",
            value: 1459.2387,
          },
          {
            year: "2020",
            value: 1545.154,
          },
          {
            year: "2021",
            value: 2047.0,
          },
          {
            year: "2022",
            value: 2224.0,
          },
          {
            year: "2023",
            value: 2404.71,
          },
          {
            year: "2024",
            value: 2739.0595,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 0.9,
          },
          {
            year: "2017",
            value: 1.2,
          },
          {
            year: "2018",
            value: 0.3,
          },
          {
            year: "2019",
            value: 0.2489,
          },
          {
            year: "2020",
            value: 4.3783,
          },
          {
            year: "2021",
            value: 2.0,
          },
          {
            year: "2022",
            value: 2.0,
          },
          {
            year: "2023",
            value: 1.0,
          },
          {
            year: "2024",
            value: 0.3629,
          },
        ],
      },
    },
    哥斯达黎加: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 69741.3,
          },
          {
            year: "2017",
            value: 79162.1,
          },
          {
            year: "2018",
            value: 77722.0,
          },
          {
            year: "2019",
            value: 72255.8891,
          },
          {
            year: "2020",
            value: 66860.918,
          },
          {
            year: "2021",
            value: 81547.0,
          },
          {
            year: "2022",
            value: 200881.0,
          },
          {
            year: "2023",
            value: 291787.0,
          },
          {
            year: "2024",
            value: 437971.4279,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 149529.6,
          },
          {
            year: "2017",
            value: 149508.3,
          },
          {
            year: "2018",
            value: 166273.4,
          },
          {
            year: "2019",
            value: 152133.2211,
          },
          {
            year: "2020",
            value: 153567.885,
          },
          {
            year: "2021",
            value: 225492.0,
          },
          {
            year: "2022",
            value: 235809.0,
          },
          {
            year: "2023",
            value: 278402.0,
          },
          {
            year: "2024",
            value: 337946.0182,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 219270.9,
          },
          {
            year: "2017",
            value: 228670.4,
          },
          {
            year: "2018",
            value: 243995.4,
          },
          {
            year: "2019",
            value: 224389.1102,
          },
          {
            year: "2020",
            value: 220428.803,
          },
          {
            year: "2021",
            value: 307039.0,
          },
          {
            year: "2022",
            value: 436691.0,
          },
          {
            year: "2023",
            value: 570188.0,
          },
          {
            year: "2024",
            value: 775917.4461,
          },
        ],
      },
    },
    古巴: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 27375.2,
          },
          {
            year: "2017",
            value: 39799.0,
          },
          {
            year: "2018",
            value: 48038.3,
          },
          {
            year: "2019",
            value: 49271.1062,
          },
          {
            year: "2020",
            value: 47000.9989,
          },
          {
            year: "2021",
            value: 44557.0,
          },
          {
            year: "2022",
            value: 45164.0,
          },
          {
            year: "2023",
            value: 35446.0,
          },
          {
            year: "2024",
            value: 27108.7415,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 178310.5,
          },
          {
            year: "2017",
            value: 135704.2,
          },
          {
            year: "2018",
            value: 107553.8,
          },
          {
            year: "2019",
            value: 79092.6142,
          },
          {
            year: "2020",
            value: 48329.2517,
          },
          {
            year: "2021",
            value: 57587.0,
          },
          {
            year: "2022",
            value: 41293.0,
          },
          {
            year: "2023",
            value: 50377.0,
          },
          {
            year: "2024",
            value: 64463.3337,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 205685.7,
          },
          {
            year: "2017",
            value: 175503.2,
          },
          {
            year: "2018",
            value: 155592.1,
          },
          {
            year: "2019",
            value: 128363.7204,
          },
          {
            year: "2020",
            value: 95330.2506,
          },
          {
            year: "2021",
            value: 102144.0,
          },
          {
            year: "2022",
            value: 86457.0,
          },
          {
            year: "2023",
            value: 85823.0,
          },
          {
            year: "2024",
            value: 91572.0752,
          },
        ],
      },
    },
    洪都拉斯: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2784.7,
          },
          {
            year: "2017",
            value: 2393.8,
          },
          {
            year: "2018",
            value: 4826.8,
          },
          {
            year: "2019",
            value: 3178.68,
          },
          {
            year: "2020",
            value: 4595.2511,
          },
          {
            year: "2021",
            value: 3413.0,
          },
          {
            year: "2022",
            value: 2924.0,
          },
          {
            year: "2023",
            value: 8116.0,
          },
          {
            year: "2024",
            value: 9682.7348,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 72067.3,
          },
          {
            year: "2017",
            value: 84482.0,
          },
          {
            year: "2018",
            value: 98773.1,
          },
          {
            year: "2019",
            value: 94046.0276,
          },
          {
            year: "2020",
            value: 92287.3136,
          },
          {
            year: "2021",
            value: 158471.0,
          },
          {
            year: "2022",
            value: 154983.0,
          },
          {
            year: "2023",
            value: 182830.0,
          },
          {
            year: "2024",
            value: 193538.7072,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 74852.0,
          },
          {
            year: "2017",
            value: 86875.8,
          },
          {
            year: "2018",
            value: 103599.9,
          },
          {
            year: "2019",
            value: 97224.7076,
          },
          {
            year: "2020",
            value: 96882.5647,
          },
          {
            year: "2021",
            value: 161884.0,
          },
          {
            year: "2022",
            value: 157907.0,
          },
          {
            year: "2023",
            value: 190946.0,
          },
          {
            year: "2024",
            value: 203221.442,
          },
        ],
      },
    },
    尼加拉瓜: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1788.7,
          },
          {
            year: "2017",
            value: 2840.0,
          },
          {
            year: "2018",
            value: 10571.9,
          },
          {
            year: "2019",
            value: 4555.4099,
          },
          {
            year: "2020",
            value: 1895.828,
          },
          {
            year: "2021",
            value: 2506.0,
          },
          {
            year: "2022",
            value: 3521.0,
          },
          {
            year: "2023",
            value: 2863.0,
          },
          {
            year: "2024",
            value: 9112.7015,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 62421.4,
          },
          {
            year: "2017",
            value: 62414.2,
          },
          {
            year: "2018",
            value: 47399.5,
          },
          {
            year: "2019",
            value: 50207.1632,
          },
          {
            year: "2020",
            value: 48643.7853,
          },
          {
            year: "2021",
            value: 79419.0,
          },
          {
            year: "2022",
            value: 71782.0,
          },
          {
            year: "2023",
            value: 82451.6081,
          },
          {
            year: "2024",
            value: 116094.9695,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 64210.1,
          },
          {
            year: "2017",
            value: 65254.2,
          },
          {
            year: "2018",
            value: 57971.4,
          },
          {
            year: "2019",
            value: 54762.5731,
          },
          {
            year: "2020",
            value: 50539.6133,
          },
          {
            year: "2021",
            value: 81925.0,
          },
          {
            year: "2022",
            value: 75303.0,
          },
          {
            year: "2023",
            value: 85315.0,
          },
          {
            year: "2024",
            value: 125207.671,
          },
        ],
      },
    },
    萨尔瓦多: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4583.1,
          },
          {
            year: "2017",
            value: 11637.1,
          },
          {
            year: "2018",
            value: 16438.9,
          },
          {
            year: "2019",
            value: 11331.2873,
          },
          {
            year: "2020",
            value: 17178.1379,
          },
          {
            year: "2021",
            value: 21885.0,
          },
          {
            year: "2022",
            value: 23342.0,
          },
          {
            year: "2023",
            value: 16877.0,
          },
          {
            year: "2024",
            value: 17711.1999,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 77233.1,
          },
          {
            year: "2017",
            value: 77255.2,
          },
          {
            year: "2018",
            value: 92722.4,
          },
          {
            year: "2019",
            value: 100125.1496,
          },
          {
            year: "2020",
            value: 93824.812,
          },
          {
            year: "2021",
            value: 151117.0,
          },
          {
            year: "2022",
            value: 165056.0,
          },
          {
            year: "2023",
            value: 163349.0,
          },
          {
            year: "2024",
            value: 178913.2652,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 81816.2,
          },
          {
            year: "2017",
            value: 88892.3,
          },
          {
            year: "2018",
            value: 109161.3,
          },
          {
            year: "2019",
            value: 111456.4369,
          },
          {
            year: "2020",
            value: 111002.9499,
          },
          {
            year: "2021",
            value: 173002.0,
          },
          {
            year: "2022",
            value: 188398.0,
          },
          {
            year: "2023",
            value: 180226.0,
          },
          {
            year: "2024",
            value: 196624.4651,
          },
        ],
      },
    },
    特立尼达和多巴哥: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 17493.7,
          },
          {
            year: "2017",
            value: 18233.2,
          },
          {
            year: "2018",
            value: 38543.1,
          },
          {
            year: "2019",
            value: 66916.729,
          },
          {
            year: "2020",
            value: 33483.0084,
          },
          {
            year: "2021",
            value: 63437.0,
          },
          {
            year: "2022",
            value: 76178.0,
          },
          {
            year: "2023",
            value: 78384.0,
          },
          {
            year: "2024",
            value: 51789.2187,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 34636.4,
          },
          {
            year: "2017",
            value: 42989.1,
          },
          {
            year: "2018",
            value: 34712.8,
          },
          {
            year: "2019",
            value: 36350.1691,
          },
          {
            year: "2020",
            value: 34120.2944,
          },
          {
            year: "2021",
            value: 42462.0,
          },
          {
            year: "2022",
            value: 53999.0,
          },
          {
            year: "2023",
            value: 56111.0,
          },
          {
            year: "2024",
            value: 64836.6793,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 52130.1,
          },
          {
            year: "2017",
            value: 61222.3,
          },
          {
            year: "2018",
            value: 73255.9,
          },
          {
            year: "2019",
            value: 103266.8981,
          },
          {
            year: "2020",
            value: 67603.3028,
          },
          {
            year: "2021",
            value: 105899.0,
          },
          {
            year: "2022",
            value: 130177.0,
          },
          {
            year: "2023",
            value: 134495.0,
          },
          {
            year: "2024",
            value: 116625.898,
          },
        ],
      },
    },
    牙买加: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1572.5,
          },
          {
            year: "2017",
            value: 4808.9,
          },
          {
            year: "2018",
            value: 7632.1,
          },
          {
            year: "2019",
            value: 2958.3923,
          },
          {
            year: "2020",
            value: 3193.0501,
          },
          {
            year: "2021",
            value: 613.0,
          },
          {
            year: "2022",
            value: 1471.0,
          },
          {
            year: "2023",
            value: 1331.0,
          },
          {
            year: "2024",
            value: 816.6214,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 50614.3,
          },
          {
            year: "2017",
            value: 51657.4,
          },
          {
            year: "2018",
            value: 58331.9,
          },
          {
            year: "2019",
            value: 67070.4363,
          },
          {
            year: "2020",
            value: 63046.2855,
          },
          {
            year: "2021",
            value: 80986.0,
          },
          {
            year: "2022",
            value: 101182.0,
          },
          {
            year: "2023",
            value: 126649.0,
          },
          {
            year: "2024",
            value: 108164.2987,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 52186.8,
          },
          {
            year: "2017",
            value: 56466.3,
          },
          {
            year: "2018",
            value: 65964.0,
          },
          {
            year: "2019",
            value: 70028.8286,
          },
          {
            year: "2020",
            value: 66239.3356,
          },
          {
            year: "2021",
            value: 81599.0,
          },
          {
            year: "2022",
            value: 102653.0,
          },
          {
            year: "2023",
            value: 127980.0,
          },
          {
            year: "2024",
            value: 108980.9201,
          },
        ],
      },
    },
    阿根廷: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 511809.6,
          },
          {
            year: "2017",
            value: 475422.7,
          },
          {
            year: "2018",
            value: 351715.4,
          },
          {
            year: "2019",
            value: 739097.9168,
          },
          {
            year: "2020",
            value: 681445.6938,
          },
          {
            year: "2021",
            value: 712432.0,
          },
          {
            year: "2022",
            value: 859218.0,
          },
          {
            year: "2023",
            value: 661228.0,
          },
          {
            year: "2024",
            value: 703224.8201,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 720370.1,
          },
          {
            year: "2017",
            value: 906721.1,
          },
          {
            year: "2018",
            value: 841807.1,
          },
          {
            year: "2019",
            value: 688415.4384,
          },
          {
            year: "2020",
            value: 708381.3681,
          },
          {
            year: "2021",
            value: 1068798.0,
          },
          {
            year: "2022",
            value: 1272388.0,
          },
          {
            year: "2023",
            value: 1073739.0,
          },
          {
            year: "2024",
            value: 931603.1529,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1232179.7,
          },
          {
            year: "2017",
            value: 1382143.8,
          },
          {
            year: "2018",
            value: 1193522.5,
          },
          {
            year: "2019",
            value: 1427513.3552,
          },
          {
            year: "2020",
            value: 1389827.0619,
          },
          {
            year: "2021",
            value: 1781230.0,
          },
          {
            year: "2022",
            value: 2131606.0,
          },
          {
            year: "2023",
            value: 1734966.0,
          },
          {
            year: "2024",
            value: 1634827.973,
          },
        ],
      },
    },
    巴西: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 4585504.7,
          },
          {
            year: "2017",
            value: 5885715.5,
          },
          {
            year: "2018",
            value: 7756951.8,
          },
          {
            year: "2019",
            value: 7996254.7047,
          },
          {
            year: "2020",
            value: 8551722.1388,
          },
          {
            year: "2021",
            value: 11000670.0,
          },
          {
            year: "2022",
            value: 10936888.0,
          },
          {
            year: "2023",
            value: 12262293.0,
          },
          {
            year: "2024",
            value: 11609345.3277,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 2197927.0,
          },
          {
            year: "2017",
            value: 2895053.8,
          },
          {
            year: "2018",
            value: 3366487.2,
          },
          {
            year: "2019",
            value: 3553906.3912,
          },
          {
            year: "2020",
            value: 3495377.7296,
          },
          {
            year: "2021",
            value: 5361123.0,
          },
          {
            year: "2022",
            value: 6189417.0,
          },
          {
            year: "2023",
            value: 5910157.0,
          },
          {
            year: "2024",
            value: 7207545.7534,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 6783431.7,
          },
          {
            year: "2017",
            value: 8780769.3,
          },
          {
            year: "2018",
            value: 11123439.0,
          },
          {
            year: "2019",
            value: 11550161.0959,
          },
          {
            year: "2020",
            value: 12047099.8684,
          },
          {
            year: "2021",
            value: 16320000.0,
          },
          {
            year: "2022",
            value: 17126305.0,
          },
          {
            year: "2023",
            value: 18172450.0,
          },
          {
            year: "2024",
            value: 18816891.0811,
          },
        ],
      },
    },
    秘鲁: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 949080.8,
          },
          {
            year: "2017",
            value: 1336737.4,
          },
          {
            year: "2018",
            value: 1491430.2,
          },
          {
            year: "2019",
            value: 1519559.8724,
          },
          {
            year: "2020",
            value: 1473547.4137,
          },
          {
            year: "2021",
            value: 2423903.0,
          },
          {
            year: "2022",
            value: 2412616.0,
          },
          {
            year: "2023",
            value: 2556946.0,
          },
          {
            year: "2024",
            value: 2941577.6634,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 599156.3,
          },
          {
            year: "2017",
            value: 695886.5,
          },
          {
            year: "2018",
            value: 806469.2,
          },
          {
            year: "2019",
            value: 851308.2009,
          },
          {
            year: "2020",
            value: 886574.2907,
          },
          {
            year: "2021",
            value: 1330132.0,
          },
          {
            year: "2022",
            value: 1341546.0,
          },
          {
            year: "2023",
            value: 1210924.0,
          },
          {
            year: "2024",
            value: 1394469.852,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 1548237.1,
          },
          {
            year: "2017",
            value: 2032623.9,
          },
          {
            year: "2018",
            value: 2297899.4,
          },
          {
            year: "2019",
            value: 2370868.0733,
          },
          {
            year: "2020",
            value: 2360121.7044,
          },
          {
            year: "2021",
            value: 3754035.0,
          },
          {
            year: "2022",
            value: 3754162.0,
          },
          {
            year: "2023",
            value: 3767871.0,
          },
          {
            year: "2024",
            value: 4336047.5154,
          },
        ],
      },
    },
    玻利维亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 32608.9,
          },
          {
            year: "2017",
            value: 35457.7,
          },
          {
            year: "2018",
            value: 32970.4,
          },
          {
            year: "2019",
            value: 32215.1302,
          },
          {
            year: "2020",
            value: 29121.1957,
          },
          {
            year: "2021",
            value: 64609.0,
          },
          {
            year: "2022",
            value: 87210.0,
          },
          {
            year: "2023",
            value: 145803.0,
          },
          {
            year: "2024",
            value: 172011.5677,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 61055.4,
          },
          {
            year: "2017",
            value: 72917.3,
          },
          {
            year: "2018",
            value: 83616.9,
          },
          {
            year: "2019",
            value: 85414.8191,
          },
          {
            year: "2020",
            value: 68777.7834,
          },
          {
            year: "2021",
            value: 99243.0,
          },
          {
            year: "2022",
            value: 106271.0,
          },
          {
            year: "2023",
            value: 113435.0,
          },
          {
            year: "2024",
            value: 101272.2881,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 93664.3,
          },
          {
            year: "2017",
            value: 108375.0,
          },
          {
            year: "2018",
            value: 116587.3,
          },
          {
            year: "2019",
            value: 117629.9493,
          },
          {
            year: "2020",
            value: 97898.9791,
          },
          {
            year: "2021",
            value: 163852.0,
          },
          {
            year: "2022",
            value: 193481.0,
          },
          {
            year: "2023",
            value: 259238.0,
          },
          {
            year: "2024",
            value: 273283.8558,
          },
        ],
      },
    },
    厄瓜多尔: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 93992.2,
          },
          {
            year: "2017",
            value: 112773.8,
          },
          {
            year: "2018",
            value: 198869.6,
          },
          {
            year: "2019",
            value: 364222.9987,
          },
          {
            year: "2020",
            value: 432075.5517,
          },
          {
            year: "2021",
            value: 545902.0,
          },
          {
            year: "2022",
            value: 681941.0,
          },
          {
            year: "2023",
            value: 779730.0,
          },
          {
            year: "2024",
            value: 800053.2468,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 225802.6,
          },
          {
            year: "2017",
            value: 296320.8,
          },
          {
            year: "2018",
            value: 371783.1,
          },
          {
            year: "2019",
            value: 362857.4265,
          },
          {
            year: "2020",
            value: 325232.8191,
          },
          {
            year: "2021",
            value: 548344.0,
          },
          {
            year: "2022",
            value: 624080.0,
          },
          {
            year: "2023",
            value: 586081.0,
          },
          {
            year: "2024",
            value: 596848.7001,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 319794.8,
          },
          {
            year: "2017",
            value: 409094.6,
          },
          {
            year: "2018",
            value: 570652.7,
          },
          {
            year: "2019",
            value: 727080.4252,
          },
          {
            year: "2020",
            value: 757308.3708,
          },
          {
            year: "2021",
            value: 1094246.0,
          },
          {
            year: "2022",
            value: 1306022.0,
          },
          {
            year: "2023",
            value: 1365811.0,
          },
          {
            year: "2024",
            value: 1396901.9469,
          },
        ],
      },
    },
    圭亚那: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2825.5,
          },
          {
            year: "2017",
            value: 3839.1,
          },
          {
            year: "2018",
            value: 4308.3,
          },
          {
            year: "2019",
            value: 4598.6503,
          },
          {
            year: "2020",
            value: 30886.4649,
          },
          {
            year: "2021",
            value: 31991.0,
          },
          {
            year: "2022",
            value: 130303.0,
          },
          {
            year: "2023",
            value: 43769.0,
          },
          {
            year: "2024",
            value: 42855.6184,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 17836.1,
          },
          {
            year: "2017",
            value: 18863.8,
          },
          {
            year: "2018",
            value: 22203.4,
          },
          {
            year: "2019",
            value: 27291.4331,
          },
          {
            year: "2020",
            value: 26547.0258,
          },
          {
            year: "2021",
            value: 39025.0,
          },
          {
            year: "2022",
            value: 56581.0,
          },
          {
            year: "2023",
            value: 79243.0,
          },
          {
            year: "2024",
            value: 97761.4384,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 20661.6,
          },
          {
            year: "2017",
            value: 22702.9,
          },
          {
            year: "2018",
            value: 26511.7,
          },
          {
            year: "2019",
            value: 31890.0834,
          },
          {
            year: "2020",
            value: 57433.4907,
          },
          {
            year: "2021",
            value: 71016.0,
          },
          {
            year: "2022",
            value: 186884.0,
          },
          {
            year: "2023",
            value: 123011.0,
          },
          {
            year: "2024",
            value: 140617.0568,
          },
        ],
      },
    },
    苏里南: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 2929.3,
          },
          {
            year: "2017",
            value: 2623.8,
          },
          {
            year: "2018",
            value: 5303.2,
          },
          {
            year: "2019",
            value: 5351.3357,
          },
          {
            year: "2020",
            value: 6110.2677,
          },
          {
            year: "2021",
            value: 4186.0,
          },
          {
            year: "2022",
            value: 4581.0,
          },
          {
            year: "2023",
            value: 5455.68,
          },
          {
            year: "2024",
            value: 6098.0416,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 13673.2,
          },
          {
            year: "2017",
            value: 17754.9,
          },
          {
            year: "2018",
            value: 21486.0,
          },
          {
            year: "2019",
            value: 23452.8148,
          },
          {
            year: "2020",
            value: 22133.0419,
          },
          {
            year: "2021",
            value: 27674.0,
          },
          {
            year: "2022",
            value: 31368.0,
          },
          {
            year: "2023",
            value: 32959.0,
          },
          {
            year: "2024",
            value: 36319.4439,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 16602.5,
          },
          {
            year: "2017",
            value: 20378.7,
          },
          {
            year: "2018",
            value: 26789.2,
          },
          {
            year: "2019",
            value: 28804.1505,
          },
          {
            year: "2020",
            value: 28243.3096,
          },
          {
            year: "2021",
            value: 31860.0,
          },
          {
            year: "2022",
            value: 35949.0,
          },
          {
            year: "2023",
            value: 38415.0,
          },
          {
            year: "2024",
            value: 42417.4855,
          },
        ],
      },
    },
    委内瑞拉: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 556281.9,
          },
          {
            year: "2017",
            value: 721992.2,
          },
          {
            year: "2018",
            value: 743139.6,
          },
          {
            year: "2019",
            value: 486033.4717,
          },
          {
            year: "2020",
            value: 53423.8475,
          },
          {
            year: "2021",
            value: 99409.0,
          },
          {
            year: "2022",
            value: 83362.0,
          },
          {
            year: "2023",
            value: 74583.0,
          },
          {
            year: "2024",
            value: 159967.783,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 251953.6,
          },
          {
            year: "2017",
            value: 174640.5,
          },
          {
            year: "2018",
            value: 114579.0,
          },
          {
            year: "2019",
            value: 154007.5399,
          },
          {
            year: "2020",
            value: 151883.9399,
          },
          {
            year: "2021",
            value: 218588.0,
          },
          {
            year: "2022",
            value: 296562.0,
          },
          {
            year: "2023",
            value: 345055.0,
          },
          {
            year: "2024",
            value: 480173.0718,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 808235.5,
          },
          {
            year: "2017",
            value: 896632.7,
          },
          {
            year: "2018",
            value: 857718.6,
          },
          {
            year: "2019",
            value: 640041.0116,
          },
          {
            year: "2020",
            value: 205307.7874,
          },
          {
            year: "2021",
            value: 317997.0,
          },
          {
            year: "2022",
            value: 379925.0,
          },
          {
            year: "2023",
            value: 419638.0,
          },
          {
            year: "2024",
            value: 640140.8548,
          },
        ],
      },
    },
    乌拉圭: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 194810.1,
          },
          {
            year: "2017",
            value: 265021.7,
          },
          {
            year: "2018",
            value: 255622.6,
          },
          {
            year: "2019",
            value: 296771.399,
          },
          {
            year: "2020",
            value: 236732.2761,
          },
          {
            year: "2021",
            value: 362447.0,
          },
          {
            year: "2022",
            value: 445728.0,
          },
          {
            year: "2023",
            value: 232645.0,
          },
          {
            year: "2024",
            value: 331969.0738,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 177325.4,
          },
          {
            year: "2017",
            value: 215152.4,
          },
          {
            year: "2018",
            value: 206442.5,
          },
          {
            year: "2019",
            value: 194899.0863,
          },
          {
            year: "2020",
            value: 170304.9774,
          },
          {
            year: "2021",
            value: 285803.0,
          },
          {
            year: "2022",
            value: 295643.0,
          },
          {
            year: "2023",
            value: 296897.0,
          },
          {
            year: "2024",
            value: 326850.0906,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 372135.5,
          },
          {
            year: "2017",
            value: 480174.1,
          },
          {
            year: "2018",
            value: 462065.1,
          },
          {
            year: "2019",
            value: 491670.4853,
          },
          {
            year: "2020",
            value: 407037.2535,
          },
          {
            year: "2021",
            value: 648250.0,
          },
          {
            year: "2022",
            value: 741371.0,
          },
          {
            year: "2023",
            value: 529542.0,
          },
          {
            year: "2024",
            value: 658819.1644,
          },
        ],
      },
    },
    智利: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1860496.4,
          },
          {
            year: "2017",
            value: 2117553.2,
          },
          {
            year: "2018",
            value: 2673070.9,
          },
          {
            year: "2019",
            value: 2622920.0573,
          },
          {
            year: "2020",
            value: 2993201.3213,
          },
          {
            year: "2021",
            value: 3957795.0,
          },
          {
            year: "2022",
            value: 4445643.0,
          },
          {
            year: "2023",
            value: 4300782.0,
          },
          {
            year: "2024",
            value: 4100239.8481,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1280674.1,
          },
          {
            year: "2017",
            value: 1440984.9,
          },
          {
            year: "2018",
            value: 1587363.1,
          },
          {
            year: "2019",
            value: 1471183.8585,
          },
          {
            year: "2020",
            value: 1533652.5026,
          },
          {
            year: "2021",
            value: 2629229.0,
          },
          {
            year: "2022",
            value: 2241942.0,
          },
          {
            year: "2023",
            value: 1950764.0,
          },
          {
            year: "2024",
            value: 2065275.8909,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 3141170.5,
          },
          {
            year: "2017",
            value: 3558538.1,
          },
          {
            year: "2018",
            value: 4260434.0,
          },
          {
            year: "2019",
            value: 4094103.9158,
          },
          {
            year: "2020",
            value: 4526853.8239,
          },
          {
            year: "2021",
            value: 6587024.0,
          },
          {
            year: "2022",
            value: 6687585.0,
          },
          {
            year: "2023",
            value: 6251546.0,
          },
          {
            year: "2024",
            value: 6165515.739,
          },
        ],
      },
    },
    巴布亚新几内亚: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 163069.4,
          },
          {
            year: "2017",
            value: 207033.2,
          },
          {
            year: "2018",
            value: 282584.6,
          },
          {
            year: "2019",
            value: 302393.2802,
          },
          {
            year: "2020",
            value: 227089.5657,
          },
          {
            year: "2021",
            value: 300045.0,
          },
          {
            year: "2022",
            value: 379649.0,
          },
          {
            year: "2023",
            value: 354560.0,
          },
          {
            year: "2024",
            value: 327317.4305,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 64805.3,
          },
          {
            year: "2017",
            value: 77499.4,
          },
          {
            year: "2018",
            value: 78557.5,
          },
          {
            year: "2019",
            value: 80043.0424,
          },
          {
            year: "2020",
            value: 92282.0429,
          },
          {
            year: "2021",
            value: 105016.0,
          },
          {
            year: "2022",
            value: 140861.0,
          },
          {
            year: "2023",
            value: 128921.0,
          },
          {
            year: "2024",
            value: 133042.876,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 227874.7,
          },
          {
            year: "2017",
            value: 284532.6,
          },
          {
            year: "2018",
            value: 361142.1,
          },
          {
            year: "2019",
            value: 382436.3226,
          },
          {
            year: "2020",
            value: 319371.6086,
          },
          {
            year: "2021",
            value: 405061.0,
          },
          {
            year: "2022",
            value: 520510.0,
          },
          {
            year: "2023",
            value: 483481.0,
          },
          {
            year: "2024",
            value: 460360.3065,
          },
        ],
      },
    },
    斐济: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1718.1,
          },
          {
            year: "2017",
            value: 1752.2,
          },
          {
            year: "2018",
            value: 2531.0,
          },
          {
            year: "2019",
            value: 1441.8449,
          },
          {
            year: "2020",
            value: 2353.9373,
          },
          {
            year: "2021",
            value: 5554.0,
          },
          {
            year: "2022",
            value: 4333.0,
          },
          {
            year: "2023",
            value: 2029.0,
          },
          {
            year: "2024",
            value: 2803.5476,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 38405.3,
          },
          {
            year: "2017",
            value: 36549.5,
          },
          {
            year: "2018",
            value: 45667.0,
          },
          {
            year: "2019",
            value: 35029.4094,
          },
          {
            year: "2020",
            value: 32217.9664,
          },
          {
            year: "2021",
            value: 39740.0,
          },
          {
            year: "2022",
            value: 49570.0,
          },
          {
            year: "2023",
            value: 50578.0,
          },
          {
            year: "2024",
            value: 50615.9019,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 40123.4,
          },
          {
            year: "2017",
            value: 38301.7,
          },
          {
            year: "2018",
            value: 48198.0,
          },
          {
            year: "2019",
            value: 36471.2543,
          },
          {
            year: "2020",
            value: 34571.9037,
          },
          {
            year: "2021",
            value: 45294.0,
          },
          {
            year: "2022",
            value: 53903.0,
          },
          {
            year: "2023",
            value: 52607.0,
          },
          {
            year: "2024",
            value: 53419.4495,
          },
        ],
      },
    },
    基里巴斯: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 2486.8,
          },
          {
            year: "2017",
            value: 1539.8,
          },
          {
            year: "2018",
            value: 1783.6,
          },
          {
            year: "2019",
            value: 2015.985,
          },
          {
            year: "2020",
            value: 2440.8644,
          },
          {
            year: "2021",
            value: 3905.0,
          },
          {
            year: "2022",
            value: 4178.0,
          },
          {
            year: "2023",
            value: 3779.0,
          },
          {
            year: "2024",
            value: 5382.588,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 3436.1,
          },
          {
            year: "2017",
            value: 1580.4,
          },
          {
            year: "2018",
            value: 1793.9,
          },
          {
            year: "2019",
            value: 2110.1021,
          },
          {
            year: "2020",
            value: 2463.034,
          },
          {
            year: "2021",
            value: 3905.0,
          },
          {
            year: "2022",
            value: 4179.0,
          },
          {
            year: "2023",
            value: 3782.0,
          },
          {
            year: "2024",
            value: 5382.6742,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 949.3,
          },
          {
            year: "2017",
            value: 40.6,
          },
          {
            year: "2018",
            value: 10.3,
          },
          {
            year: "2019",
            value: 94.1171,
          },
          {
            year: "2020",
            value: 22.1696,
          },
          {
            year: "2021",
            value: 0.5,
          },
          {
            year: "2022",
            value: 0.1,
          },
          {
            year: "2023",
            value: 2.4735,
          },
          {
            year: "2024",
            value: 0.0862,
          },
        ],
      },
    },
    库克群岛: {
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 120.4,
          },
          {
            year: "2017",
            value: 576.6,
          },
          {
            year: "2018",
            value: 250.2,
          },
          {
            year: "2019",
            value: 175.5682,
          },
          {
            year: "2020",
            value: 264.3564,
          },
          {
            year: "2021",
            value: 205.0,
          },
          {
            year: "2022",
            value: 82.0,
          },
          {
            year: "2023",
            value: 244.1194,
          },
          {
            year: "2024",
            value: 12.4447,
          },
        ],
      },
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 321.5,
          },
          {
            year: "2017",
            value: 741.9,
          },
          {
            year: "2018",
            value: 518.7,
          },
          {
            year: "2019",
            value: 4265.2721,
          },
          {
            year: "2020",
            value: 548.5041,
          },
          {
            year: "2021",
            value: 401.0,
          },
          {
            year: "2022",
            value: 1136.0,
          },
          {
            year: "2023",
            value: 1430.4245,
          },
          {
            year: "2024",
            value: 2086.5865,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 441.9,
          },
          {
            year: "2017",
            value: 1318.5,
          },
          {
            year: "2018",
            value: 768.9,
          },
          {
            year: "2019",
            value: 4440.8403,
          },
          {
            year: "2020",
            value: 812.8605,
          },
          {
            year: "2021",
            value: 606.0,
          },
          {
            year: "2022",
            value: 1218.0,
          },
          {
            year: "2023",
            value: 1674.5439,
          },
          {
            year: "2024",
            value: 2099.0312,
          },
        ],
      },
    },
    密克罗尼西亚联邦: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 1418.2,
          },
          {
            year: "2017",
            value: 2628.7,
          },
          {
            year: "2018",
            value: 1854.1,
          },
          {
            year: "2019",
            value: 1864.5796,
          },
          {
            year: "2020",
            value: 2086.5628,
          },
          {
            year: "2021",
            value: 2012.0,
          },
          {
            year: "2022",
            value: 3019.0,
          },
          {
            year: "2023",
            value: 2586.1328,
          },
          {
            year: "2024",
            value: 2955.6762,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 2107.4,
          },
          {
            year: "2017",
            value: 3794.3,
          },
          {
            year: "2018",
            value: 4031.6,
          },
          {
            year: "2019",
            value: 3122.037,
          },
          {
            year: "2020",
            value: 2812.6037,
          },
          {
            year: "2021",
            value: 3755.0,
          },
          {
            year: "2022",
            value: 3030.0,
          },
          {
            year: "2023",
            value: 5698.9946,
          },
          {
            year: "2024",
            value: 12268.1979,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 689.2,
          },
          {
            year: "2017",
            value: 1165.6,
          },
          {
            year: "2018",
            value: 2177.5,
          },
          {
            year: "2019",
            value: 1257.4574,
          },
          {
            year: "2020",
            value: 726.0409,
          },
          {
            year: "2021",
            value: 1743.0,
          },
          {
            year: "2022",
            value: 10.0,
          },
          {
            year: "2023",
            value: 3112.8618,
          },
          {
            year: "2024",
            value: 9312.5217,
          },
        ],
      },
    },
    瑙鲁: {
      从中国进口: {
        value: [
          {
            year: "2016",
            value: 140.5,
          },
          {
            year: "2017",
            value: 42.3,
          },
          {
            year: "2018",
            value: 191.1,
          },
          {
            year: "2019",
            value: 122.6911,
          },
          {
            year: "2020",
            value: 193.9304,
          },
          {
            year: "2021",
            value: 1128.0,
          },
          {
            year: "2022",
            value: 1233.0,
          },
          {
            year: "2023",
            value: 599.5769,
          },
          {
            year: "2024",
            value: 1143.0123,
          },
        ],
      },
      与中国进出口总额: {
        value: [
          {
            year: "2016",
            value: 142.2,
          },
          {
            year: "2017",
            value: 69.9,
          },
          {
            year: "2018",
            value: 203.2,
          },
          {
            year: "2019",
            value: 125.295,
          },
          {
            year: "2020",
            value: 202.0817,
          },
          {
            year: "2021",
            value: 1139.0,
          },
          {
            year: "2022",
            value: 1244.0,
          },
          {
            year: "2023",
            value: 599.9542,
          },
          {
            year: "2024",
            value: 1975.4502,
          },
        ],
      },
      对中国出口: {
        value: [
          {
            year: "2016",
            value: 1.7,
          },
          {
            year: "2017",
            value: 27.6,
          },
          {
            year: "2018",
            value: 12.1,
          },
          {
            year: "2019",
            value: 2.6039,
          },
          {
            year: "2020",
            value: 8.1513,
          },
          {
            year: "2021",
            value: 11.0,
          },
          {
            year: "2022",
            value: 11.0,
          },
          {
            year: "2023",
            value: 0.3773,
          },
          {
            year: "2024",
            value: 832.4379,
          },
        ],
      },
    },
  },
];
